

var wenxuan=[
    {
        name:"梦归赋",
        author:"柳宗元",
        content:"公在永州，怀思乡闾而作也。晁无咎曰：宗元既贬，悔其年少气锐，不识几微，久幽不还，故作《梦归赋》。初言览故乡乔木而悲，中言仲尼欲居九夷，老子适戎以自释，末云首丘鸣号，示终不忘其旧。当世怜之，然众畏其才高，竟废不起。\n罹摈斥以窘束兮，余惟梦之为归。精气注以凝冱兮，循旧乡而顾怀。夕余寐于荒陬兮，心慊慊而莫违。质舒解以自恣兮，息愔翳而愈微。歘腾涌而上浮兮，俄滉瀁之无依。圆方混而不形兮，颢醇白之霏霏。上茫茫而无星辰兮，下不见夫水陆。若有鉥余以往路兮，驭儗儗以回复。浮云纵以直度兮，去济余乎西北。风纚纚以经耳兮，类行舟迅而不息。洞然于以弥漫兮，虹霓罗列而倾侧。横冲飙以荡击兮，忽中断而迷惑。灵幽漠以瀄汨兮，进怊怅而不得。白日邈其中出兮，阴霾披离以泮释。施岳渎以定位兮，互参差之白黑。忽崩骞上下兮，聊按行而自抑。指故都以委坠兮，瞰乡闾之修直。原田芜秽兮峥嵘，榛棘乔木摧解兮垣庐，不饰山嵎嵎以嵓立兮，水汨汨以漂激。魂怳惘若有亡兮，涕汪浪以陨轼。类曛黄之黭漠兮，欲周流而无所。极纷若喜而佁儗兮，心回互以壅塞。钟鼓喤以戒旦兮，陶去幽而开寤。罾罻蒙其复体兮，孰云桎梏之不固。精神之不可再兮，余无蹈夫归路。 \n伟仲尼之圣德兮，谓九夷之可居。惟道大而无所入兮，犹流游乎旷野。老聃遁而适戎兮，指淳茫以纵步。蒙庄之恢怪兮，寓大鹏之远去。苟远适之若兹兮，胡为故国之为慕。 \n首丘之仁类兮，斯君子之所誉。鸟兽之鸣号兮，有动心而曲顾。胶余衷之莫能舍兮，虽判拆而不悟。列兹梦以三复兮，极明昏而告愬。",
    },

    {
        name:"与吴质书",
        author:"曹丕",
        content:"二月三日，丕白。岁月易得，别来行复四年。三年不见，《东山》犹叹其远，况乃过之，思何可支！虽书疏往返，未足解其劳结。\n昔年疾疫，亲故多离其灾，徐、陈、应、刘，一时俱逝，痛可言邪？昔日游处，行则连舆，止则接席，何曾须臾相失！每至觞酌流行，丝竹并奏，酒酣耳热，仰而赋诗，当此之时，忽然不自知乐也。谓百年己分，可长共相保，何图数年之间，零落略尽，言之伤心。顷撰其遗文，都为一集，观其姓名，已为鬼录。追思昔游，犹在心目，而此诸子，化为粪壤，可复道哉？\n观古今文人，类不护细行，鲜能以名节自立。而伟长独怀文抱质，恬淡寡欲，有箕山之志，可谓彬彬君子者矣。著《中论》二十余篇，成一家之言，词义典雅，足传于后，此子为不朽矣。德琏常斐然有述作之意，其才学足以著书，美志不遂，良可痛惜。间者历览诸子之文，对之抆泪，既痛逝者，行自念也。孔璋章表殊健，微为繁富。公干有逸气，但未遒耳；其五言诗之善者，妙绝时人。元瑜书记翩翩，致足乐也。仲宣独自善于辞赋，惜其体弱，不足起其文，至于所善，古人无以远过。昔伯牙绝弦于钟期，仲尼覆醢于子路，痛知音之难遇，伤门人之莫逮。诸子但为未及古人，自一时之儁也，今之存者，已不逮矣。后生可畏，来者难诬，然恐吾与足下不及见也。\n年行已长大，所怀万端，时有所虑，至通夜不瞑，志意何时复类昔日?已成老翁，但未白头耳。光武言：“年三十余，在兵中十岁，所更非一。”吾德不及之，而年与之齐矣。以犬羊之质，服虎豹之文，无众星之明，假日月之光，动见瞻观，何时易乎？恐永不复得为昔日游也。少壮真当努力，年一过往，何可攀援，古人思秉烛夜游，良有以也。\n顷何以自娱？颇复有所述造不？东望於邑，裁书叙心。丕白。",
    },

    {
        name:"月赋",
        author:"谢庄",
        content:"陈王初丧应、刘，端忧多暇。绿苔生阁，芳尘凝榭。悄焉疚怀，不怡中夜。\n乃清兰路，肃桂苑，腾吹寒山，弭盖秋阪。临浚壑而怨遥，登崇岫而伤远。于时斜汉左界，北陆南躔，白露暧空，素月流天。沈吟齐章，殷勤陈篇，抽毫进牍，以命仲宣。\n仲宣跪而称曰：臣东鄙幽介，长自丘樊。昧道懵学，孤奉明恩。臣闻沈潜既义，高明既经，日以阳德，月以阴灵。擅扶光于东沼，嗣若英于西冥。引玄兔于帝台，集素娥于后庭。朒脁警阙，朏魄示冲，顺辰通烛，从星泽风。增华台室，扬采轩宫。委照而吴业昌，沦精而汉道融。\n若夫气霁地表，云敛天末，洞庭始波，木叶微脱。菊散芳于山椒，雁流哀于江濑。升清质之悠悠，降澄辉之蔼蔼。列宿掩缛，长河韬映，柔祇雪凝，圆灵水镜。连观霜缟，周除冰净。君王乃厌晨欢，乐宵宴，收妙舞，弛清县。去烛房，即月殿，芳酒登，鸣琴荐。\n若乃凉夜自凄，风篁成韵，亲懿莫从，羇孤递进。聆皋禽之夕闻，听朔管之秋引。于是弦桐练响，音容选和，徘徊房露，惆怅阳阿。声林虚籁，沦池灭波，情纡轸其何托，愬皓月而长歌。歌曰：\n美人迈兮音尘阙，隔千里兮共明月。\n临风叹兮将焉歇，川路长兮不可越。\n歌响未终，余景就毕，满堂变容，回遑如失。又称歌曰：\n月既没兮露欲晞，岁方晏兮无与归。\n佳期可以还，微霜沾人衣。\n陈王曰：善。乃命执事，献寿羞璧，敬佩玉音，复之无斁。",
    },

    {
        name:"鸣蝉赋",
        author:"欧阳修",
        content:"嘉元年夏，大雨水，奉诏祈晴于醴泉宫，闻鸣蝉，有感而赋云。\n肃祠庭以祗事兮，瞻玉宇之峥嵘。收视听以清虑兮，斋予心以荐诚。因以静而求动兮，见乎万物之情。于时朝雨骤止，微风不兴。四无云以青天，雷曳曳其余声。乃席芳药，临华轩。古木数株，空庭草间，爰有一物，鸣于树颠。引清风以长啸，抱纤柯而永叹。嘒嘒非管，泠泠若弦。裂方号而复咽，凄欲断而还连。吐孤韵以难律，含五音之自然。吾不知其何物，其名曰蝉。岂非因物造形能变化者邪？出自粪壤慕清虚者邪？凌风高飞知所止者邪？嘉木茂树喜清阴者邪？呼吸风露能尸解者邪？绰约双鬓修婵娟者邪？其为声也，不乐不哀，非宫非徵。胡然而鸣，亦胡然而止。\n吾尝悲夫万物莫不好鸣。若乃四时代谢，百鸟嘤兮；一气候至，百虫惊兮；娇儿姹女，语鹂庚兮；鸣机络纬，响蟋蟀兮。转喉弄舌，诚可爱兮。引腹动股，岂勉强而为之兮？至于污池浊水，得雨而聒兮；饮泉食土，长夜而歌兮。彼蟆固若有欲，而蚯蚓又何求兮？其余大小万状，不可悉名。各有气类，随其物形。不知自止，有若争能。忽时变以物改，咸漠然而无声。\n呜呼！达士所齐，万物一类。人于其间，所以为贵，盖已巧其语言，又能传于文字。是以穷彼思虑，耗其血气，或吟哦其穷愁，或发扬其志意。虽共尽于万物，乃长鸣于百世。予亦安知其然哉？聊为乐以自喜。方将考得失，较同异。俄而阴云复兴，雷电俱击，大雨既作，蝉声遂息。",
    },

    {
        name:"秋声赋",
        author:"刘禹锡",
        content:"相国中山公赋《秋声》，以属天官太常伯，唱和俱绝，然皆得时行道之余兴，犹动光阴之叹，况伊郁老病者乎？吟之斐然，以寄孤愤。\n碧天如水兮，窅窅悠悠。百虫迎暮兮，万叶吟秋。欲辞林而萧飒，潜命侣以啁啾。送将归兮临水，非吾土兮登楼。晚枝多露蝉之思，夕草起寒螿之愁。\n至若松竹含韵，梧楸圣脱。惊绮疏之晓吹，坠碧砌之凉月。念塞外之征行，顾闺中之骚屑。夜蛩鸣兮机杼促，朔雁叫兮音书绝。远杵续兮何冷冷，虚窗静兮空切切。如吟如啸，非竹非丝。合自然之宫徵，动终岁之别离。废井苔冷，荒园露滋。草苍苍兮人寂寂，树槭槭兮虫咿咿。则有安石风流，巨源多可。平六符而佐主，施九流而自我。犹复感阴虫之鸣轩，叹凉叶之初堕。异宋玉之悲伤，觉潘郎之幺么。\n嗟乎！骥伏枥而已老，鹰在韝而有情。聆朔风而心动，眄天籁而神惊。力将痑兮足受绁，犹奋迅于秋声。",
    },
    {
        name:"洛神赋",
        author:"曹植",
        content:"黄初三年，余朝京师，还济洛川。古人有言：斯水之神，名曰宓妃。感宋玉对楚王神女之事，遂作斯赋。其辞曰：\n余从京域，言归东藩，背伊阙，越轘辕，经通谷，陵景山。日既西倾，车殆马烦。尔乃税驾乎蘅皋，秣驷乎芝田，容与乎阳林，流眄乎洛川。于是精移神骇，忽焉思散。俯则未察，仰以殊观。睹一丽人，于岩之畔。乃援御者而告之曰：“尔有觌于彼者乎？彼何人斯，若此之艳也！”御者对曰：“臣闻河洛之神，名曰宓妃。然则君王之所见也，无乃是乎！其状若何？臣愿闻之。”\n余告之曰：其形也，翩若惊鸿，婉若游龙。荣曜秋菊，华茂春松。髣髴兮若轻云之蔽月，飘飖兮若流风之回雪。远而望之，皎若太阳升朝霞；迫而察之，灼若芙蕖出渌波。穠纤得衷，修短合度。肩若削成，腰如约素。延颈秀项，皓质呈露。芳泽无加，铅华弗御。云髻峨峨，修眉联娟。丹唇外朗，皓齿内鲜。明眸善睐，靥辅承权。瓌姿艳逸，仪静体闲。柔情绰态，媚于语言。奇服旷世，骨像应图。披罗衣之璀粲兮，珥瑶碧之华琚。戴金翠之首饰，缀明珠以耀躯。践远游之文履，曳雾绡之轻裾。微幽兰之芳蔼兮，步踟蹰于山隅。于是忽焉纵体，以遨以嬉。左倚采旄，右荫桂旗。攘皓腕于神浒兮，采湍濑之玄芝。\n余情悦其淑美兮，心振荡而不怡。无良媒以接欢兮，托微波而通辞。愿诚素之先达兮，解玉佩以要之。嗟佳人之信修兮，羌习礼而明诗。抗琼珶以和予兮，指潜渊而为期。执眷眷之款实兮，惧斯灵之我欺。感交甫之弃言兮，怅犹豫而狐疑。收和颜而静志兮，申礼防以自持。\n于是洛灵感焉，徙倚彷徨。神光离合，乍阴乍阳。竦轻躯以鹤立，若将飞而未翔。践椒涂之郁烈，步蘅薄而流芳。超长吟以永慕兮，声哀厉而弥长。尔乃众灵杂沓，命俦啸侣。或戏清流，或翔神渚，或采明珠，或拾翠羽。从南湘之二妃，携汉滨之游女。叹匏瓜之无匹兮，咏牵牛之独处。扬轻袿之猗靡兮，翳修袖以延伫。体迅飞凫，飘忽若神。凌波微步，罗袜生尘。动无常则，若危若安；进止难期，若往若还。转眄流精，光润玉颜。含辞未吐，气若幽兰。华容婀娜，令我忘餐。\n于是屏翳收风，川后静波。冯夷鸣鼓，女娲清歌。腾文鱼以警乘，鸣玉銮以偕逝。六龙俨其齐首，载云车之容裔。鲸鲵踊而夹毂，水禽翔而为卫。于是越北沚，过南冈，纡素领，回清扬。动朱唇以徐言，陈交接之大纲。恨人神之道殊兮，怨盛年之莫当。抗罗袂以掩涕兮，泪流襟之浪浪。悼良会之永绝兮，哀一逝而异乡。无微情以效爱兮，献江南之明珰。虽潜处于太阴，长寄心于君王。忽不悟其所舍，怅神宵而蔽光。\n于是背下陵高，足往神留。遗情想像，顾望怀愁。冀灵体之复形，御轻舟而上溯。浮长川而忘反，思绵绵而增慕。夜耿耿而不寐，沾繁霜而至曙。命仆夫而就驾，吾将归乎东路。揽騑辔以抗策，怅盘桓而不能去。",
    },
    {
        name:"大墙上蒿行",
        author:"曹丕",
        content:"阳春无不长成，草木群类，随大风起。零落若何翩翩，中心独立一何茕。四时舍我驱驰，今我隐约欲何为？人生居天壤间，忽如飞鸟栖枯枝。我今隐约欲何为？\n适君身体所服，何不恣君口腹所尝？冬被貂鼲温暖，夏当服绮罗轻凉。行力自苦，我将欲何为？不及君少壮之时，乘坚车、策肥马良。上有仓浪之天，今我难得久来视。下有蠕蠕之地，今我难得久来履。何不恣意遨游，从君所喜？\n带我宝剑。今尔何为自低昂？悲丽平壮观，白如积雪，利若秋霜。驳犀标首，玉琢中央。帝王所服，辟除凶殃。御左右，奈何致福祥？吴之辟闾，越之步光，楚之龙泉，韩有墨阳，苗山之铤，羊头之钢。知名前代，咸自谓丽且美，曾不如君剑良绮难忘。\n冠青云之崔嵬，纤罗为缨，饰以翠翰，既美且轻。表容仪，俯仰垂光荣。宋之章甫，齐之高冠，亦自谓美，盖何足观？\n排金铺，坐玉堂。风尘不起，天气清凉。奏桓瑟，舞赵倡。女娥长歌，声协宫商。感心动耳，荡气回肠。酌桂酒，脍鲤鲂。与佳人期为乐康。前奉玉卮，为我行觞。\n今日乐，不可忘，乐未央。为乐常苦迟，岁月逝，忽若飞。何为自苦，使我心悲。",
    },
    {
        name:"小园赋",
        author:"庾信",
        content:"若夫一枝之上，巢父得安巢之所；一壶之中，壶公有容身之地。况乎管宁藜床，虽穿而可座；嵇康锻灶，既暖而堪眠。岂必连闼洞房，南阳樊重之第；赤墀青锁，西汉王根之宅。余有数亩敝庐，寂寞人外，聊以拟伏腊，聊以避风霜。虽复晏婴近市，不求朝夕之利；潘岳面城，且适闲居之乐。况乃黄鹤戒露，非有意于轮轩；爰居避风，本无情于钟鼓。陆机则兄弟同居，韩康则舅甥不别，蜗角蚊睫，又足相容者也。\n尔乃窟室徘徊，聊同凿坯。桐间露落，柳下风来。琴号珠柱，书名玉杯。有棠梨而无馆，足酸枣而非台。犹得敧侧八九丈，纵横数十步，榆柳两三行，梨桃百余树。拨蒙密兮见窗，行敧斜兮得路。蝉有翳兮不惊，雉无罗兮何惧！草树混淆，枝格相交。山为篑覆，地有堂坳。藏狸并窟，乳鹊重巢。连珠细茵，长柄寒匏。可以疗饥，可以栖迟，崎岖兮狭室，穿漏兮茅茨。檐直倚而妨帽，户平行而碍眉。坐帐无鹤，支床有龟。鸟多闲暇，花随四时。心则历陵枯木，发则睢阳乱丝。非夏日而可畏，异秋天而可悲。\n一寸二寸之鱼，三竿两竿之竹。云气荫于丛蓍，金精养于秋菊。枣酸梨酢，桃榹李薁。落叶半床，狂花满屋。名为野人之家，是谓愚公之谷。试偃息于茂林，乃久羡于抽簪。虽有门而长闭，实无水而恒沉。三春负锄相识，五月披裘见寻。问葛洪之药性，访京房之卜林。草无忘忧之意，花无长乐之心。鸟何事而逐酒？鱼何情而听琴？\n加以寒暑异令，乖违德性。崔骃以不乐损年，吴质以长愁养病。镇宅神以薶石，厌山精而照镜。屡动庄舄之吟，几行魏颗之命。薄晚闲闺，老幼相携；蓬头王霸之子，椎髻梁鸿之妻。燋麦两瓮，寒菜一畦。风骚骚而树急，天惨惨而云低。聚空仓而雀噪，惊懒妇而蝉嘶。\n昔草滥于吹嘘，籍文言之庆余。门有通德，家承赐书。或陪玄武之观，时参凤凰之墟。观受釐于宣室，赋长杨于直庐。\n遂乃山崩川竭，冰碎瓦裂，大盗潜移，长离永灭。摧直辔于三危，碎平途于九折。荆轲有寒水之悲，苏武有秋风之别。关山则风月凄怆，陇水则肝肠断绝。龟言此地之寒，鹤讶今年之雪。百龄兮倏忽，光华兮已晚。不雪雁门之踦，先念鸿陆之远。非淮海兮可变，非金丹兮能转。不暴骨于龙门，终低头于马坂。谅天造兮昧昧，嗟生民兮浑浑。",
    },
    {
        name:"枯树赋",
        author:"庾信",
        content:"殷仲文风流儒雅，海内知名。世异时移，出为东阳太守。常忽忽不乐，顾庭槐而叹曰：“此树婆娑，生意尽矣！”\n至如白鹿贞松，青牛文梓。根柢盘魄，山崖表里。桂何事而销亡，桐何为而半死？昔之三河徙植，九畹移根。开花建始之殿，落实睢阳之园。声含嶰谷，曲抱《云门》。将雏集凤，比翼巢鸳。临风亭而唳鹤，对月峡而吟猿。乃有拳曲拥肿，盘坳反覆。熊彪顾盼，鱼龙起伏。节竖山连，文横水蹙。匠石惊视，公输眩目。雕镌始就，剞劂仍加。平鳞铲甲，落角摧牙。重重碎锦，片片真花。纷披草树，散乱烟霞。\n若夫松子、古度、平仲、君迁，森梢百顷，槎枿千年。秦则大夫受职，汉则将军坐焉。莫不苔埋菌压，鸟剥虫穿。或低垂于霜露，或撼顿于风烟。东海有白木之庙，西河有枯桑之社，北陆以杨叶为关，南陵以梅根作冶。小山则丛桂留人，扶风则长松系马。岂独城临细柳之上，塞落桃林之下。\n若乃山河阻绝，飘零离别。拔本垂泪，伤根沥血。火入空心，膏流断节。横洞口而敧卧，顿山腰而半折，文斜者百围冰碎，理正者千寻瓦裂。载瘿衔瘤，藏穿抱穴，木魅睒睗，山精妖孽。\n况复风云不感，羁旅无归。未能采葛，还成食薇。沉沦穷巷，芜没荆扉，既伤摇落，弥嗟变衰。《淮南子》云：“木叶落，长年悲。”斯之谓矣。乃歌曰：“建章三月火，黄河万里槎。若非金谷满园树，即是河阳一县花。”桓大司马闻而叹曰：“昔年种柳，依依汉南。今看摇落，凄怆江潭。树犹如此，人何以堪",
    },
    {
        name:"哀江南赋",
        author:"庾信",
        content:"粤以戊辰之年，建亥之月，大盗移国，金陵瓦解。余乃窜身荒谷，公私涂炭。华阳奔命，有去无归。中兴道销，穷于甲戌。三日哭于都亭，三年囚于别馆。天道周星，物极不反。傅燮之但悲身世，无处求生；袁安之每念王室，自然流涕。昔桓君山之志事，杜元凯之平生，并有著书，咸能自序。潘岳之文采，始述家风；陆机之辞赋，先陈世德。信年始二毛，即逢丧乱，藐是流离，至于暮齿。燕歌远别，悲不自胜；楚老相逢，泣将何及！畏南山之雨，忽践秦庭；让东海之滨，遂餐周粟。下亭漂泊，高桥羁旅。楚歌非取乐之方，鲁酒无忘忧之用。追为此赋，聊以记言，不无危苦之辞，惟以悲哀为主。日暮涂远，人间何世！将军一去，大树飘零。壮士不还，寒风萧瑟。荆璧睨柱，受连城而见欺；载书横阶，捧珠盘而不定。钟仪君子，入就南冠之囚；季孙行人，留守西河之馆。申包胥之顿地，碎之以首；蔡威公之泪尽，加之以血。钓台移柳，非玉关之可望；华亭鹤唳，岂河桥之可闻！孙策以天下为三分，众才一旅；项籍用江东之子弟，人惟八千。遂乃分裂山河，宰割天下。岂有百万义师，一朝卷甲，芟夷斩伐，如草木焉？江淮无涯岸之阻，亭壁无藩篱之固。头会箕敛者，合从缔交；锄耰棘矜者，因利乘便。将非江表王气，终于三百年乎！是知并吞六合，不免轵道之灾；混一车书，无救平阳之祸。呜呼！山岳崩颓，既履危亡之运；春秋迭代，必有去故之悲。天意人事，可以凄怆伤心者矣！况复舟楫路穷，星汉非乘槎可上；风飙道阻，蓬莱无可到之期。穷者欲达其言，劳者须歌其事。陆士衡闻而抚掌，是所甘心；张平子见而陋之，固其宜矣。\n我之掌庾承周，以世功而为族；经邦佐汉，用论道而当官。禀嵩华之玉石，润河洛之波澜。居负洛而重世，邑临河而宴安。逮永嘉之艰虞，始中原之乏主。民枕倚于墙壁，路交横于豺虎。值五马之南奔，逢三星之东聚。彼凌江而建国，始播迁于吾祖。分南阳而赐田，裂东岳而胙土。诛茅宋玉之宅，穿径临江之府。水木交运，山川崩竭。家有直道，人多全节。训子见于纯深，事君彰于义烈。新野有生祠之庙，河南有胡书之碣。况乃少微真人，天山逸民，阶庭空谷，门巷蒲轮。移谈讲树，就简书筠。降生世德，载诞贞臣。文词高于甲观，楷模盛于漳滨。嗟有道而无凤，叹非时而有麟。既奸回之奰逆，终不悦于仁人。\n王子滨洛之岁，兰成射策之年。始含香于建礼，仍矫翼于崇贤；游洊雷之讲肆，齿明离之胄筵。既倾蠡而酌海，遂测管而窥天。方塘水白，钓渚池圆。侍戎韬于武帐，听雅曲于文弦。乃解悬而通籍，遂崇文而会武。居笠毂而掌兵，出兰池而典午。论兵于江汉之君，拭玉于西河之主。\n于时朝野欢娱，池台钟鼓。里为冠盖，门成邹鲁。连茂苑于海陵，跨横塘于江浦。东门则鞭石成桥，南极则铸铜为柱。橘则园植万株，竹则家封千户。西赆浮玉，南琛没羽。吴歈越吟，荆艳楚舞。草木之遇阳春，鱼龙之逢风雨。五十年中，江表无事。王歙为和亲之侯，班超为定远之使。马武无预于甲兵，冯唐不论于将帅。岂知山岳闇然，江湖潜沸，渔阳有闾左戍卒，离石有将兵都尉。\n天子方删诗书，定礼乐；设重云之讲，开士林之学；谈劫烬之灰飞，辨常星之夜落。地平鱼齿，城危兽角；卧刁斗于荥阳，绊龙媒于平乐。宰衡以干戈为儿戏，缙绅以清谈为庙略。乘渍水以胶船，驭奔驹以朽索。小人则将及水火，君子则方成猿鹤。敝箄不能救盐池之咸，阿胶不能止黄河之浊。既而鲂鱼赪尾，四郊多垒。殿狎江鸥，宫鸣野雉。湛卢去国，艅艎失水。见被发于伊川，知百年而为戎矣。\n彼奸逆之炽盛，久游魂而放命。大则有鲸有鲵，小则为枭为獍。负其牛羊之力，肆其水草之性；非玉烛之能调，岂璇玑之可正。值天下之无为，尚有欲于羁縻。饮其琉璃之酒，赏其虎豹之皮；见胡柯于大夏，识鸟卵于条枝。豺牙密厉，虺毒潜吹。轻九鼎而欲问，闻三川而遂窥。\n始则王子召戎，奸臣介胄。既官政而离逷，遂师言而泄漏。望廷尉之逋囚，反淮南之穷寇。出狄泉之苍鸟，起横江之困兽。地则石鼓鸣山，天则金精动宿。北阙龙吟，东陵麟斗。\n尔乃桀黠构扇，冯陵畿甸。拥狼望于黄图，填卢山于赤县。青袍如草，白马如练。天子履端废朝，单于长围高宴。两观当戟，千门受箭；白虹贯日，苍鹰击殿；竟遭夏台之祸，终视尧城之变。官守无奔问之人，干戚非平戎之战。陶侃空争米船，顾荣虚摇羽扇。\n将军死绥，路绝长围。烽随星落，书逐鸢飞。乃韩分赵裂，鼓卧旗折。失群班马，迷轮乱辙。猛士婴城，谋臣卷舌。昆阳之战象走林，常山之阵蛇奔穴。五郡则兄弟相悲，三州则父子离别。\n护军慷慨，忠能死节，三世为将，终于此灭。济阳忠壮，身参末将，兄弟三人，义声俱唱。主辱臣死，名存身丧。敌人归元，三军凄怆。尚书多算，守备是长。云梯可拒，地道能防。有齐将之闭壁，无燕师之卧墙。大事去矣，人之云亡！\n申子奋发，勇气咆勃。实总元戎，身先士卒。胄落鱼门，兵填马窟。屡犯通中，频遭刮骨。功业夭枉，身名埋没。或以隼翼鷃披，虎威狐假。沾渍锋镝，脂膏原野。兵弱虏强，城孤气寡。闻鹤唳而心惊，听胡笳而泪下。拒神亭而亡戟，临横江而弃马。崩于钜鹿之沙，碎于长平之瓦。\n于是桂林颠覆，长洲麋鹿。溃溃沸腾，茫茫墋黩。天地离阻，神人惨酷。晋郑靡依，鲁卫不睦。竞动天关，争回地轴。探雀鷇而未饱，待熊蹯而讵熟？乃有车侧郭门，筋悬庙屋。鬼同曹社之谋，人有秦庭之哭。\n尔乃假刻玺于关塞，称使者之酬对。逢鄂坂之讥嫌，值耏门之征税。乘白马而不前，策青骡而转碍。吹落叶之扁舟，飘长风于上游。彼锯牙而钩爪，又循江而习流。排青龙之战舰，斗飞燕之船楼。张辽临于赤壁，王濬下于巴丘。乍风惊而射火，或箭重而沉舟。未辨声于黄盖，已先沉于杜侯。落帆黄鹤之浦，藏船鹦鹉之洲。路已分于湘汉，星犹看于斗牛。\n若乃阴陵失路，钓台斜趣。望赤壁而沾衣，舣乌江而不渡。雷池栅浦，鹊陵焚戍。旅舍无烟，巢禽无树。谓荆衡之杞梓，庶江汉之可恃。淮海维扬，三千馀里。过漂渚而寄食，托芦中而渡水。届于七泽，滨于十死。嗟天保之未定，见殷忧之方始。本不达于危行，又无情于禄仕。谬掌卫于中军，滥尸丞于御史。\n信生世等于龙门，辞亲同于河洛。奉立身之遗训，受成书之顾托。昔三世而无惭，今七叶而始落。泣风雨于梁山，惟枯鱼之衔索。入欹斜之小径，掩蓬藋之荒扉。就汀洲之杜若，待芦苇之单衣。\n于是西楚霸王，剑及繁阳。鏖兵金匮，校战玉堂。苍鹰赤雀，铁舳牙樯。沉白马而誓众，负黄龙而渡江，海潮迎舰，江萍送王。戎军屯于石城，戈船掩于淮泗。诸侯则郑伯前驱，盟主则荀罃暮至。剖巢熏穴，奔魑走魅。埋长狄于驹门，斩蚩尤于中冀。燃腹为灯，饮头为器。直虹贯垒，长星属地。昔之虎踞龙盘，加以黄旗紫气，莫不随狐兔而窟穴，与风尘而殄瘁。\n西瞻博望，北临玄圃，月榭风台，池平树古。倚弓于玉女窗扉，系马于凤皇楼柱。仁寿之镜徒悬，茂陵之书空聚。若夫立德立言，谟明寅亮；声超于系表，道高于河上。更不遇于浮丘，遂无言于师旷。以爱子而托人，知西陵而谁望？非无北阙之兵，犹有云台之仗。\n司徒之表里经纶，狐偃之惟王实勤。横琱戈而对霸主，执金鼓而问贼臣。平吴之功，壮于杜元凯；王室是赖，深于温太真。始则地名全节，终则山称枉人。南阳校书，去之已远；上蔡逐猎，知之何晚？镇北之负誉矜前，风飙凛然。水神遭箭，山灵见鞭。是以蛰熊伤马，浮蛟没船。才子并命，俱非百年。\n中宗之夷凶靖乱，大雪冤耻，去代邸而承基，迁唐郊而纂祀。反旧章于司隶，归馀风于正始。沈猜则方逞其欲，藏疾则自矜于己。天下之事没焉，诸侯之心摇矣。既而齐交北绝，秦患西起。况背关而怀楚，异端委而开吴。驱绿林之散卒，拒骊山之叛徒。营军梁溠，蒐乘巴渝。问诸淫昏之鬼，求诸厌劾之符。荆门遭廪延之戮，夏口滥逵泉之诛。蔑因亲以致爱，忍和乐于弯弧。既无谋于肉食，非所望于论都。未深思于五难，先自擅于三端。登阳城而避险，卧砥柱而求安。既言多于忌刻，实志勇而形残。但坐观于时变，本无情于急难。地惟黑子，城犹弹丸。其怨则黩，其盟则寒。岂冤禽之能塞海？非愚叟之可移山。况以沴气朝浮，妖精夜陨。赤鸟则三朝夹日，苍云则七重围轸。亡吴之岁既穷，入郢之年斯尽。\n周含郑怒，楚结秦冤。有南风之不竞，值西邻之责言。俄而梯冲乱舞，冀马云屯。俴秦车于畅毂，沓汉鼓于雷门。下陈仓而连弩，渡临晋而横船。虽复楚有七泽，人称三户；箭不丽于六麋，雷无惊于九虎。辞洞庭兮落木，去涔阳兮极浦。炽火兮焚旗，贞风兮害蛊。乃使玉轴扬灰，龙文折柱。下江余城，长林故营。徒思拑马之秣，未见烧牛之兵。章曼支以毂走，宫之奇以族行。河无冰而马渡，关未晓而鸡鸣。忠臣解骨，君子吞声。章华望祭之所，云梦伪游之地。荒谷缢于莫敖，冶父囚于群帅。硎穽折拉，鹰鹯批㩌。冤霜夏零，愤泉秋沸。城崩杞妇之哭，竹染湘妃之泪。\n水毒秦泾，山高赵陉。十里五里，长亭短亭。饥随蛰燕，暗逐流萤。秦中水黑，关上泥青。于时瓦解冰泮，风飞雹散，浑然千里，淄渑一乱。雪暗如沙，冰横似岸。逢赴洛之陆机，见离家之王粲，莫不闻陇水而掩泣，向关山而长叹。况复君在交河，妾在青波。石望夫而逾远，山望子而逾多。才人之忆代郡，公主之去清河。栩阳亭有离别之赋，临江王有愁思之歌。别有飘飖武威，羁旅金微。班超生而望返，温序死而思归。李陵之双凫永去，苏武之一雁空飞。\n若江陵之中否，乃金陵之祸始。虽借人之外力，实萧墙之内起。拨乱之主忽焉，中兴之宗不祀。伯兮叔兮，同见戮于犹子。荆山鹊飞而玉碎，隋岸蛇生而珠死。鬼火乱于平林，殇魂游于新市。梁故丰徙，楚实秦亡。不有所废，其何以昌？有妫之后，将育于姜。输我神器，居为让王。天地之大德曰生，圣人之大宝曰位。用无赖之子弟，举江东而全弃。惜天下之一家，遭东南之反气。以鹑首而赐秦，天何为而此醉？\n且夫天道回旋，生民预焉。余烈祖于西晋，始流播于东川。洎余身而七叶，又遭时而北迁。提挈老幼，关河累年。死生契阔，不可问天。况复零落将尽，灵光岿然！日穷于纪，岁将复始。逼切危虑，端忧暮齿。践长乐之神皋，望宣平之贵里。渭水贯于天门，骊山回于地市。幕府大将军之爱客，丞相平津侯之待士。见钟鼎于金张，闻弦歌于许史。岂知灞陵夜猎，犹是故时将军；咸阳布衣，非独思归王子！",
    },

    {
        name:"渔父",
        author:"屈原",
        content:"屈原既放，游于江潭，行吟泽畔，颜色憔悴，形容枯槁。渔父见而问之曰：“子非三闾大夫与？何故至于斯？”屈原曰：“举世皆浊我独清，众人皆醉我独醒，是以见放。”\n渔父曰：“圣人不凝滞于物，而能与世推移。世人皆浊，何不淈其泥而扬其波？众人皆醉，何不餔其糟而歠其醨？何故深思高举，自令放为？”\n屈原曰：“吾闻之，新沐者必弹冠，新浴者必振衣；安能以身之察察，受物之汶汶者乎？宁赴湘流，葬身于江鱼之腹中。安能以皓皓之白，而蒙世俗之尘埃乎？”\n渔父莞尔而笑，鼓枻而去，歌曰：“沧浪之水清兮，可以濯吾缨；沧浪之水浊兮，可以濯吾足。”遂去，不复与言。"
    },
    {
        name:"送孟东野序",
        author:"韩愈",
        content:"大凡物不得其平则鸣：草木之无声，风挠之鸣。水之无声，风荡之鸣。其跃也，或激之；其趋也，或梗之；其沸也，或炙之。金石之无声，或击之鸣。人之于言也亦然，有不得已者而后言。其歌也有思，其哭也有怀，凡出乎口而为声者，其皆有弗平者乎！\n乐也者，郁于中而泄于外者也，择其善鸣者而假之鸣。金、石、丝、竹、匏、土、革、木八者，物之善鸣者也。维天之于时也亦然，择其善鸣者而假之鸣。是故以鸟鸣春，以雷鸣夏，以虫鸣秋，以风鸣冬。四时之相推敚，其必有不得其平者乎？\n其于人也亦然。人声之精者为言，文辞之于言，又其精也，尤择其善鸣者而假之鸣。其在唐、虞，咎陶、禹，其善鸣者也，而假以鸣，夔弗能以文辞鸣，又自假于《韶》以鸣。夏之时，五子以其歌鸣。伊尹鸣殷，周公鸣周。凡载于《诗》、《书》六艺，皆鸣之善者也。周之衰，孔子之徒鸣之，其声大而远。传曰：“天将以夫子为木铎。”其弗信矣乎！其末也，庄周以其荒唐之辞鸣。楚，大国也，其亡也以屈原鸣。臧孙辰、孟轲、荀卿，以道鸣者也。杨朱、墨翟、管夷吾、晏婴、老聃、申不害、韩非、慎到、田骈、邹衍、尸佼、孙武、张仪、苏秦之属，皆以其术鸣。秦之兴，李斯鸣之。汉之时，司马迁、相如、扬雄，最其善鸣者也。其下魏晋氏，鸣者不及于古，然亦未尝绝也。就其善者，其声清以浮，其节数以急，其辞淫以哀，其志弛以肆；其为言也，乱杂而无章。将天丑其德莫之顾邪？何为乎不鸣其善鸣者也！\n唐之有天下，陈子昂、苏源明、元结、李白、杜甫、李观，皆以其所能鸣。其存而在下者，孟郊东野始以其诗鸣。其高出魏晋，不懈而及于古，其他浸淫乎汉氏矣。从吾游者，李翱、张籍其尤也。三子者之鸣信善矣。抑不知天将和其声，而使鸣国家之盛邪，抑将穷饿其身，思愁其心肠，而使自鸣其不幸邪？三子者之命，则悬乎天矣。其在上也奚以喜，其在下也奚以悲！东野之役于江南也，有若不释然者，故吾道其于天者以解之。"
    },
    {
        name:"风赋",
        author:"宋玉",
        content:"楚襄王游于兰台之宫，宋玉景差侍。有风飒然而至，王乃披襟而当之，曰：“快哉此风！寡人所与庶人共者邪？”宋玉对曰：“此独大王之风耳，庶人安得而共之！”王曰：“夫风者，天地之气，溥畅而至，不择贵贱高下而加焉。今子独以为寡人之风，岂有说乎？”宋玉对曰：“臣闻于师：枳句来巢，空穴来风。其所托者然，则风气殊焉。”\n王曰：“夫风始安生哉？”宋玉对曰：“夫风生于地，起于青萍之末。侵淫溪谷，盛怒于土囊之口。缘太山之阿，舞于松柏之下，飘忽淜滂，激飏熛怒。耾耾雷声，回穴错迕。蹶石伐木，梢杀林莽。至其将衰也，被丽披离，冲孔动楗，眴焕粲烂，离散转移。故其清凉雄风，则飘举升降。乘凌高城，入于深宫。抵华叶而振气，徘徊于桂椒之间，翱翔于激水之上。将击芙蓉之精。猎蕙草，离秦衡，概新夷，被荑杨，回穴冲陵，萧条众芳。然后徜徉中庭，北上玉堂，跻于罗帏，经于洞房，乃得为大王之风也。故其风中人状，直惨凄惏栗，清凉增欷。清清泠泠，愈病析酲，发明耳目，宁体便人。此所谓大王之雄风也。”\n王曰：“善哉论事！夫庶人之风，岂可闻乎？”宋玉对曰：“夫庶人之风，塕然起于穷巷之间，堀堁扬尘，勃郁烦冤，冲孔袭门。动沙堁，吹死灰，骇溷浊，扬腐余，邪薄入瓮牖，至于室庐。故其风中人状，直憞溷郁邑，殴温致湿，中心惨怛，生病造热。中唇为胗，得目为篾，啖齰嗽获，死生不卒。此所谓庶人之雌风也。”"
    },
    {
        name:"雪赋",
        author:"谢惠连",
        content:"岁将暮，时既昏。寒风积，愁云繁。梁王不悦，游于兔园。乃置旨酒，命宾友。召邹生，延枚叟。相如末至，居客之右。俄而微霰零，密雪下。王乃歌北风于卫诗，咏南山于周雅。授简于司马大夫，曰：“抽子秘思，骋子妍辞，侔色揣称，为寡人赋之。”\n相如于是避席而起，逡巡而揖。曰：臣闻雪宫建于东国，雪山峙于西域。岐昌发咏于来思，姬满申歌于《黄竹》。《曹风》以麻衣比色，楚谣以幽兰俪曲。盈尺则呈瑞于丰年，袤丈则表沴于阴德。雪之时义远矣哉！请言其始。\n若乃玄律穷，严气升。焦溪涸，汤谷凝。火井灭，温泉冰。沸潭无涌，炎风不兴。北户墐扉，裸壤垂缯。于是河海生云，朔漠飞沙。连氛累霭，揜日韬霞。霰淅沥而先集，雪纷糅而遂多。\n其为状也，散漫交错，氛氲萧索。蔼蔼浮浮，瀌瀌弈弈。联翩飞洒，徘徊委积。始缘甍而冒栋，终开帘而入隙。初便娟于墀庑，末萦盈于帷席。既因方而为圭，亦遇圆而成璧。眄隰则万顷同缟，瞻山则千岩俱白。于是台如重璧，逵似连璐。庭列瑶阶，林挺琼树，皓鹤夺鲜，白鹇失素，纨袖惭冶，玉颜掩姱。\n若乃积素未亏，白日朝鲜，烂兮若烛龙，衔耀照昆山。尔其流滴垂冰，缘溜承隅，粲兮若冯夷，剖蚌列明珠。至夫缤纷繁骛之貌，皓皔曒洁之仪。回散萦积之势，飞聚凝曜之奇，固展转而无穷，嗟难得而备知。\n若乃申娱玩之无已，夜幽静而多怀。风触楹而转响，月承幌而通晖。酌湘吴之醇酎，御狐貉之兼衣。对庭鹍之双舞，瞻云雁之孤飞。践霜雪之交积，怜枝叶之相违。驰遥思于千里，愿接手而同归。\n邹阳闻之，懑然心服。有怀妍唱，敬接末曲。于是乃作而赋积雪之歌，歌曰：携佳人兮披重幄，援绮衾兮坐芳褥。燎熏炉兮炳明烛，酌桂酒兮扬清曲。又续写而为白雪之歌，歌曰：曲既扬兮酒既陈，朱颜酡兮思自亲。愿低帷以昵枕，念解佩而褫绅。怨年岁之易暮，伤后会之无因。君宁见阶上之白雪，岂鲜耀于阳春。歌卒。王乃寻绎吟玩，抚览扼腕。顾谓枚叔，起而为乱，乱曰：\n白羽虽白，质以轻兮，白玉虽白，空守贞兮。未若兹雪，因时兴灭。玄阴凝不昧其洁，太阳耀不固其节。节岂我名，洁岂我贞。凭云升降，从风飘零。值物赋象，任地班形。素因遇立，污随染成。纵心皓然，何虑何营？"
    },
    {
        name:"舞鹤赋",
        author:"鲍照",
        content:"散幽经以验物，伟胎化之仙禽。钟浮旷之藻质，抱清迥之明心。指蓬壶而翻翰，望昆阆而扬音。匝日域以回骛，穷天步而高寻。践神区其既远，积灵祀而方多。精含丹而星曜，顶凝紫而烟华。引员吭之纤婉，顿修趾之洪姱。叠霜毛而弄影，振玉羽而临霞。朝戏于芝田，夕饮乎瑶池。厌江海而游泽，掩云罗而见羁。去帝乡之岑寂，归人寰之喧卑。岁峥嵘而愁暮，心惆怅而哀离。\n于是穷阴杀节，急景凋年。骫沙振野，箕风动天。严严苦雾，皎皎悲泉。冰塞长河，雪满群山。既而氛昏夜歇，景物澄廓。星翻汉回，晓月将落。感寒鸡之早晨，怜霜雁之违漠。临惊风之萧条，对流光之照灼。唳清响于丹墀，舞飞容于金阁。始连轩以凤跄，终宛转而龙跃。踯躅徘徊，振迅腾摧。惊身蓬集，矫翅雪飞。离纲别赴，合绪相依。将兴中止，若往而归。飒沓矜顾，迁延迟暮。逸翮后尘，翱翥先路。指会规翔，临岐矩步。态有遗妍，貌无停趣。奔机逗节，角睐分形。长扬缓骛，并翼连声。轻迹凌乱，浮影交横。众变繁姿，参差洊密。烟交雾凝，若无毛质。风去雨还，不可谈悉。既散魂而荡目，迷不知其所之。忽星离而云罢，整神容而自持。仰天居之崇绝，更惆怅以惊思。\n当是时也，燕姬色沮，巴童心耻。巾拂两停，丸剑双止。虽邯郸其敢伦，岂阳阿之能拟。入卫国而乘轩，出吴都而倾市。守驯养于千龄，结长悲于万里。"
    },
    {
        name:"别赋",
        author:"江淹",
        content:"　黯然销魂者，唯别而已矣！况秦吴兮绝国，复燕宋兮千里。或春苔兮始生，乍秋风兮暂起。是以行子肠断，百感凄恻。风萧萧而异响，云漫漫而奇色。舟凝滞于水滨，车逶迟于山侧。棹容与而讵前，马寒鸣而不息。掩金觞而谁御，横玉柱而沾轼。居人愁卧，怳若有亡。日下壁而沉彩，月上轩而飞光。见红兰之受露，望青楸之离霜。巡层楹而空掩，抚锦幕而虚凉。知离梦之踯躅，意别魂之飞扬。\n故别虽一绪，事乃万族。至若龙马银鞍，朱轩绣轴，帐饮东都，送客金谷。琴羽张兮箫鼓陈，燕、赵歌兮伤美人，珠与玉兮艳暮秋，罗与绮兮娇上春。惊驷马之仰秣，耸渊鱼之赤鳞。造分手而衔涕，感寂寞而伤神。\n乃有剑客惭恩，少年报士，韩国赵厕，吴宫燕市。割慈忍爱，离邦去里，沥泣共诀，抆血相视。驱征马而不顾，见行尘之时起。方衔感于一剑，非买价于泉里。金石震而色变，骨肉悲而心死。\n或乃边郡未和，负羽从军。辽水无极，雁山参云。闺中风暖，陌上草薰。日出天而曜景，露下地而腾文。镜朱尘之照烂，袭青气之烟煴，攀桃李兮不忍别，送爱子兮沾罗裙。\n至如一赴绝国，讵相见期？视乔木兮故里，决北梁兮永辞，左右兮魄动，亲朋兮泪滋。可班荆兮憎恨，惟樽酒兮叙悲。值秋雁兮飞日，当白露兮下时，怨复怨兮远山曲，去复去兮长河湄。\n又若君居淄右，妾家河阳，同琼珮之晨照，共金炉之夕香。君结绶兮千里，惜瑶草之徒芳。惭幽闺之琴瑟，晦高台之流黄。春宫閟此青苔色，秋帐含此明月光，夏簟清兮昼不暮，冬釭凝兮夜何长！织锦曲兮泣已尽，回文诗兮影独伤。\n傥有华阴上士，服食还仙。术既妙而犹学，道已寂而未传。守丹灶而不顾，炼金鼎而方坚。驾鹤上汉，骖鸾腾天。暂游万里，少别千年。惟世间兮重别，谢主人兮依然。\n下有芍药之诗，佳人之歌，桑中卫女，上宫陈娥。春草碧色，春水渌波，送君南浦，伤如之何！至乃秋露如珠，秋月如圭，明月白露，光阴往来，与子之别，思心徘徊。\n是以别方不定，别理千名，有别必怨，有怨必盈。使人意夺神骇，心折骨惊，虽渊、云之墨妙，严、乐之笔精，金闺之诸彦，兰台之群英，赋有凌云之称，辨有雕龙之声，谁能摹暂离之状，写永诀之情者乎？"
    },
    {
        name:"海赋",
        author:"木玄虚",
        content:"昔在帝妫，臣唐之代，天纲浡潏，为凋为瘵；洪涛澜汗，万里无际；长波涾??，迆涎八裔。于是乎禹也，乃铲临崖之阜陆，决陂潢而相沷。启龙门之岝??，垦陵峦而崭凿。群山既略，百川潜渫。泱漭澹泞，腾波赴势。江河既导，万穴俱流，掎拔五岳，竭涸九州。沥滴渗淫，荟蔚云雾，涓流泱瀼，莫不来注。\n于廓灵海，长为委输。其为广也，其为怪也，宜其为大也。尔其为状也，则乃浟湙潋滟，浮天无岸；浺瀜沆瀁，渺?湠漫；波如连山，乍合乍散。嘘噏百川，洗涤淮汉；襄陵广舄，㶀㵧浩汗。\n若乃大明㩠辔于金枢之穴，翔阳逸骇于扶桑之津。彯沙礐石，荡𩘻岛滨。于是鼓怒，溢浪扬浮，更相触搏，飞沫起涛。状如天轮，胶戾而激转；又似地轴，挺拔而争回。岑岺飞腾而反复，五岳鼓舞而相磓。𣽴濆沦而滀漯，郁沏迭而隆颓。盘盓激而成窟，𣺰𣶞滐而为魁。㴸泊柏而迆飏，磊匒匌而相豗。惊浪雷奔，骇水迸集；开合解会，瀼瀼湿湿；葩华踧沑，㴿泞潗㵫。\n若乃霾曀潜销，莫振莫竦；轻尘不飞，纤萝不动；犹尚呀呷，馀波独涌；澎濞灪䃶，碨磊山垄。尔其枝岐潭瀹，渤荡成汜。乖蛮隔夷，回互万里。\n若乃偏荒速告，王命急宣，飞骏鼓楫，泛海凌山。于是候劲风，揭百尺，维长绡，挂帆席；望涛远决，冏然鸟逝，鹬如惊凫之失侣，倏如六龙之所掣；一越三千，不终朝而济所届。\n若其负秽临深，虚誓愆祈，则有海童邀路，马衔当蹊。天吴乍见而仿佛，蝄像暂晓而闪尸。群妖遘迕，眇䁘冶夷。决帆摧橦，戕风起恶。廓如灵变，惚怳幽暮。气似天霄，叆靅云步。䨹昱绝电，百色妖露。呵㗵掩郁，矆睒无度。飞涝相磢，激势相沏。崩云屑雨，浤浤汩汩。𧿒踔湛𤄶，沸溃渝溢。瀖泋濩渭，荡云沃日。\n于是舟人渔子，徂南极东，或屑没于鼋鼍之穴，或挂罥于岑㟼之峰。或掣掣洩洩于裸人之国，或泛泛悠悠于黑齿之邦。或乃萍流而浮转，或因归风以自反。徒识观怪之多骇，乃不悟所历之近远。\n尔其为大量也，则南澰朱崖，北洒天墟，东演析木，西薄青徐。经途瀴溟，万万有余。吐云霓，含鱼龙，隐鲲鳞，潜灵居。岂徒积太颠之宝贝，与随侯之明珠。将世之所收者常闻，所未名者若无。且希世之所闻，恶审其名？故可仿像其色，叆霼其形。\n尔其水府之内，极深之庭，则有崇岛巨鳌，峌𡸣孤亭。擘洪波，指太清。竭磐石，栖百灵。飏凯风而南逝，广莫至而北征。其垠则有天琛水怪，鲛人之室。瑕石诡晖，鳞甲异质。\n若乃云锦散文于沙汭之际，绫罗被光于螺蚌之节。繁采扬华，万色隐鲜。阳冰不冶，阴火潜然。熺炭重燔，吹烱九泉。朱𤒦绿烟，䁏眇蝉蜎。珊瑚琥珀，群产接连。车渠马瑙，全积如山。鱼则横海之鲸，突扤孤游；戛岩㟼，偃高涛，茹鳞甲，吞龙舟，噏波则洪涟踧蹜，吹涝则百川倒流。或乃蹭蹬穷波，陆死盐田，巨鳞插云，鬐鬣刺天，颅骨成岳，流膏为渊。若乃岩坻之隈，沙石之嵚；毛翼产鷇，剖卵成禽；凫雏离褷，鹤子淋渗。群飞侣浴，戏广浮深；翔雾连轩，洩洩淫淫；翻动成雷，扰翰为林；更相叫啸，诡色殊音。\n若乃三光既清，天地融朗。不泛阳侯，乘蹻绝往；觌安期于蓬莱，见乔山之帝像。群仙缥眇，餐玉清涯。履阜乡之留舄，被羽翮之襂纚。翔天沼，戏穷溟；甄有形于无欲，永悠悠以长生。且其为器也，包乾之奥，括坤之区。惟神是宅，亦只是庐。何奇不有，何怪不储？芒芒积流，含形内虚。旷哉坎德，卑以自居；弘往纳来，以宗以都；品物类生，何有何无。"
    },
    {
        name:"琴赋",
        author:"嵇康",
        content:"余少好音声，长而玩之。以为物有盛衰，而此无变；滋味有厌，而此不倦。可以导养神气，宣和情志。处穷独而不闷者，莫近于音声也。是故复之而不足，则吟咏以肆志；吟咏之不足，则寄言以广意。然八音之器，歌舞之象，历世才士，并为之赋颂。其体制风流，莫不相袭。称其才干，则以危苦为上；赋其声音，则以悲哀为主；美其感化，则以垂涕为贵。丽则丽矣，然未尽其理也。推其所由，似原不解音声；览其旨趣，亦未达礼乐之情也。众器之中，琴德最优。故缀叙所怀，以为之赋。\n其辞曰：\n惟椅梧之所生兮，托峻岳之崇冈。披重壤以诞载兮，参辰极而高骧。含天地之醇和兮，吸日月之休光。郁纷纭以独茂兮。飞英蕤于昊苍。夕纳景于虞渊兮，旦晞干于九阳。经千载以待价兮，寂神跱而永康。且其山川形势，则盘纡隐深，磪嵬岑嵓。亘岭巉岩，岞崿岖崟。丹崖崄巇，青壁万寻。若乃重巘增起，偃蹇云覆。邈隆崇以极壮，崛巍巍而特秀。蒸灵液以播云，据神渊而吐溜。尔乃颠波奔突，狂赴争流。触岩抵隈，郁怒彪休。汹涌腾薄，奋沫扬涛。瀄汩澎湃，蜿蟺相纠。放肆大川，济乎中州。安回徐迈，寂尔长浮。澹乎洋洋，萦抱山丘。详观其区土之所产毓，奥宇之所宝殖，珍怪琅玕，瑶瑾翕赩，丛集累积，奂衍于其侧。若乃春兰被其东，沙棠殖其西。涓子宅其阳，玉醴涌其前。玄云荫其上，翔鸾集其巅。清露润其肤，惠风流其间。竦肃肃以静谧，密微微其清闲。夫所以经营其左右者，固以自然神丽，而足思愿爱乐矣。\n于是遁世之士，荣期绮季之畴，乃相与登飞梁，越幽壑，援琼枝，陟峻崿，以游乎其下。周旋永望，邈若凌飞，邪睨昆仑，俯阚海湄。指苍梧之迢递，临回江之威夷。悟时俗之多累，仰箕山之余辉。羡斯岳之弘敞，心慷慨以忘归。情舒放而远览，接轩辕之遗音。慕老童于騩隅，钦泰容之高吟。顾兹梧而兴虑，思假物以托心。乃斫孙枝，准量所任。至人摅思，制为雅琴。乃使离子督墨，匠石奋斤，夔襄荐法，般倕骋神。锼会裛厕，朗密调均。华绘雕琢，布藻垂文。错以犀象，籍以翠绿。弦以园客之丝，徽以钟山之玉。爰有龙凤之象，古人之形。伯牙挥手，钟期听声。华容灼爚，发采扬明，何其丽也！伶伦比律，田连操张。进御君子，新声憀亮，何其伟也！\n及其初调，则角羽俱起，宫徵相证，参发并趣，上下累应。踸踔磥硌，美声将兴，固以和昶而足耽矣。尔乃理正声，奏妙曲，扬白雪，发清角。纷淋浪以流离，奂淫衍而优渥。粲奕奕而高逝，驰岌岌以相属。沛腾遌而竞趣，翕韡晔而繁缛。状若崇山，又象流波。浩兮汤汤，郁兮峨峨。怫烦冤，纡余婆娑。陵纵播逸，霍濩纷葩。检容授节，应变合度。兢名擅业，安轨徐步。洋洋习习，声烈遐布。含显媚以送终，飘余响乎泰素。\n若乃高轩飞观，广夏闲房，冬夜肃清，朗月垂光，新衣翠粲，缨徽流芳。于是器冷弦调，心闲手敏。触Ⱨ如志，唯意所拟。初涉渌水，中奏清徵。雅昶唐尧，终咏微子。宽明弘润，优游躇跱。拊弦安歌，新声代起。歌曰：“凌扶摇兮憩瀛洲，要列子兮为好仇。餐沆瀣兮带朝霞，眇翩翩兮薄天游。齐万物兮超自得，委性命兮任去留。激清响以赴会，何弦歌之绸缪。”于是曲引向阑，众音将歇，改韵易调，奇弄乃发。扬和颜，攘皓腕。飞纤指以驰骛，纷㒊譶以流漫。或徘徊顾慕，拥郁抑按，盘桓毓养，从容秘玩。闼尔奋逸，风骇云乱。牢落凌厉，布濩半散。丰融披离，斐韡奂烂。英声发越，采采粲粲。或间声错糅，状若诡赴。双美并进，骈驰翼驱。初若将乖，后卒同趣。或曲而不屈，直而不倨。或相凌而不乱，或相离而不殊。时劫掎以慷慨，或怨㜘而踌躇。忽飘飖以轻迈，乍留联而扶疏。或参谭繁促，复叠攒仄。纵横骆驿，奔遁相逼。拊嗟累赞，间不容息。瑰艳奇伟，殚不可识。若乃闲舒都雅，洪纤有宜。清和条昶，案衍陆离。穆温柔以怡怿，婉顺叙而委蛇。或乘险投会，邀隙趋危。譻若离鹍鸣清池，翼若游鸿翔层崖。纷文斐尾，慊縿离纚。微风余音，靡靡猗猗。或搂批攦捋，缥缭潎冽。轻行浮弹，明婳𥉻慧。疾而不速，留而不滞。翩绵飘邈，微音迅逝。远而听之，若鸾凤和鸣戏云中；迫而察之，若众葩敷荣曜春风。既丰赡以多姿，又善始而令终。嗟姣妙以弘丽，何变态之无穷！\n若夫三春之初，丽服以时。乃携友生，以遨以嬉。涉兰圃，登重基，背长林，翳华芝，临清流，赋新诗。嘉鱼龙之逸豫，乐百卉之荣滋。理重华之遗操，慨远慕而长思。\n若乃华堂曲宴，密友近宾，兰肴兼御，旨酒清醇。进南荆，发西秦，绍陵阳，度巴人。变用杂而并起，竦众听而骇神。料殊功而比操，岂笙籥之能伦？\n若次其曲引所宜，则广陵止息，东武太山。飞龙鹿鸣，鹍鸡游弦。更唱迭奏，声若自然。流楚窈窕，惩躁雪烦。下逮谣俗，蔡氏五曲，王昭楚妃，千里别鹤。犹有一切，承间簉乏，亦有可观者焉。\n然非夫旷远者，不能与之嬉游；非夫渊静者，不能与之闲止；非夫放达者，不能与之无（希去布加厷）；非夫至精者，不能与之析理也。若论其体势，详其风声，器和故响逸，张急故声清，间辽故音庳，弦长故徽鸣。性洁静以端理，含至德之和平。诚可以感荡心志，而发泄幽情矣！是故怀戚者闻之，莫不憯懔惨凄，愀怆伤心，含哀懊咿，不能自禁。其康乐者闻之，则欨愉欢释，抃舞踊溢，留连澜漫，嗢噱终日。若和平者听之，则怡养悦愉，淑穆玄真，恬虚乐古，弃事遗身。是以伯夷以之廉，颜回以之仁，比干以之忠，尾生以之信，惠施以之辩给，万石以之讷慎。其余触类而长，所致非一，同归殊途。或文或质，总中和以统物，咸日用而不失。其感人动物，盖亦弘矣。\n于时也，金石寝声，匏竹屏气，王豹辍讴，狄牙丧味。天吴踊跃于重渊，王乔披云而下坠。舞鸑鷟于庭阶，游女飘焉而来萃。感天地以致和，况蚑行之众类。嘉斯器之懿茂，咏兹文以自慰。永服御而不厌，信古今之所贵。\n乱曰：愔愔琴德，不可测兮；体清心远，邈难极兮；良质美手，遇今世兮；纷纶翕响，冠众艺兮；识音者希，孰能珍兮；能尽雅琴，唯至人兮！"
    },
    {
        name:"与宋思元书",
        author:"吴均",
        content:"风烟俱净，天山共色。从流飘荡，任意东西。自富阳至桐庐一百许里，奇山异水，天下独绝。\n水皆缥碧，千丈见底。游鱼细石，直视无碍。急湍甚箭，猛浪若奔。\n夹岸高山，皆生寒树，负势竞上，互相轩邈，争高直指，千百成峰。泉水激石，泠泠作响；好鸟相鸣，嘤嘤成韵。蝉则千转不穷，猿则百叫无绝。鸢飞戾天者，望峰息心；经纶世务者，窥谷忘反。横柯上蔽，在昼犹昏；疏条交映，有时见日。"
    },
    {
        name:"典论 论文",
        author:"曹丕",
        content:"文人相轻，自古而然。傅毅之于班固，伯仲之间耳，而固小之，与弟超书曰：“武仲以能属文为兰台令史，下笔不能自休。”夫人善于自见，而文非一体，鲜能备善，是以各以所长，相轻所短。里语曰：“家有弊帚，享之千金。”斯不自见之患也。\n今之文人：鲁国孔融文举、广陵陈琳孔璋、山阳王粲仲宣、北海徐干伟长、陈留阮瑀元瑜、汝南应瑒德琏、东平刘桢公干，斯七子者，于学无所遗，于辞无所假，咸以自骋骥騄于千里，仰齐足而并驰。以此相服，亦良难矣！盖君子审己以度人，故能免于斯累，而作论文。\n王粲长于辞赋，徐干时有齐气，然粲之匹也。如粲之《初征》《登楼》《槐赋》《征思》，干之《玄猿》《漏卮》《圆扇》《橘赋》，虽张、蔡不过也，然于他文，未能称是。琳、瑀之章表书记，今之隽也。应瑒和而不壮，刘桢壮而不密。孔融体气高妙，有过人者，然不能持论，理不胜辞，以至乎杂以嘲戏。及其所善，扬、班俦也。\n常人贵远贱近，向声背实，又患闇于自见，谓己为贤。夫文本同而末异，盖奏议宜雅，书论宜理，铭诔尚实，诗赋欲丽。此四科不同，故能之者偏也；唯通才能备其体。\n文以气为主，气之清浊有体，不可力强而致。譬诸音乐，曲度虽均，节奏同检，至于引气不齐，巧拙有素，虽在父兄，不能以移子弟。\n盖文章，经国之大业，不朽之盛事。年寿有时而尽，荣乐止乎其身，二者必至之常期，未若文章之无穷。是以古之作者，寄身于翰墨，见意于篇籍，不假良史之辞，不托飞驰之势，而声名自传于后。故西伯幽而演易，周旦显而制礼，不以隐约而弗务，不以康乐而加思。夫然则，古人贱尺璧而重寸阴，惧乎时之过已。而人多不强力；贫贱则慑于饥寒，富贵则流于逸乐，遂营目前之务，而遗千载之功。日月逝于上，体貌衰于下，忽然与万物迁化，斯志士之大痛也！\n融等已逝，唯干著论，成一家言。"
    },
    {
        name:"遗诏",
        author:"刘恒",
        content:"朕闻盖天下万物之萌生，靡不有死。死者天地之理，物之自然者，奚可甚哀？当今之时，世咸嘉生而恶死，厚葬以破业，重服以伤生，吾甚不取。且朕既不德，无以佐百姓；今崩，又使重服久临，以离寒暑之数，哀人之父子，伤长幼之志，损其饮食，绝鬼神之祭祀，以重吾不德也，谓天下何！\n朕获保宗庙，以眇眇之身托于天下君王之上，二十有馀年矣。赖天地之灵，社稷之福，方内安宁，靡有兵革。朕既不敏，常畏过行，以羞先帝之遗德；维年之久长，惧于不终。今乃幸以天年，得复供养于高庙，朕之不明与嘉之，其奚哀悲之有！\n其令天下吏民，令到出临三日，皆释服。毋禁娶妇、嫁女、祠祀、饮酒食肉者。自当给丧事服临者，皆无践。绖带无过三寸，毋布车及兵器，毋发民男女哭临宫殿中。宫殿中当临者，皆以旦夕各十五举声，礼毕罢。非旦夕临时，禁毋得擅哭。已下，服大红十五日，小红十四日，纤七日，释服。它不在令中者，皆以此令比类从事。布告天下，使明知朕意。霸陵山川因其故，毋有所改。归夫人以下至少使。"
    },
    {
        name:"绿竹堂独饮",
        author:"欧阳修",
        content:"夏篁解箨阴加樛，卧斋公退无喧嚣。\n清和况复值佳月，翠树好鸟鸣咬咬。\n芳尊有酒美可酌，胡为欲饮先长谣。\n人生暂别客秦楚，尚欲泣泪相攀邀。\n况兹一诀乃永已，独使幽梦恨蓬蒿。\n忆予驱马别家去，去时柳陌东风高。\n楚乡留滞一千里，归来落尽李与桃。\n残花不共一日看，东风送哭声嗷嗷。\n洛池不见青春色，白杨但有风萧萧。\n姚黄魏紫开次第，不觉成恨俱零凋。\n榴花最晚今又拆，红绿点缀如裙腰。\n年芳转新物转好，逝者日与生期遥。\n予生本是少年气，瑳磨牙角争雄豪。\n马迁班固自歆向，下笔点窜皆嘲嘈。\n客来共坐说今古，纷纷落尽玉麈毛。\n弯弓或拟射石虎，又欲醉斩荆江蛟。\n自言刚气贮心腹，何尔柔软为脂膏。\n吾闻庄生善齐物，平日吐论奇牙聱。\n忧从中来不自遣，强叩瓦缶何譊譊。\n伊人达者向乃尔，情之所锺况吾曹。\n愁填胸中若山积，虽欲强饮如沃焦。\n乃判自古英壮气，不有此恨如何消。\n又闻浮屠说生死，灭没谓若梦幻泡。\n前有万古後万世，其中一世独虭蟧。\n安得独洒一榻泪，欲助河水增滔滔。\n古来此事无可奈，不如饮此尊中醪。"
    },



]