[
    "地球核心密度 13 g/cm3，中子星则 1e13 ~ 1e16  白矮星1e6",
    "hc = 1241 MeV·fm  500nm的光子 大概2.5eV能量",
    "逆beta衰变（IBD）的阈值是1.806 MeV  截面在 1e-42 cm2 量级  很小",
    "Linux的路径分隔符是右倾的 /",
    "视星等，一等星相当于一根蜡烛在一公里之外，六等星亮度低一百倍，其他等星在其间等距分布",
    "SK-Ⅴ 2020夏天开始取数据了，使用Gd俘获中子   预计2027 HK开始取数据",
    "水中切伦科夫辐射角度为42°",
    "微软图标颜色分别是 ，红绿蓝黄",
    "造父变星是体积周期脉动造成周期多普勒红移的星体，也是标准烛光   周光关系",
    "一个秒差距pc，1pc=3.26 light-year  银河系直径30kpc  宇宙尺度在Gpc级别",
    "原子核尺度在10fm量级  1.4A^1/3",
    "波兰耶稣雕像头顶布满通信基站2333",
    "紫荆七号楼 经过 十号楼  去 六教 的路程是 1.4km",
    "中微子震荡参数测量  反应堆短基线测theta13   太阳中微子测12   大气中微子加速器中微子测23",
    "Dirac方程 的slash partial  是 gamma partial的缩写 ",
    "PMT对eV级别的光子敏感，因为它需要光电子",
    "两个质子的库伦势垒高达 1MeV 单纯热运动需要 2e10 K 达到这个平均动能  但由于 麦克斯韦-玻尔兹曼分布  跟 隧穿效应  恒星氢 聚变  8e6 K 就可以开始了",
    "1916年，Schwarzschild 在战壕里解出黑洞解,再过一年后在战争中死掉，静态 球对称 真空 非旋转的解。同年，Reinner找到了 带电荷 球对称 静态 的黑洞解。 直到1963年Kerr 才解出了新的 轴对称 旋转的黑洞解 Kerr黑洞",
    "电磁波来自电荷的加速。引力波来自于大质量-能量的非球对称加速，与电池磁作用不同，质量分布的偶极矩不起作用，四极矩起作用，它的亮度正比于 四极矩对时间的三阶导数的平方。",
    "按照经典力学的理论，双星系统是稳定的。但由于引力波的辐射，双星系统是不稳定的。 1974年之后对 PSR 1913+16 的观测 证实了这一点，它的轨道周期性的变小。 经典力学下  时空是无限硬的，而广义相对论下只是极端硬的。",
    "2020/11/21 T大初雪",
    "Windows1.0 诞生于11/20/1985",
    "kT=0.0253 eV",
    "二项分布，在次数很多，概率很小的时候可以看作泊松分布。泊松分布在平均值比较大（>20）的时候又可以看成是高斯分布。泊松分布的方差与期望相等。",
    "指数分布多描述器件的老化损坏，信号到达的时间间隔。",
    "GWTC (gravitational wave transient catalog) 引力波暂时目录 , 1期与2期记录了67次GW。大多数引力波事件源为双黑洞并和。其中GW170817为双中子星并和，其信号比较弱，但同时段其他探测器(Fermi 卫星) 测到了Gamma暴。",
    "引力波的频率与源的质量成反比，LIGO的观测波段在声学波段（40~7000 Hz）。它的精度达到fm的1/1000. LIGO有三台干涉仪，H1(4km) H2(2km)  L1(4km) , 分别在华盛顿与路易斯安娜。",
    "超新星命名规则: SN + 年份 + abcd... aa ab...  ",
    "大气层对光的窗口：可见光与射电波段",
    "每秒钟有万亿级别的太阳中微子闯过你的头，但几乎与你不发生任何反应。",
    "中微子是目前唯一 不带电荷的 不带色荷的 费米子。而它的质量非常之小 ~0.1eV 甚至更小 ，同为基本粒子的顶夸克却重达173.1 GeV  这中间差了 12 个量级。 如此奇怪。",
    "Kilo（1e3）、Mega（1e6）、Giga（1e9）、Tera（1e12)  Peta（1e15）、Exa（1e18）、Bronto（1e21）",
    "中微子的测量：(1)混合角与CP相角，质量差  (2)绝对质量与质量序   (3)中微子是不是Majorana的？  对应中微子振荡     无中微子双beta衰变",
    "整个宇宙，中微子的数量与光子相当，~300/cm2 , 因此它的质量对于 宇宙大尺度结构 至关重要。",
    "Science最新实验测量，质子的直径是0.843fm。",
    "SN1987A,神冈记录到了11次中微子事件，世界上其他两个探测器分别测量到了5个与3个。",
    "截止到2020年11月30日，ICECUBE测到最高中微子能量为10PeV。",
    "动能在其质量1e-9的粒子，速度在1e4 m/s",
    "ICECUBE两根电缆之间的距离为",
    "Cs137 Gamma源的光子为0.662MeV",
    "声子是",
    "1992年的诺贝尔物理学奖发给了G. Charpar ,多丝正比室",
    "质子衰变，变成pion0与正电子，但它半衰期很长很长，其与BSM相关、与其量子数破缺",
    "LPM effect 高能粒子的韧致辐射与电子对效应截面下降",
    "ASKARYAN effect 高能中性粒子在电介质当中打出shower，使得电子富集，这个个过程当中电荷积累相当于偶极子，发出射电波段的辐射。",
    "GZK cut off，极高能量中微子与CMB作用",
    "KAON是0自旋的玻色子，+ - 0 均有，它喜欢衰变成为pion。",
    "muon是1/2自旋的费米子，带有一个电子电荷，质量为105.66 MeV，生命为2.2 muSecond（弱作用当中比较长），muon衰变时产生与它相同电荷电子与两个中微子。",
    "pion是自旋0的玻色子，带电荷的pion喜欢变成muon（99%",
    "maxwell demon",
    "laplace demon",
    "LHC的现在有8个实验",
    "ATLAS,LHC上的一个实验，通用粒子探测器",
    "CMS，LHC上的一个实验，通用粒子探测器",
    "ALICE，重离子对撞",
    "LHCb，底夸克性质测量",
    "爱丁顿耀斑，双黑洞系统当中，一个穿过另一个的吸积盘。",
    "For example, a 10 PeV (100 TeV) muon will travel on average 21 km (13 km) before its energy drops to 10% of its initial energy",
    "直线加速器",
    "环形加速器",
    "低温环境当中，比如南极，热水比冷水更快结冰",
    "适应性光学",
    "特殊函数 库 http://dlmf.nist.gov",
    "geon     ",
    "虫洞",
    "Windows 1.0 does not allow overlapping windows until Windows 2.0",
    "氦闪",
    "超新星遗迹  强磁场 同步辐射  幂律谱",
    "兰姆移位  1947 谢尔特岛",
    "天顶角？",
    "penrose过程",
    "黑洞的 三角形规律",
    "奇异数  产生于强作用的重子以弱作用衰变  例如kaon Sigma Lambda",
    "宇称不守恒",
    "静态中子星质量上限为2.2Msun，旋转则为2.7Msun",
    "URCA过程",
    "银道坐标系",
    "脉冲星PSR周期多在$0.2 ~ 2 s$,最长不过十几秒",
    "曲率  挠率",
    "广义相对论采用的是无挠率的黎曼空间",
    "宋代始于公元960,结束语南宋1270",
    "果蝇在任何时候回避蓝紫色光，因为能量太高",
    "Ⅰa超新星爆发产生了宇宙的大部分铁元素",
    "交流约瑟夫效应",
    "时间晶体 ",
    "木星大气存在闪耀的极光",
    "目前的GPS系统由31颗卫星组成，高度20000km。定位至少需要同时接受四颗卫星的信号。",
    "ITER预计在2025年产生第一团等离子体。聚变正式并电网预计在2060年。可信度未知，2021年2月5日。",
    "仿星器",
    "托卡马克",
    "大脑只有三榜重，也就是大约1.5$kg$",
    "热量传递通常有三种方式，热传导、热对流、热辐射。        ",
    "银河系大约有3e11颗恒星star。",
    "望远镜的分辨率取决于观测物质波长与望远镜口径之比，越小越好。",
    "欧洲南方天文台ESO建在智利的极大望远镜European-Extremely large telescope(E-ELT)直径达到40m，面积相当三个篮球场，预计2025年运行。",
    "自适应光学，",
    "索尔金参数",
    "量子比特，量子众态",
    "火星大氣層相對較薄，平均地表氣壓只有6百帕，约为地球表面氣壓的0.6%，相當於地球表面算起35公里高的氣壓，如此低的氣壓使聲音傳播的距離只有在地球上的1.5%。韓佔火星大氣成分为95%的二氧化碳，3%的氮气，1.6%氬气，很少的氧气、水氣等，亦充滿著很多懸浮塵埃，吸收藍光使天空成黃褐色。",
    "失控的温室效应使金星变成了“地狱星球”。",
    "理论上，宇宙早期最先捕获电子的是氦核。",
    "爱因斯坦曾经设计了一种机翼，cat‘s-back wings，但不成功。 ",
    "飞行器升力的现代通俗解释：翼型airfoil 造成上翼真空低压区$\\rightarrow$气体向下加速填满低压区",
    "KM3NET预计2024法国完工，2026意大利部分完工。",
    "哈勃常数$H_0$为74.03（2019），它的单位是 千米每秒每秒差距。",
    "造父变星 周光关系",
    "比邻星是距离太阳最近的一颗恒星，为4.2光年。",
    "一个成年人平均每天摄入2000卡路里，相对于让一只100瓦亮一整天的能量。",
    "显生宙，是5.41亿年前大量生物出现的时期。而細分後可劃分為古生代、中生代、新生代。古生代包括寒武纪、奥陶纪、志留纪、泥盆纪、石炭纪、二叠纪。",
    "Frank-Tamm formula $  $.",
    "Adobe在1993年发明了PDF，它可以在不同系统中查看相同的内容。",
    "快速动眼现象",
    "tesseract OCR python lib",
    "$1 \\ cal = 4.184 J  $",
    "黑火药",
    "invese free electron laser",
    "东京晴空塔高634m",
    "CCM实验",
    "隅田川、荒川",
    "卡方统计量",
    "姆潘巴效应，热水比冷水降温快",
    "咖啡摄入量与肝癌死亡率负相关",
    "超新星披萨片",
    "芭芭散射、穆勒散射",
    "纯U235球体失控的半径为8.7cm，质量为5.2kg。自然U235丰度为0.72%。",
    "假設完全裂變，一公斤的鈾-235理論上可以產生80萬億焦耳的能量（8×1013焦耳），相等於3000噸煤。",
    "液氦在温度降至2.178 K（−271 ℃）时，性质会发生突变，粘度极小，能形成只有几个原子厚度的薄膜，发生无粘度流动，成为一种超流体，稱為氦(II)，正常的液氦稱作氦(I)。这种氦(II)的表面张力很小，能沿容器壁向上流动，直到兩邊液面等高。此時的氦热传导性为铜的800倍，成為導熱性能極佳的熱導體。",
    "网景公司与昇阳电脑公司组成的开发联盟为了让这门语言搭上Java这个编程语言“热词”，因此将其临时改名为JavaScript，日后这成为大众对这门语言有诸多误解的原因之一。",
    "经典磁铁2T，超导磁铁10T",
    "快中子是在核裂變反應中產生的自由中子，其動能20keV～10MeV (1.6×10−13 焦耳，1MeV對應的速度約為14000千米/秒，相當於光速的5％。它們被稱作快中子。",
    "如果本地時間比UTC時間快，例如中国大陸[註 1]、香港、澳门、臺灣、蒙古国、菲律宾、新加坡、马来西亚、澳大利亚西部的時間比UTC快8小時，就會寫作UTC+8，俗称东八区。",
    "俄羅斯聯邦[9]，國土横跨歐亞兩大洲，为全世界領土面積最大的國家。拥有1707万平方公里的面积，占地球陸地面积八分之一[11][12]；它也是世界上第九大人口国家，拥有1.44亿人口，77%居住于其较为发达的欧洲部分。",
    "乾隆为清朝皇帝清高宗的年号，寓意為「天道昌隆」，1736年—1796年在全中国范围内使用，共60年，是全中国范围内使用时间第二长的年号，仅次于康熙。",
    "中子慢化是能量行为。中子扩散是空间问题。",
    "强相互作用是作用于强子之间的力，是所知四种宇宙间基本作用力最强的，也是作用距离第二短的（大约在 1e-15 m 范围内[1]，比弱交互作用[1e-18]的範圍大）。",
    "Amazon 于2007年11月19日以 399 美元的价格推出了 Kindle 第一代[8]。",
    "太陽的核心是指距离太陽的中心不超过太陽半徑的五分之一或四分之一的區域[35]，核心内部的物质密度高達150 g/cm3[36][37]，大約是水密度的150倍，溫度接近1,360萬K。相較之下，太陽表面的溫度大約只有5,800K。",
    "太阳核心的核融合在负反馈下达到平衡：速率只要略微提升，就會造成核心的溫度上升，压强增大，更能抵抗外围物质的压力，因此核心会膨脹，从而降低核聚变速率，修正之前核融合速率增加所造成的扰动；而如果反應速率稍微下降，就会導致溫度略微下降，压强降低，从而核心會收縮，使核融合的速率又再提高，回復到它之前的水平[43][44]。",
    "1348年繁華的佛羅倫萨發生一場殘酷的瘟疫（黑死病），喪鐘亂鳴，死了十多萬人，在整個歐洲，因此病而死的人多達七千五百萬到兩億。隔年薄伽丘以這次瘟疫為背景，執筆寫下了《十日談》.",
    "玻璃是一種呈玻璃態的无定形体[1]，熔解的玻璃經過迅速冷卻（過冷）而成形，雖為固態，但各分子因沒有足夠時間形成晶體，仍凍結在液態的分子排布狀態。",
    "白居易（772年2月28日－846年9月8日）[2]，字樂天，晚号香山居士、醉吟先生，在詩界有廣大教化主的稱號。祖籍山西太原，生于河南新鄭，唐代文學家，文章精切，特別擅長寫詩，是中唐最具代表性的詩人之一。作品平易近人，乃至於有「老嫗能解」的說法。",
    "颐和园西堤是仿照杭州西湖的苏堤建造的，一共有六座桥，分别是，界湖桥，豳风桥，玉带桥，镜桥，练桥，柳桥。还有一座景明楼。",
    "鸟巢国家体育场长330米，宽220米，高度为69.2米，占地25万平方米。运用高达121,000噸鋼建成的体育馆，建筑费用高达人民币23亿元。2004年3月正式开工。但因庞大的建筑经费而不得不于2004年8月暂时停工。经过一连串的讨论与修改，原计划中体育场的上盖被取消，专家称这不但会使体育场更加安全，同时也可以消减部分开支。最终体育场于2005年初恢复开工，并于2008年6月28日完工。",
    "咖啡因：略帶苦味，熔點高達237℃，因此烘焙好的咖啡熟豆，其咖啡因幾乎完整保留下來，並在萃取時會融入杯中。咖啡因的作用主要是刺激中樞神經系統、心臟和呼吸系統。適量的咖啡因亦可減輕肌肉疲勞，促進消化液分泌。由於它會促進腎臟機能，有利尿作用，幫助體內將多餘的鈉離子排出體外。但攝取過多會導致咖啡因中毒。",
    "/: slash或forward slash  英 [slæʃ] ",
    "TRIGGER（日语：）是一間企劃、製作日本動畫的公司，社名緣由是寓意創作猶如子彈射出時被「觸發」的一瞬間，亦被稱為「扳機社」。2013年10月，推出第一部長篇電視動畫作品《Kill La Kill》。今石洋之",
    "因发明“深度优先搜索算法”，約翰·霍普克洛夫特与罗伯特·塔扬在1986年共同获得计算机领域的最高奖：图灵奖。",
    "AN602，别称“沙皇炸彈”，是冷战期间蘇聯所製造的氫彈，總共製造兩枚，其中一枚於1961年10月30日在新地島試爆，另一枚作為研究與備用。它是人類至今所引爆過所有種類的炸彈中，體積、重量和威力最強大的炸彈。它又被称为“库兹卡的妈妈”，这是一句俄国谚语，粗略翻译为“我们要你好看！”可能与苏联共产党中央委员会第一书记尼基塔·赫鲁晓夫在1960年的联合国大会会议上，承诺给美国看看“库兹卡的妈妈”有关。它的爆炸當量本來相當於一億噸的TNT炸藥，不過蘇聯當局憂心試爆後的核子落塵对環境的嚴重影响，會導致內政难题與外交风波，因此將核彈減半為5,000萬噸的爆炸威力。儘管削減了一半威力，沙皇炸彈的威力依舊是第二次世界大战末期投擲於日本廣島市和长崎市的「小男孩」原子彈的3,800倍、「胖子」原子彈的2,300倍。雖然蘇聯成功完成試爆，沙皇炸彈仍然從未列入現役武器，蘇聯軍方僅想将沙皇炸彈作為蘇聯在軍力上的象徵與展示。",
    "波音737是民航界史上最暢銷的客機[4]，自1967年起已生產超過10,030架，並仍有超過4,673架的訂單等待交付[1]，主要生產線是在華盛頓州的波音倫頓廠房。",
    "E. W. Dijkstra（1930/05/11-2002/08/06），杰出癿计算机科学家，1972年图灵奖得主.",
    "散列表（，也叫哈希表），是根据键（Key）而直接访问在記憶體儲存位置的数据结构。也就是说，它通过计算一个关于键值的函数，将所需查询的数据映射到表中一个位置来访问记录，这加快了查找速度。这个映射函数称做散列函数，存放记录的数组称做散列表。",
    "单次U235裂变放能$200 \\ MeV=3.2\\times 10^(-11)  J$。中微子带走12。",
    "1859/10/27天体物理诞生。太阳光谱。",
    "归并排序，是建立在归并操作上的一种有效的排序算法，效率為O(nlogn)。1945年由约翰·冯·诺伊曼首次提出。该算法是采用分治法（Divide and Conquer）的一个非常典型的应用，且各层分治递归可以同时进行。",
    "北京字节跳动科技有限公司，简称字节跳动，是一家位于中國北京的跨国互联网技术公司[3]，成立于2012年3月，旗下有产品今日头条、火山短视频和抖音（及其海外版本TikTok）等。",
    "微軟（NASDAQ：MSFT）是美國一家跨國電腦科技公司，以研發、製造、授權和提供廣泛的電腦軟體服務為主",
    "二叠纪-三叠纪灭绝事件是有史以来最大的灭绝事件，其导致当中96%的海洋生物消失，其詳細原因目前尚不明確。",
    "巨脈蜻蜓（學名：），又名大尾蜻蜓或巨尾蜻蜓，是3億年前石炭紀一種已滅絕的昆蟲，外型與現今的蜻蜓接近。翼展範圍自 65 cm（25.6英寸） 到超過 70 cm（28英寸）[1][2]，是目前已知地球上曾出現最大的飛行昆蟲物種。牠們是掠食者，以其他昆蟲及細小的兩棲動物為食物。有多項理論可能可以解釋石炭紀昆蟲的巨大體型，但仍然具有爭議",
    "鸟或者鳥類是鸟纲动物的通称，是唯一存活並演化至今的恐龍，現代所有鳥類在生物学上也被分類為鸟形恐龙（即鳥翼類）的一部份",
    "孔子鸟屬（屬名：，或根據拉丁文音譯作孔夫子鸟）是一种原始鳥類，化石遗迹在中国辽宁省北票市的热河組（即四合屯和李八郎沟等白垩纪时期的沉积岩）中发现，並在此地層中廣泛發現了許多該鳥類的化石標本[10] 。",
    "剑桥大学1948年才开始授予女性学位。",
    "太阳氢丰度超出百分之九十，正值壮年。",
    "一个地球大小 赤热的铁球冷却到室温 需要 75000年？。",
    "连翘，香港俗稱一串金，是木犀科连翘属植物。為落叶灌木，高2~4m。花期3~5月；果期7~9月。",
    "紫荆，又名裸枝树（中国主要植物图说）、紫珠（本草拾遗），为豆科紫荆属的植物。[2]落叶乔木，高達15米，胸徑50厘米，但一般作為灌木或小喬木栽植，有變種垂花紫荆花，大為粉红色；黄山紫荆花為粉红或乳白色。花期4月，葉前開放；果10月成熟。北京的清华大学校花是紫荆花和丁香花，但通常也仅指紫荆花，这是由于紫荆花与校旗、校色的颜色一致，也是由于紫荆花在4月校庆日前后盛开。",
    "樱花是蔷薇科李屬樱亚属（學名：Prunus subgen. Cerasus）植物的统称，尤其指花朵美丽供观赏的种类。",
    "夜翼龍（學名：Nyctosaurus）是翼手龍亞目的一屬，因牠們異常長的大型頭頂冠飾而著名，掠海翼龍也有類似的冠飾。少數科學家假設這些類似鹿角的冠飾，可能用來支撐肉質帆狀物，當掠過海面捕食魚類時，帆狀物可用來穩定。牠們的化石在美國中西部發現，這個地區在白堊紀時是廣闊的淺海。夜翼龍的早期化石並未透露出複雜的冠飾，只有發現類似無齒翼龍的較小結構。",
    "GZK極限，是以提出者Greisen、Zatsepin、Kuzmin三人姓氏之首字母為名的理論上限，描述源自遠處的宇宙射線應有的理論上限值。超過閾值5e19 電子伏特。超高能量宇宙射線，又被戲稱為「我的天啊粒子」（Oh-My-God particle）",
    "氦核的质量比四个质子之和少0.8%。",
    "C#是微软推出的一种基于.NET框架的、面向对象的高级编程语言。C#是一种由C和C++衍生出来的面向对象的编程语言。它在继承C和C++强大功能的同时去掉了一些它们的复杂特性，使其成为C语言家族中的一种高效强大的编程语言",
    "电弱交互作用理论和强交互作用理论建立以后，由于他们都由相似的规范场论来描述，理论物理学家随即试图统一它们。哈沃德·乔吉和谢尔登·格拉肖于1974年提出了最早的SU(5)大统一理论。这是第一个统一了电弱相互作用和强相互作用的理论。值得指出的是，由于量子引力理论尚存在困难，目前一般称为“大统一理论”的理论都与引力无关。",
    "先农坛建筑群是明清两代皇帝祭祀先农诸神和太岁诸神和举行亲耕的地方，位于北京市西城区[註 1]南中轴线西侧，与天坛东西相对，遥相呼应。",
    "卡尔维诺后期的幻想作品有：《宇宙连环画》（1965年出版）对宇宙创造和进化的意识流叙述；稍后的《看不见的城市》（1972年出版）、《命運交織的城堡》（1973年出版）和《如果在冬夜，一个旅人》（又译《寒冬夜行人》，1979年出版），卡尔维诺使用了游戏般创新的结构和多变的视点，目的是考察机会、巧合和变化的本质。《文学的作用》（1980年出版）是他为Il Menabò杂志写的文章的结集。",
    "風神翼龍屬（屬名：）又名披羽蛇翼龍、羽蛇神翼龍，是種翼手龍類，生存於晚白堊紀（馬斯垂克階）的美國南部，約6800萬年前到6600萬年前，是目前已知最大的飛行動物之一，翼长超过10米，站在地面上时和现代长颈鹿同高。這種翼龍屬於神龍翼龍科，牠們是先進而缺乏牙齒的翼龍類。屬名的來源是阿茲特克文明裡的披羽蛇神克察尔科亚特尔（Quetzalcoatl）。",
    "估計地球所吸收的太陽能有1%到3%轉化為風能，總量相當於地球上所有植物通過光合作用吸收太陽能轉化為化學能的50到100倍。上了高空就會發現風的能量，那兒有時速超過160公里（100英哩）的強風。這些風量最後和地表及大氣間摩擦，而以各種熱能方式釋放。",
    "1919年，德國物理學家貝茲認為，不管如何設計渦輪，風機最多只能提取風中59%的能量，此稱為貝茲極限定律（Betz Limit）。現今正在運作的風力發電機所能達到的極限約為40%。[18]大多數風力發電機實際效率範圍從20%到40%[19]。風力發電的細長（高展弦比）的風機葉片，在低速有比較高效率。",
    "垂直軸風力發電機（英語：，VAWT）是風力發電機的一種類型，其主轉子軸與風向垂直，機電部件位於風力發電機的底部。這種設計可讓發電機和變速箱靠近地面放置，以便於維護和修理。 垂直軸風力發電機不需要正對風向[1][2]，因此不需要有感應與對準風向的機制。以同樣環境、同樣額定功率產品比較，一般「垂直軸風力發電機」發電效率低於「水平軸風力發電機」，因此大部分大型商用系統採用「水平軸風力發電機」。",
    "JavaScript是一门基于原型、函数先行的语言[9]，是一门多范式的语言，它支持面向对象程式設計，命令式编程，以及函数式编程。它提供语法来操控文本、数组、日期以及正则表达式等，不支持I/O，比如网络、存储和图形等，但这些都可以由它的宿主环境提供支持。",
    "Django是一个开放源代码的Web应用框架，由Python写成。采用了MVT的软件设计模式，即模型（Model），视图（View）和模板（Template）。它在开发初期用于管理劳伦斯出版集团旗下的一些以新闻为主的网站。Django于2005年7月在BSD许可证下发布，它的名字来源于比利时的吉普赛爵士吉他手Django Reinhardt。",
    "OpenGL（英語：，譯名：開放圖形庫或者“開放式圖形庫”）是用於渲染2D、3D矢量圖形的跨語言、跨平台的應用程序編程接口（API）。這個接口由近350個不同的函數调用組成，用來從簡單的圖形位元繪製複雜的三維景象。而另一种程式介面系统是仅用于Microsoft Windows上的Direct3D。OpenGL常用於CAD、虛擬實境、科學視覺化程式和電子遊戲開發。",
    "DirectX（，縮寫：）是由微软公司建立的一系列專為多媒體以及遊戲開發的應用程式介面。旗下包含Direct3D、Direct2D、DirectCompute等等多個不同用途的子部份，因為這一系列API皆以Direct字樣開頭，所以DirectX（只要把X字母替換為任何一個特定API的名字）就成為這一巨大的API系列的統稱。目前最新版本為DirectX 12，隨附於Windows 10作業系統之上。",
    "Unity是由Unity Technologies研发的跨平台2D/3D遊戲引擎，可用於開發Windows、MacOS及Linux平台的單機遊戲，PlayStation、Xbox、Wii、任天堂3DS和Switch 等游戏主机平台的视频游戏，以及iOS、Android等移动设备的遊戲。除可以用于研发电子游戏之外，Unity还广泛用作建筑可视化、实时三维动画等类型互动内容的综合型创作工具。Unity最初于2005年在苹果公司的全球开发者大会上对外公布并开放使用，当时只是一款面向Mac OS X平台的游戏引擎。",
    "Three.js由Ricardo Cabello在2010四月于GitHub首次发布。Three.js允许使用JavaScript创建网页中的GPU加速的3D动画元素，而不是使用特定的浏览器插件。[3][4]这归功于WebGL的出现。",
    "JavaScript函式庫是指用於Javascript語言開發的函式庫，多應用在網頁DOM、AJAX、CSS的領域，可以幫助網頁開發者用更快速地撰寫網頁，例如有些JavaScript函式庫提供精簡化的DOM操作函數或解決跨瀏覽器問題等。",
    "jQuery是一套跨瀏覽器的JavaScript函式庫，简化HTML與JavaScript之間的操作。[1]由約翰·雷西格（）在2006年1月的BarCamp NYC上釋出第一個版本。目前由Dave Methvin领导的团队进行开发。全球前10,000个访问最高的网站中，有65%使用了jQuery，是目前最受歡迎的JavaScript函式庫[2][3]。",
    "SQL（i/ˈɛs kjuː ˈɛl/[4]或i/ˈsiːkwəl/[5]，Structured Query Language:结构化查询语言[6][7][8][9]）是一种特定目的程式语言，用于管理关系数据库管理系统（RDBMS），或在关系流数据管理系统（RDSMS）中进行流处理。",
    "国际热核聚变实验反应堆（英語：，缩写：）是国际核聚变研究和巨型工程，将成为世界上最大的磁约束等离子体物理学实验，这是目前正在建设世界上最大的实验性托卡马克核聚变反应堆，邻近于法国南部的卡达拉舍设施[1]。ITER工程的目标是从等离子体物理实验研究，到大规模电力生产的核聚变发电厂的期待已久的转变。“ITER”在拉丁文意为“道路”，因此这个实验的缩写“ITER”也意味着和平利用核聚变能源之路。",
    "等離子體是宇宙重子物質最常見的形態，其中大部分存在於稀薄的星系際空間（特別是星系團內介質）和恆星之中。[3]地球大氣離地表300公里的電離層也是處於等離子態，電離層是地球大氣較外層的氣體吸收了太陽輻射能量，發生光致游離而形成。",
    "春季是一年四季之第一季。按照公历，北半球的春季为3月、4月和5月；南半球的春季为9月、10月和11月。此外，在台灣等地区，春季的开始是立春（2月3日至5日之间），春季的结束是立夏（5月5日至7日之间）。在一些地區，春季被認為從春分开始，到夏至结束。",
    "地磁场呈现出两极强，赤道弱的分布，形成了一个天然磁镜。外层空间的带电粒子进入地磁场后，将在地磁场的约束下绕地球磁感线做螺旋运动，并在两极间反射，形成一个电磁辐射带。1958年物理学家范·阿伦通过分析人造卫星收集的数据，发现了电磁辐射带的存在，于是该电磁辐射带又被称为范·阿伦辐射带。有时范·阿伦辐射带中的带电粒子因空间磁场的变化而在两极附近进入地球大气层，引起极光。",
    "磁镜是由两个电流方向相同的线圈以中轴重合的方式排列形成的一种磁场构形，磁场在每个线圈的中心处最强，在线圈中间最弱。带电粒子在磁镜场中运动时，粒子的磁矩是一定的，在磁场强的地方，粒子垂直于磁场方向的速度分量变大，由于磁场不对粒子做功，粒子的总动能不变，因此平行于磁场方向的速度分量会相应变小。动能小的粒子会完全失去平行方向的速度，这样就会被磁场反射，朝着相反的方向运动，当运动到另外一侧时，又会被再次反射，这样粒子就会在两个线圈之间来回运动，如同光在两面镜子之间反射，因此得名磁镜。",
    "地磁場是源自於地球內部，並延伸到太空的磁場。磁場在地表上的強度在25－65微特斯拉（即0.25至0.65高斯）之間。[3]粗略地說，地磁場是一個與地球自轉軸呈11°夾角的磁偶極子，相當於在地球中心放置了一個傾斜了的磁棒。目前的地磁北極位於北半球的格陵蘭附近，實際上它是地磁場的南極，而地磁南極則是地磁場的北極。地核向外散發熱量時，引起外核中熔融鐵的對流運動，進而產生電流，地磁場即是此電流所致。這種形成天體磁場的原理，稱為發電機理論。",
    "地磁場能夠使大部分太陽風偏轉方向。沒有了地磁場，太陽風中的帶電粒子就會剝去阻擋紫外線的臭氧層，生物體也就會受到紫外線的侵害。[4]其中一個大氣剝離原理是，氣體粒子被困在一個磁場泡之中，磁場泡再被太陽風「吹走」。[5]從火星大氣二氧化碳因太陽風流失的速度推算，可推斷火星大氣層所剩無幾，是由它磁場的喪失直接導致的。",
    "2010年国际半导体技术发展路线图的更新增长已经在2013年年底放缓[4]；又比如说英特尔在22纳米跟14纳米的CPU製程上已经放慢了技术更新的脚步，之后的时间里，晶体管数量密度预计只会每三年增加一倍。",
    "Python（英國發音：/ˈpaɪθən/ 美國發音：/ˈpaɪθɑːn/）是一种广泛使用的解释型、高级编程、通用型编程语言，由吉多·范罗苏姆创造，第一版发布于1991年。",
    "可缩放矢量图形（英語:SVG）是一种基于可扩展标记语言（XML），用于描述二维矢量图形的图形格式。SVG由W3C制定，是一个开放标准。",
    "金陵四十八景是指南京有代表性的四十八个景点。“金陵四十八景”的说法最早起于明代，清初高岑曾绘《金陵四十八景图》。金陵四十八景目前仅存半余，近些年又有新金陵四十八景的评选。",
    "A*搜索算法（A* search algorithm）是一種在圖形平面上，有多個節點的路徑，求出最低通過成本的演算法。常用於遊戲中的NPC的移動計算，或网络游戏的BOT的移動計算上。该算法综合了最良優先搜索和Dijkstra算法的优点：在进行启发式搜索提高算法效率的同时，可以保证找到一条最优路径（基于评估函数）。",
    "數學上，切比雪夫距离（Chebyshev distance）或是L∞度量[1]是向量空間中的一種度量，二個點之間的距離定義為其各座標數值差的最大值[2]。以(x1,y1)和(x2,y2)二點為例，其切比雪夫距离為max(|x2-x1|,|y2-y1|)。切比雪夫距离得名自俄羅斯數學家切比雪夫。",
    "戴克斯特拉算法（英語：），又译迪杰斯特拉算法，亦可不音譯而稱爲Dijkstra算法[6]，是由荷兰计算机科学家艾茲赫尔·戴克斯特拉在1956年发现的算法，并于3年后在期刊上发表[7][8][9]。戴克斯特拉算法使用类似廣度优先搜索的方法解决赋权图[9]的单源最短路径问题",
    "图的遍历问题分为四类：1.遍历完所有的边而不能有重复，即所謂“欧拉路径问题”（又名一笔画问题）；2.遍历完所有的顶点而没有重复，即所谓“哈密頓路径问题”。3.遍历完所有的边而可以有重复，即所谓“中国邮递员问题”；4.遍历完所有的顶点而可以重复，即所谓“旅行推销员问题”。对于第一和第三类问题已经得到了完满的解决，而第二和第四类问题则只得到了部分解决。第一类问题就是研究所谓的欧拉图的性质，而第二类问题则是研究所谓的哈密顿图的性质。",
    "邮递员问题（也称邮路问题，Route Inspection Problem，或中国邮路问题,China Route Inspection Problem，或中国邮递员问题Chinese Postman Problem）是一个图论问题。此問題為在一個連通的無向圖中找到一最短的封閉路徑，且此路徑需通過所有邊至少一次。",
    "旅行商问题（最短路径问题）（英語：, TSP）是这样一个问题：给定一系列城市和每对城市之间的距离，求解访问每一座城市一次并回到起始城市的最短回路。它是组合优化中的一个NP困难问题，在运筹学和理论计算机科学中非常重要。",
    "贝尔曼-福特算法（英語：），求解单源最短路径问题的一种算法，由理查德·貝尔曼（Richard Bellman） 和 萊斯特·福特 创立的。有时候这种算法也被称为 Moore-Bellman-Ford 算法，因为 Edward F. Moore 也为这个算法的发展做出了贡献。它的原理是对图进行∣V∣−1次松弛操作，得到所有可能的最短路径。其优于迪科斯彻算法的方面是边的权值可以为负数、实现简单，缺点是时间复杂度过高，高达O ( | V | | E | ) .但算法可以进行若干种优化，提高了效率。",
    "双向搜索算法是一种图的遍历算法，用于在有向图中搜索从一个顶点到另一个顶点的最短路径。算法同时运行两个搜索：一个从初始状态正向搜索，另一个从目标状态反向搜索，当两者在中间汇合时搜索停止。在很多情况下该算法更快，假设搜索一棵分支因子b的树，初始节点到目标节点的距离为d，该算法的正向和反向搜索复杂度都是O(bd/2) (大O符号)，两者相加后远远小于普通的单项搜索算法（复杂度为O(bd)）",
    "普里姆算法（Prim），图论中的一种算法，可在加权连通图里搜索最小生成树。意即由此算法搜索到的边子集所构成的树中，不但包括了连通图里的所有顶点，且其所有边的权值之和亦为最小。",
    "最短路径快速算法（英語：），国际上一般认为是队列优化的Bellman-Ford 算法，是一个用于求解有向带权图单源最短路径的算法。这一算法被认为在随机的稀疏图上表现出色，并且适用于带有负边权的图。[1] 其基本思路与 Bellman-Ford 算法相同，即每个节点都被用作用于松弛其相邻节点的备选节点。但相较于 Bellman-Ford 算法，SPFA算法的改进之处在于它并不盲目地尝试所有节点，而是维护一个备选的节点队列，并且仅有节点被松弛后才会放入队列中。整个流程不断重复直至没有节点可以被松弛。",
    "在概率论和统计学中，馬可夫決策過程（英語：，縮寫為MDPs）提供了一個數學架構模型，用於面對部份隨機，部份可由決策者控制的狀態下，如何進行決策，以俄罗斯数学家安德雷·马尔可夫的名字命名，是马尔科夫链的一种扩展。",
    "冥王星相对较小，仅有月球质量的六分之一、月球体积的三分之一。冥王星的轨道离心率及倾角皆较高，近日点为30天文单位（44亿公里），远日点为49天文单位（74亿公里）。冥王星因此周期性进入海王星轨道内侧。海王星与冥王星因相互的轨道共振而不会碰撞。在冥王星距太阳的平均距离上阳光需要5.5小时到达冥王星。",
    "海王星是太陽系八大行星中距离太阳最遠的,海王星的質量大約是地球的17倍，而性質極為類似的天王星密度較低，質量大約是地球的14倍。海王星以羅馬神話中的尼普顿（Neptunus）命名，因為尼普顿是海神王，所以中文譯為海王星。天文學的符號（♆，Unicode編碼U+2646），是希臘神話的海神波塞頓使用的三叉戟.作爲一個冰巨行星，海王星的大氣層以氫和氦為主，還有微量的甲烷。在大氣層中的甲烷，只是使行星呈現藍色的一部分原因。因為海王星的藍色比有同樣份量的天王星更為鮮豔，因此應該還有其他成分對海王星明顯的顏色有所貢獻。[7] 海王星有太陽系最強烈的風，測量到的風速高達每小時2,100公里。",
    "天王星是從太陽系由内向外的第七顆行星。与在古代就为人们所知的五顆行星（水星、金星、火星、木星、土星）相比，天王星的亮度也是肉眼可見的。天王星大氣的主要成分是氫和氦，還包含較高比例的由水、氨、甲烷等結成的「冰」，與可以探测到的碳氫化合物。天王星是太陽系內大气层最冷的行星，最低溫度只有49K（−224℃）。其外部的大气层具有複杂的雲層結構，水在最低的雲層內，而甲烷組成最高處的雲層。天王星的環系統在行星中非常獨特，因為它的自轉軸斜向一邊，幾乎就躺在公轉太陽的軌道平面上，因而南極和北極也躺在其他行星的赤道位置上。[13]從地球看，天王星的環像是環繞著標靶的圓環，它的衛星則像環繞著鐘的指針",
    "水星是太陽系的八大行星中最小和最靠近太陽的行星，但有著八大行星中最大的離心率 [註 1]，軌道週期是87.969 地球日。由于大氣層极为稀薄，无法有效保存热量，水星表面昼夜温差极大，为太阳系行星之最。白天时赤道地區温度可达432°C，夜间可降至-172°C。極區气温則終年維持在-172°C以下。水星表面充滿了大大小小的坑穴，外觀看起來與月球和其他衛星相似.",
    "金星（英語、拉丁語：Venus，天文符號：♀），它沒有天然的衛星。它的西文名稱源自羅馬神話的愛與美的女神，维纳斯（Venus），古希腊人称为阿佛洛狄忒，也是希腊神话中爱与美的女神。金星的天文符号用维纳斯的梳妆镜来表示。 它在夜空中的亮度僅次於月球，是第二亮的天然天體，視星等可以達到 -4.7等，足以照射出影子[6]。金星是一顆類地行星，因為它的大小、質量、體積與到太陽的距離，均與地球相似，所以經常被稱為地球的姊妹星。然而，它在其它方面則明顯的與地球不同。它有著四顆類地行星中最濃厚的大氣層，其中超過96%都是二氧化碳，金星表面的大氣壓力是地球的92倍。其表面的平均溫度高達735 K（462 °C；863 °F），是太陽系中最熱的行星，比最靠近太陽的水星還要熱。金星沒有將碳吸收進入岩石的碳循環，似乎也沒有任何有機生物來吸收生物量的碳。金星被一層高反射、不透明的硫酸雲覆蓋著，阻擋了來自太空中，可能抵達表面的可見光。它在過去可能擁有海洋，並且外觀與地球極為相似[7][8]，但是隨著失控的溫室效應導致溫度上升而全部蒸發掉了[9]。水最有可能因為缺乏行星磁場而受到光致蛻變分解成氫和氧，而自由氫一直被太陽風掃進星際空間 [10]。金星表面是乾燥的荒漠景觀，點綴著定期被火山刷新的岩石。",
    "火星（拉丁語：；天文符號：♂），火星的直徑約為地球的一半，自轉軸傾角、自轉週期則與地球相當，但繞太陽公轉周期是地球的兩倍[3]。韓佔火星距離地球最近在1億公里以內（最遠達4億公里，探測器需飛行約7個月抵達韓佔火星）。火星大氣以二氧化碳為主，既稀薄又寒冷。[4][5]是因為韓佔火星在視覺上呈現為橘紅色是因為地表廣泛普遍的分佈著氧化鐵的造成的，它使火星呈現出一种红色的外觀火星地表沙丘、礫石遍布且沒有穩定的液態水。火星有兩個天然衛星：火衛一和火衛二，形狀不規則，可能是捕獲的小行星。",

    "木星是距離太陽第五近的行星，也是太陽系中體積最大的行星，目前已知有79顆衛星。木星是顆巨行星，質量是太陽的千分之一，但卻是太陽系其他行星質量總和的2.5倍。太陽系的行星中，木星和土星是氣體巨星（天王星和海王星是冰巨星）。木星的主要成分是氫，但只佔十分之一分子數量的氦，卻佔了總質量的四分之一；它可能有岩石的核心和重元素[16]，但是像其他的巨行星一樣，木星沒有可以明確界定的固體表面。由於快速地自轉，木星的外觀呈現扁球體（赤道附近有輕微但明顯可見的凸起）。外面的大氣層依緯度成不同的區與帶，在彼此的交界處有湍流和風暴作用著。最顯著的例子就是大紅斑，已知是在17世紀第一次被望遠鏡見到，持續至今未曾停歇過的巨大風暴。環繞著木星的還有微弱的行星環和強大的磁層，包括4顆1610年發現的伽利略衛星，至2019年12月已經發現79顆衛星。木衛三是其中最大的一顆，其直徑大於行星中的水星.",
    "土星体积則僅次於木星。並與木星同属氣體（類木）巨星。土星的天文学符號是代表农神萨图尔努斯的鐮刀（Unicode: ♄）。土星主要由氫組成，還有少量的氦與微痕元素[11]，內部的核心包括岩石和冰，外圍由數層金屬氫和氣體包覆著。土星的風速高達1,800公里/時，風速明顯比木星快。土星的行星磁場強度介於地球和更強的木星之間。土星有一個顯著的環系統，主要的成分是冰的微粒和較少數的岩石殘骸以及塵土。已經確認的土星的衛星有82顆，是八大行星中最多。其中，土卫六是土星系統中最大和太陽系中第二大的衛星（半徑2575KM，太陽系最大的衞星是木星的木衛三，半徑2634KM），比行星中的水星還要大；並且土卫六是唯一擁有明顯大氣層的衛星[12]。還有，土星距離地球13億千米；地球一天等於23小時56分4.1秒，土星一天等於10小時42分0秒，是地球一天的大約九分之四。",
    "柯伊伯帶（英語：），又稱作倫納德-柯伊伯带，另譯柯伯帶、，是位於太陽系的海王星軌道（距離太陽約30天文单位）外側，在黃道面附近的天體密集圓盤狀區域[1]。柯伊伯带的假說最先由美国天文學家弗雷德里克·倫納德提出，十几年後杰拉德·柯伊伯證實了该观点。柯伊伯帶类似于小行星带，但範圍大得多，它比小行星帶宽20倍且重20至200倍[2][3]。如同主小行星帶，它主要包含小天体或太阳系形成的遗迹。虽然大多数小行星主要是岩石和金属构成的，但大部分柯伊伯带天体在很大程度上由冷冻的挥发成分（称为“冰”），如甲烷、氨和水组成。柯伊伯带至少有三顆矮行星：冥王星、妊神星和鸟神星。一些太阳系中的衛星，如海王星的海卫一和土星的土卫九，也被认为起源于该区域[4][5]",
    "React（有时叫React.js或ReactJS），是一个为数据提供渲染为HTML视图的开源JavaScript 库。React视图通常采用包含以自定义HTML标记规定的其他组件的组件渲染。React为程序员提供了一种子组件不能直接影响外层组件（data flows down）的模型，数据改变时对HTML文档的有效更新，和现代单页应用中组件之间干净的分离。",
    "Vue.js（/vjuː/，或简称为Vue）是一个用于创建用户界面的开源JavaScript框架，也是一个创建单页应用的Web应用框架[4]。 2016年一项针对JavaScript的调查表明，Vue有着89%的开发者满意度。[5]在GitHub上，该项目平均每天能收获95颗星，[5][6]为Github有史以来星标数第3多的项目。[7]",
    "React Native是一個臉書研發的開放源碼的應用程式架构。[1]React Native基於React.js，目的是讓開發者可以利用JavaScript和React.js的宣告式編程模式開發出在多平台上運作的程式。[5]React Native也可以使用React.js相容的Node.js套件，比如Redux。[6]",
    "在天文學中，光度（luminosity）是物體每單位時間內輻射出的總能量，即辐射通量，在國際單位制是瓦特（Watt），在厘米克秒制中是“爾格/秒”，天文学常以太陽光度來表示。也就是以太陽的輻射通量為一個單位來表示。太陽的光度是3.846×1026瓦特。光度以可指辐射通量的谱分布（spectral luminosity），单位为瓦特/赫兹（W/Hz）或瓦特/纳米（W/nm）。[2]:111",
    "纽约的交通系统还包括全美洲最长的悬索桥、同时也是世界最长悬索桥之一的韦拉札诺海峡大桥[378][379]，世界第一条机械通风的行车隧道荷兰隧道[380]，超过12,000辆黄色出租车[381]，连接罗斯福岛和曼哈顿岛的罗斯福岛空中缆车，以及将曼哈顿与城内城外诸多地点连接起来的渡轮系统。",
    "自由女神像（英語：）又名自由照耀世界（英語：，法語：），是位于美国纽约港自由島的巨型古典主义塑像，由弗里德利·奥古斯特·巴特勒迪设计，居斯塔夫·埃菲尔建造，1886年10月28日落成，是法国人民送給美國人民的禮物。塑像人物是身穿长袍的女子，代表罗马神话中的自主神，她右手高举火炬，左手的册子上用罗马数字写有美国独立宣言签署日期：“”（1776年7月4日），脚下还有断裂的锁链。这座塑像是自由和美国的象征，也是对外来移民的欢迎信号.",
    "彩虹大橋全長798米，橋跨570米。橋體構造分為上下2層，上層由首都高速11號台場線使用，下層的中央為百合鷗號路軌，兩側為一般道路（臨港道路海岸青海線），包括雙向四線車道及人行道。如需攜帶自行車過橋，必須裝入攜車袋、或放置在管理單位出租的專用臺車上[1]。兩座支撐大橋的橋塔使用白色設計，令橋梁整體與附近的景色和諧共融。在懸索橋面的纜上置有紅、白、綠3色燈泡，採用日間收集得來的太陽能作能源，在晚上點綴彩虹橋。彩虹大橋的景色令台場成為東京新興的觀光景點，而彩虹大橋本身亦成為數部日本電視劇的場景之一。",
    "桥，按形式和构造主要分为梁式桥、桁架桥、拱式桥、斜張桥、悬索桥、鋼架桥、组合桥。",
    "位于中国湖北省的三峡水电站，是世界上最大的水电站，总装机容量为22.50 GW；位于巴西和巴拉圭的伊泰普水电站是世界第二大水电站，装机容量为14.00 GW。不过，伊泰普水电站所处的巴拉那河水量丰沛且季节分布相对均衡，几乎可以全年满负荷发电[1]；而三峡水电站则每年都会经历约6个月的枯水期，从而限制了其发电量。",
    "长江，古稱揚子江，是亚洲第一长河和世界第三长河，也是世界上完全在一国境内的最长河流，全长6300公里，干流发源于青藏高原东部唐古拉山脉各拉丹冬峰，穿越中国西南（青海、西藏、云南、四川、重庆）、中部（湖北、湖南、江西）、东部（安徽、江苏），在上海市汇入东海。长江流域覆盖中国大陆五分之一陆地面积，养育中国大陆三分之一的人口。长江经济带也是中国最大的经济带。千年來多次江淮水災，如1998年的九八抗洪、2020年5月下旬至今的中国南方水灾。",
    "海南岛属海洋性热带季风气候，地处热带北缘，占中国热带土地面积的40%，光照充足，年日照时数大于2,000小时，活动积温达8,400至9,200摄氏度；夏热冬暖，最热月均温在25至29摄氏度，最冷月均温大于16摄氏度。極端情況下，才於明朝年間降雪[4]。降水方面，受夏季季风影响，岛上降水从东向西减少；受地形影响，降水廣泛集中於東部，西南部降水少，因此位於島內西南部有個著名的莺歌海盐场。",
    "核子動力潛艇，簡稱核子潛艇、核潛艇，是以核反應爐為動力來源的潛艇。由於這種潛艇的生產與操作成本，加上相關設備的體積與重量，採用這種動力來源的潛艇幾乎都是軍事用途，僅有少數核子潛艇是用於科學研究用途。",
    "五十型 Mark L 血邊盔甲 Bleeding Edge。於《復仇者聯盟3：無限之戰》和《復仇者聯盟4：終局之戰》登場，東尼首件“奈米科技”製作的裝甲，歷代裝甲中著裝速度最快，外裝於胸口中間的弧形反應爐為基礎，延伸骨架，而外殼則像碎片般組合成一體化的裝甲，動漫展釋出的海報證實此裝甲以正史漫畫「Model-Prime Armor」為範本改良[2]，留有前代裝甲的數個小燈，且擁有視戰鬥需求變形的能力，在電影中曾變形出四個可延伸為翅膀的飛行穩定器與雙腳組合而成的重型飛行噴射器，發射各種導彈，以及全身部位的多重變化型裝備(雷射手刀、一般手刀、大小盾牌、雷射加農砲、雙臂雙腳的吸附装置、可作修復破洞的奈米噴霧器、重型拳套、多重激光束流拳套、奈米自我治療、甚至是有一定自主製造設備如手掌束縛器等的能力)，可於太空中活動，最後在與薩諾斯交戰時，此裝甲被薩諾斯徒手輕鬆撕碎，奈米分子並在不斷變形中被消耗殆盡而全毀，最後變出來的手刀更被其拆走，把東尼本人刺成重傷，但東尼最後使用此完全損毀的戰甲為自己進行了緊急治療。《復仇者聯盟4：終局之戰》中，逃出泰坦星的東尼以為自己會在太空中坐以待斃而利用該裝甲殘餘的奈米物質變出一個不完整的頭盔向小辣椒錄下遺言，在被驚奇隊長救回地球後此裝甲被回收。",
    "叶绿体膜上有两套光合作用系统（光系统）：光合作用系统一和光合作用系统二（光合作用系统一比光合作用系统二要原始，但电子传递先在光合作用系统二开始，一、二的命名则是按其发现顺序）。在光照条件下，两系统分别吸收700nm和680nm波长的光子作为能量，将从水分子在光解过程中得到的电子不断传递，该过程还有细胞色素b6/f的参与。电子最后被传递给辅酶NADP，通过铁氧还蛋白-NADP还原酶将NADP还原为NADPH。而水光解所得的氢离子则顺浓度差通过类囊体膜上的蛋白质复合体而从类囊体内向外移动到基质，势能降低。其间的势能用于合成ATP，以供碳反应所用。此时势能已降低的氢离子则被氢载体NADP带走，一分子NADP可携带两个氢离子。这个NADPH于氢离子则在碳反应中充当还原剂的作用。",
    "紫色地球假說（Purple Earth hypothesis）是一個天文生物學上的假說。該假說的內容是地球上的早期生命形式是基於视黄醛，而非葉綠素的形式。今日基於视黄醛的微生物例如可直接以太陽光為能量來源的微生物嗜鹽菌[1]。",
    "光合作用的第一步是光能被叶绿素(Chlorophyll)吸收并将叶绿素离子化。产生的化学能被暂时储存在三磷酸腺苷(ATP)中，并最终将二氧化碳和水转化为氧氣和碳水化合物。叶绿素a和叶绿素b的吸收光谱较为接近，两者在蓝紫光（430~480nm）和红光区（640~660nm）都有一吸收高峰，叶绿素ab对绿光的吸收很少，所以呈绿色",
    "时针式喷灌机是一种移动式喷灌机，喷灌头安装在有轮子支撑的电镀钢管或铝管上，围绕一个中心旋转，从中心枢轴输送水，整个喷灌机喷灌面积形成一个圆。这种喷灌机械在美国使用的很普遍。",
    "溫室，又稱玻璃溫室或暖房，是一座專用作種植植物的建築物。它的建造物料是玻璃或塑料，溫室會因太陽發出的電磁輻射而加熱，使溫室內的植物、泥土、空氣等變暖，因為可以提早種植也比較不受氣候影響，在亞熱帶和溫帶國家很流行，在乾燥地區還有防止水份過度蒸發的效果。玻璃被用作為溫室的建造物料是因為它是不同光學頻譜的其中一種可選性的傳輸媒介，而它的另一個作用是可以集中抓住能量，使溫室內的植物、空氣變暖。這些熱空氣會下沉於地面和防止上升和流動，因此如果在溫室屋頂上只打開一個小窗口，溫室溫度就會顯著地下降，這個原理就仿如一個基本的自動排氣冷卻系統。溫室的興建就是可以抓住電磁輻射和防止對流現象。因此，用于温室的玻璃作为气流屏障，其效果是捕获温室内的能量。靠近地面被加热的空气, 就被防止无限地上升和流失。虽然会发生由于通过玻璃和其他建筑材料热传导的热损失，温室内的净能量（及因此温度）仍是增加的",
    "為了缩短由垃圾回收造成的停顿，V8使用stop-the-world, generational, accurate的垃圾回收器[5]。在执行回收之时会暫時中断程序的执行，而且只处理物件堆疊。還會收集內存內所有物件的指標，可以避免内存溢位的情况。V8組譯器是基於Strongtalk組譯器[6]。",
    "",
    "",
    "",
    "",
    "",
    "topic FOR *STAR*： 桥 电力系统 新能源  海洋 城市规划 建筑"
]