[
    "地球核心密度 13 g/cm3，中子星则 1e13 ~ 1e16  白矮星1e6",
    "hc = 1241 MeV·fm  500nm的光子 大概2.5eV能量",
    "逆beta衰变（IBD）的阈值是1.806 MeV  截面在 1e-42 cm2 量级  很小",
    "Linux的路径分隔符是右倾的 /",
    "视星等，一等星相当于一根蜡烛在一公里之外，六等星亮度低一百倍，其他等星在其间等距分布",
    "SK-Ⅴ 2020夏天开始取数据了，使用Gd俘获中子   预计2027 HK开始取数据",
    "水中切伦科夫辐射角度为42°",
    "微软图标颜色分别是 ，红绿蓝黄",
    "造父变星是体积周期脉动造成周期多普勒红移的星体，也是标准烛光   周光关系",
    "一个秒差距pc，1pc=3.26 light-year  银河系直径30kpc  宇宙尺度在Gpc级别",
    "原子核尺度在10fm量级  1.4A^1/3",
    "波兰耶稣雕像头顶布满通信基站2333",
    "紫荆七号楼 经过 十号楼  去 六教 的路程是 1.4km",
    "中微子震荡参数测量  反应堆短基线测theta13   太阳中微子测12   大气中微子加速器中微子测23",
    "Dirac方程 的slash partial  是 gamma partial的缩写 ",
    "PMT对eV级别的光子敏感，因为它需要光电子",
    "两个质子的库伦势垒高达 1MeV 单纯热运动需要 2e10 K 达到这个平均动能  但由于 麦克斯韦-玻尔兹曼分布  跟 隧穿效应  恒星氢 聚变  8e6 K 就可以开始了",
    "1916年，Schwarzschild 在战壕里解出黑洞解,再过一年后在战争中死掉，静态 球对称 真空 非旋转的解。同年，Reinner找到了 带电荷 球对称 静态 的黑洞解。 直到1963年Kerr 才解出了新的 轴对称 旋转的黑洞解 Kerr黑洞",
    "电磁波来自电荷的加速。引力波来自于大质量-能量的非球对称加速，与电池磁作用不同，质量分布的偶极矩不起作用，四极矩起作用，它的亮度正比于 四极矩对时间的三阶导数的平方。",
    "按照经典力学的理论，双星系统是稳定的。但由于引力波的辐射，双星系统是不稳定的。 1974年之后对 PSR 1913+16 的观测 证实了这一点，它的轨道周期性的变小。 经典力学下  时空是无限硬的，而广义相对论下只是极端硬的。",
    "2020/11/21 T大初雪",
    "Windows1.0 诞生于11/20/1985",
    "kT=0.0253 eV",
    "二项分布，在次数很多，概率很小的时候可以看作泊松分布。泊松分布在平均值比较大（>20）的时候又可以看成是高斯分布。泊松分布的方差与期望相等。",
    "指数分布多描述器件的老化损坏，信号到达的时间间隔。",
    "GWTC (gravitational wave transient catalog) 引力波暂时目录 , 1期与2期记录了67次GW。大多数引力波事件源为双黑洞并和。其中GW170817为双中子星并和，其信号比较弱，但同时段其他探测器(Fermi 卫星) 测到了Gamma暴。",
    "引力波的频率与源的质量成反比，LIGO的观测波段在声学波段（40~7000 Hz）。它的精度达到fm的1/1000. LIGO有三台干涉仪，H1(4km) H2(2km)  L1(4km) , 分别在华盛顿与路易斯安娜。",
    "超新星命名规则: SN + 年份 + abcd... aa ab...  ",
    "大气层对光的窗口：可见光与射电波段",
    "每秒钟有万亿级别的太阳中微子闯过你的头，但几乎与你不发生任何反应。",
    "中微子是目前唯一 不带电荷的 不带色荷的 费米子。而它的质量非常之小 ~0.1eV 甚至更小 ，同为基本粒子的顶夸克却重达173.1 GeV  这中间差了 12 个量级。 如此奇怪。",
    "Kilo（1e3）、Mega（1e6）、Giga（1e9）、Tera（1e12)  Peta（1e15）、Exa（1e18）、Bronto（1e21）",
    "中微子的测量：(1)混合角与CP相角，质量差  (2)绝对质量与质量序   (3)中微子是不是Majorana的？  对应中微子振荡     无中微子双beta衰变",
    "整个宇宙，中微子的数量与光子相当，~300/cm2 , 因此它的质量对于 宇宙大尺度结构 至关重要。",
    "Science最新实验测量，质子的直径是0.843fm。",
    "SN1987A,神冈记录到了11次中微子事件，世界上其他两个探测器分别测量到了5个与3个。",
    "截止到2020年11月30日，ICECUBE测到最高中微子能量为10PeV。",
    "动能在其质量1e-9的粒子，速度在1e4 m/s",
    "ICECUBE两根电缆之间的距离为",
    "Cs137 Gamma源的光子为0.662MeV",
    "声子是",
    "1992年的诺贝尔物理学奖发给了G. Charpar ,多丝正比室",
    "质子衰变，变成pion0与正电子，但它半衰期很长很长，其与BSM相关、与其量子数破缺",
    "LPM effect 高能粒子的韧致辐射与电子对效应截面下降",
    "ASKARYAN effect 高能中性粒子在电介质当中打出shower，使得电子富集，这个个过程当中电荷积累相当于偶极子，发出射电波段的辐射。",
    "GZK cut off，极高能量中微子与CMB作用",
    "KAON是0自旋的玻色子，+ - 0 均有，它喜欢衰变成为pion。",
    "muon是1/2自旋的费米子，带有一个电子电荷，质量为105.66 MeV，生命为2.2 muSecond（弱作用当中比较长），muon衰变时产生与它相同电荷电子与两个中微子。",
    "pion是自旋0的玻色子，带电荷的pion喜欢变成muon（99%",
    "maxwell demon",
    "laplace demon",
    "LHC的现在有8个实验",
    "ATLAS,LHC上的一个实验，通用粒子探测器",
    "CMS，LHC上的一个实验，通用粒子探测器",
    "ALICE，重离子对撞",
    "LHCb，底夸克性质测量",
    "爱丁顿耀斑，双黑洞系统当中，一个穿过另一个的吸积盘。",
    "For example, a 10 PeV (100 TeV) muon will travel on average 21 km (13 km) before its energy drops to 10% of its initial energy",
    "直线加速器",
    "环形加速器",
    "低温环境当中，比如南极，热水比冷水更快结冰",
    "适应性光学",
    "特殊函数 库 http://dlmf.nist.gov",
    "geon     ",
    "虫洞",
    "Windows 1.0 does not allow overlapping windows until Windows 2.0",
    "氦闪",
    "超新星遗迹  强磁场 同步辐射  幂律谱",
    "兰姆移位  1947 谢尔特岛",
    "天顶角？",
    "penrose过程",
    "黑洞的 三角形规律",
    "奇异数  产生于强作用的重子以弱作用衰变  例如kaon Sigma Lambda",
    "宇称不守恒",
    "静态中子星质量上限为2.2Msun，旋转则为2.7Msun",
    "URCA过程",
    "银道坐标系",
    "脉冲星PSR周期多在$0.2 ~ 2 s$,最长不过十几秒",
    "曲率  挠率",
    "广义相对论采用的是无挠率的黎曼空间",
    "宋代始于公元960,结束语南宋1270",
    "果蝇在任何时候回避蓝紫色光，因为能量太高",
    "Ⅰa超新星爆发产生了宇宙的大部分铁元素",
    "交流约瑟夫效应",
    "时间晶体 ",
    "木星大气存在闪耀的极光",
    "目前的GPS系统由31颗卫星组成，高度20000km。定位至少需要同时接受四颗卫星的信号。",
    "ITER预计在2025年产生第一团等离子体。聚变正式并电网预计在2060年。可信度未知，2021年2月5日。",
    "仿星器",
    "托卡马克",
    "大脑只有三榜重，也就是大约1.5$kg$",
    "热量传递通常有三种方式，热传导、热对流、热辐射。        ",
    "银河系大约有3e11颗恒星star。",
    "望远镜的分辨率取决于观测物质波长与望远镜口径之比，越小越好。",
    "欧洲南方天文台ESO建在智利的极大望远镜European-Extremely large telescope(E-ELT)直径达到40m，面积相当三个篮球场，预计2025年运行。",
    "自适应光学，",
    "索尔金参数",
    "量子比特，量子众态",
    "火星大氣層相對較薄，平均地表氣壓只有6百帕，约为地球表面氣壓的0.6%，相當於地球表面算起35公里高的氣壓，如此低的氣壓使聲音傳播的距離只有在地球上的1.5%。韓佔火星大氣成分为95%的二氧化碳，3%的氮气，1.6%氬气，很少的氧气、水氣等，亦充滿著很多懸浮塵埃，吸收藍光使天空成黃褐色。",
    "失控的温室效应使金星变成了“地狱星球”。",
    "理论上，宇宙早期最先捕获电子的是氦核。",
    "爱因斯坦曾经设计了一种机翼，cat‘s-back wings，但不成功。 ",
    "飞行器升力的现代通俗解释：翼型airfoil 造成上翼真空低压区$\\rightarrow$气体向下加速填满低压区",
    "KM3NET预计2024法国完工，2026意大利部分完工。",
    "哈勃常数$H_0$为74.03（2019），它的单位是 千米每秒每秒差距。",
    "造父变星 周光关系",
    "比邻星是距离太阳最近的一颗恒星，为4.2光年。",
    "一个成年人平均每天摄入2000卡路里，相对于让一只100瓦亮一整天的能量。",
    "显生宙，是5.41亿年前大量生物出现的时期。而細分後可劃分為古生代、中生代、新生代。古生代包括寒武纪、奥陶纪、志留纪、泥盆纪、石炭纪、二叠纪。",
    "Frank-Tamm formula $  $.",
    "Adobe在1993年发明了PDF，它可以在不同系统中查看相同的内容。",
    "快速动眼现象",
    "tesseract OCR python lib",
    "$1 \\ cal = 4.184 J  $",
    "黑火药",
    "invese free electron laser",
    "东京晴空塔高634m",
    "CCM实验",
    "隅田川、荒川",
    "卡方统计量",
    "姆潘巴效应，热水比冷水降温快",
    "咖啡摄入量与肝癌死亡率负相关",
    "超新星披萨片",
    "芭芭散射、穆勒散射",
    "纯U235球体失控的半径为8.7cm，质量为5.2kg。自然U235丰度为0.72%。",
    "假設完全裂變，一公斤的鈾-235理論上可以產生80萬億焦耳的能量（8×1013焦耳），相等於3000噸煤。",
    "液氦在温度降至2.178 K（−271 ℃）时，性质会发生突变，粘度极小，能形成只有几个原子厚度的薄膜，发生无粘度流动，成为一种超流体，稱為氦(II)，正常的液氦稱作氦(I)。这种氦(II)的表面张力很小，能沿容器壁向上流动，直到兩邊液面等高。此時的氦热传导性为铜的800倍，成為導熱性能極佳的熱導體。",
    "网景公司与昇阳电脑公司组成的开发联盟为了让这门语言搭上Java这个编程语言“热词”，因此将其临时改名为JavaScript，日后这成为大众对这门语言有诸多误解的原因之一。",
    "经典磁铁2T，超导磁铁10T",
    "快中子是在核裂變反應中產生的自由中子，其動能20keV～10MeV (1.6×10−13 焦耳，1MeV對應的速度約為14000千米/秒，相當於光速的5％。它們被稱作快中子。",
    "如果本地時間比UTC時間快，例如中国大陸[註 1]、香港、澳门、臺灣、蒙古国、菲律宾、新加坡、马来西亚、澳大利亚西部的時間比UTC快8小時，就會寫作UTC+8，俗称东八区。",
    "俄羅斯聯邦[9]，國土横跨歐亞兩大洲，为全世界領土面積最大的國家。拥有1707万平方公里的面积，占地球陸地面积八分之一[11][12]；它也是世界上第九大人口国家，拥有1.44亿人口，77%居住于其较为发达的欧洲部分。",
    "乾隆为清朝皇帝清高宗的年号，寓意為「天道昌隆」，1736年—1796年在全中国范围内使用，共60年，是全中国范围内使用时间第二长的年号，仅次于康熙。",
    "中子慢化是能量行为。中子扩散是空间问题。",
    "强相互作用是作用于强子之间的力，是所知四种宇宙间基本作用力最强的，也是作用距离第二短的（大约在 1e-15 m 范围内[1]，比弱交互作用[1e-18]的範圍大）。",
    "Amazon 于2007年11月19日以 399 美元的价格推出了 Kindle 第一代[8]。",
    "太陽的核心是指距离太陽的中心不超过太陽半徑的五分之一或四分之一的區域[35]，核心内部的物质密度高達150 g/cm3[36][37]，大約是水密度的150倍，溫度接近1,360萬K。相較之下，太陽表面的溫度大約只有5,800K。",
    "太阳核心的核融合在负反馈下达到平衡：速率只要略微提升，就會造成核心的溫度上升，压强增大，更能抵抗外围物质的压力，因此核心会膨脹，从而降低核聚变速率，修正之前核融合速率增加所造成的扰动；而如果反應速率稍微下降，就会導致溫度略微下降，压强降低，从而核心會收縮，使核融合的速率又再提高，回復到它之前的水平[43][44]。",
    "1348年繁華的佛羅倫萨發生一場殘酷的瘟疫（黑死病），喪鐘亂鳴，死了十多萬人，在整個歐洲，因此病而死的人多達七千五百萬到兩億。隔年薄伽丘以這次瘟疫為背景，執筆寫下了《十日談》.",
    "玻璃是一種呈玻璃態的无定形体[1]，熔解的玻璃經過迅速冷卻（過冷）而成形，雖為固態，但各分子因沒有足夠時間形成晶體，仍凍結在液態的分子排布狀態。",
    "白居易（772年2月28日－846年9月8日）[2]，字樂天，晚号香山居士、醉吟先生，在詩界有廣大教化主的稱號。祖籍山西太原，生于河南新鄭，唐代文學家，文章精切，特別擅長寫詩，是中唐最具代表性的詩人之一。作品平易近人，乃至於有「老嫗能解」的說法。",
    "颐和园西堤是仿照杭州西湖的苏堤建造的，一共有六座桥，分别是，界湖桥，豳风桥，玉带桥，镜桥，练桥，柳桥。还有一座景明楼。",
    "鸟巢国家体育场长330米，宽220米，高度为69.2米，占地25万平方米。运用高达121,000噸鋼建成的体育馆，建筑费用高达人民币23亿元。2004年3月正式开工。但因庞大的建筑经费而不得不于2004年8月暂时停工。经过一连串的讨论与修改，原计划中体育场的上盖被取消，专家称这不但会使体育场更加安全，同时也可以消减部分开支。最终体育场于2005年初恢复开工，并于2008年6月28日完工。",
    "咖啡因：略帶苦味，熔點高達237℃，因此烘焙好的咖啡熟豆，其咖啡因幾乎完整保留下來，並在萃取時會融入杯中。咖啡因的作用主要是刺激中樞神經系統、心臟和呼吸系統。適量的咖啡因亦可減輕肌肉疲勞，促進消化液分泌。由於它會促進腎臟機能，有利尿作用，幫助體內將多餘的鈉離子排出體外。但攝取過多會導致咖啡因中毒。",
    "/: slash或forward slash  英 [slæʃ] ",
    "TRIGGER（日语：）是一間企劃、製作日本動畫的公司，社名緣由是寓意創作猶如子彈射出時被「觸發」的一瞬間，亦被稱為「扳機社」。2013年10月，推出第一部長篇電視動畫作品《Kill La Kill》。今石洋之",
    "因发明“深度优先搜索算法”，約翰·霍普克洛夫特与罗伯特·塔扬在1986年共同获得计算机领域的最高奖：图灵奖。",
    "AN602，别称“沙皇炸彈”，是冷战期间蘇聯所製造的氫彈，總共製造兩枚，其中一枚於1961年10月30日在新地島試爆，另一枚作為研究與備用。它是人類至今所引爆過所有種類的炸彈中，體積、重量和威力最強大的炸彈。它又被称为“库兹卡的妈妈”，这是一句俄国谚语，粗略翻译为“我们要你好看！”可能与苏联共产党中央委员会第一书记尼基塔·赫鲁晓夫在1960年的联合国大会会议上，承诺给美国看看“库兹卡的妈妈”有关。它的爆炸當量本來相當於一億噸的TNT炸藥，不過蘇聯當局憂心試爆後的核子落塵对環境的嚴重影响，會導致內政难题與外交风波，因此將核彈減半為5,000萬噸的爆炸威力。儘管削減了一半威力，沙皇炸彈的威力依舊是第二次世界大战末期投擲於日本廣島市和长崎市的「小男孩」原子彈的3,800倍、「胖子」原子彈的2,300倍。雖然蘇聯成功完成試爆，沙皇炸彈仍然從未列入現役武器，蘇聯軍方僅想将沙皇炸彈作為蘇聯在軍力上的象徵與展示。",
    "波音737是民航界史上最暢銷的客機[4]，自1967年起已生產超過10,030架，並仍有超過4,673架的訂單等待交付[1]，主要生產線是在華盛頓州的波音倫頓廠房。",
    "E. W. Dijkstra（1930/05/11-2002/08/06），杰出癿计算机科学家，1972年图灵奖得主.",
    "散列表（，也叫哈希表），是根据键（Key）而直接访问在記憶體儲存位置的数据结构。也就是说，它通过计算一个关于键值的函数，将所需查询的数据映射到表中一个位置来访问记录，这加快了查找速度。这个映射函数称做散列函数，存放记录的数组称做散列表。",
    "单次U235裂变放能$200 \\ MeV=3.2\\times 10^(-11)  J$。中微子带走12。",
    "1859/10/27天体物理诞生。太阳光谱。",
    "归并排序，是建立在归并操作上的一种有效的排序算法，效率為O(nlogn)。1945年由约翰·冯·诺伊曼首次提出。该算法是采用分治法（Divide and Conquer）的一个非常典型的应用，且各层分治递归可以同时进行。",
    "北京字节跳动科技有限公司，简称字节跳动，是一家位于中國北京的跨国互联网技术公司[3]，成立于2012年3月，旗下有产品今日头条、火山短视频和抖音（及其海外版本TikTok）等。",
    "微軟（NASDAQ：MSFT）是美國一家跨國電腦科技公司，以研發、製造、授權和提供廣泛的電腦軟體服務為主",
    "二叠纪-三叠纪灭绝事件是有史以来最大的灭绝事件，其导致当中96%的海洋生物消失，其詳細原因目前尚不明確。",
    "巨脈蜻蜓（學名：），又名大尾蜻蜓或巨尾蜻蜓，是3億年前石炭紀一種已滅絕的昆蟲，外型與現今的蜻蜓接近。翼展範圍自 65 cm（25.6英寸） 到超過 70 cm（28英寸）[1][2]，是目前已知地球上曾出現最大的飛行昆蟲物種。牠們是掠食者，以其他昆蟲及細小的兩棲動物為食物。有多項理論可能可以解釋石炭紀昆蟲的巨大體型，但仍然具有爭議",
    "鸟或者鳥類是鸟纲动物的通称，是唯一存活並演化至今的恐龍，現代所有鳥類在生物学上也被分類為鸟形恐龙（即鳥翼類）的一部份",
    "孔子鸟屬（屬名：，或根據拉丁文音譯作孔夫子鸟）是一种原始鳥類，化石遗迹在中国辽宁省北票市的热河組（即四合屯和李八郎沟等白垩纪时期的沉积岩）中发现，並在此地層中廣泛發現了許多該鳥類的化石標本[10] 。",
    "剑桥大学1948年才开始授予女性学位。",
    "太阳氢丰度超出百分之九十，正值壮年。",
    "一个地球大小 赤热的铁球冷却到室温 需要 75000年？。",
    "连翘，香港俗稱一串金，是木犀科连翘属植物。為落叶灌木，高2~4m。花期3~5月；果期7~9月。",
    "紫荆，又名裸枝树（中国主要植物图说）、紫珠（本草拾遗），为豆科紫荆属的植物。[2]落叶乔木，高達15米，胸徑50厘米，但一般作為灌木或小喬木栽植，有變種垂花紫荆花，大為粉红色；黄山紫荆花為粉红或乳白色。花期4月，葉前開放；果10月成熟。北京的清华大学校花是紫荆花和丁香花，但通常也仅指紫荆花，这是由于紫荆花与校旗、校色的颜色一致，也是由于紫荆花在4月校庆日前后盛开。",
    "樱花是蔷薇科李屬樱亚属（學名：Prunus subgen. Cerasus）植物的统称，尤其指花朵美丽供观赏的种类。",
    "夜翼龍（學名：Nyctosaurus）是翼手龍亞目的一屬，因牠們異常長的大型頭頂冠飾而著名，掠海翼龍也有類似的冠飾。少數科學家假設這些類似鹿角的冠飾，可能用來支撐肉質帆狀物，當掠過海面捕食魚類時，帆狀物可用來穩定。牠們的化石在美國中西部發現，這個地區在白堊紀時是廣闊的淺海。夜翼龍的早期化石並未透露出複雜的冠飾，只有發現類似無齒翼龍的較小結構。",
    "GZK極限，是以提出者Greisen、Zatsepin、Kuzmin三人姓氏之首字母為名的理論上限，描述源自遠處的宇宙射線應有的理論上限值。超過閾值5e19 電子伏特。超高能量宇宙射線，又被戲稱為「我的天啊粒子」（Oh-My-God particle）",
    "氦核的质量比四个质子之和少0.8%。",
    "C#是微软推出的一种基于.NET框架的、面向对象的高级编程语言。C#是一种由C和C++衍生出来的面向对象的编程语言。它在继承C和C++强大功能的同时去掉了一些它们的复杂特性，使其成为C语言家族中的一种高效强大的编程语言",
    "电弱交互作用理论和强交互作用理论建立以后，由于他们都由相似的规范场论来描述，理论物理学家随即试图统一它们。哈沃德·乔吉和谢尔登·格拉肖于1974年提出了最早的SU(5)大统一理论。这是第一个统一了电弱相互作用和强相互作用的理论。值得指出的是，由于量子引力理论尚存在困难，目前一般称为“大统一理论”的理论都与引力无关。",
    "先农坛建筑群是明清两代皇帝祭祀先农诸神和太岁诸神和举行亲耕的地方，位于北京市西城区[註 1]南中轴线西侧，与天坛东西相对，遥相呼应。",
    "卡尔维诺后期的幻想作品有：《宇宙连环画》（1965年出版）对宇宙创造和进化的意识流叙述；稍后的《看不见的城市》（1972年出版）、《命運交織的城堡》（1973年出版）和《如果在冬夜，一个旅人》（又译《寒冬夜行人》，1979年出版），卡尔维诺使用了游戏般创新的结构和多变的视点，目的是考察机会、巧合和变化的本质。《文学的作用》（1980年出版）是他为Il Menabò杂志写的文章的结集。",
    "風神翼龍屬（屬名：）又名披羽蛇翼龍、羽蛇神翼龍，是種翼手龍類，生存於晚白堊紀（馬斯垂克階）的美國南部，約6800萬年前到6600萬年前，是目前已知最大的飛行動物之一，翼长超过10米，站在地面上时和现代长颈鹿同高。這種翼龍屬於神龍翼龍科，牠們是先進而缺乏牙齒的翼龍類。屬名的來源是阿茲特克文明裡的披羽蛇神克察尔科亚特尔（Quetzalcoatl）。",
    "估計地球所吸收的太陽能有1%到3%轉化為風能，總量相當於地球上所有植物通過光合作用吸收太陽能轉化為化學能的50到100倍。上了高空就會發現風的能量，那兒有時速超過160公里（100英哩）的強風。這些風量最後和地表及大氣間摩擦，而以各種熱能方式釋放。",
    "1919年，德國物理學家貝茲認為，不管如何設計渦輪，風機最多只能提取風中59%的能量，此稱為貝茲極限定律（Betz Limit）。現今正在運作的風力發電機所能達到的極限約為40%。[18]大多數風力發電機實際效率範圍從20%到40%[19]。風力發電的細長（高展弦比）的風機葉片，在低速有比較高效率。",
    "垂直軸風力發電機（英語：，VAWT）是風力發電機的一種類型，其主轉子軸與風向垂直，機電部件位於風力發電機的底部。這種設計可讓發電機和變速箱靠近地面放置，以便於維護和修理。 垂直軸風力發電機不需要正對風向[1][2]，因此不需要有感應與對準風向的機制。以同樣環境、同樣額定功率產品比較，一般「垂直軸風力發電機」發電效率低於「水平軸風力發電機」，因此大部分大型商用系統採用「水平軸風力發電機」。",
    "JavaScript是一门基于原型、函数先行的语言[9]，是一门多范式的语言，它支持面向对象程式設計，命令式编程，以及函数式编程。它提供语法来操控文本、数组、日期以及正则表达式等，不支持I/O，比如网络、存储和图形等，但这些都可以由它的宿主环境提供支持。",
    "Django是一个开放源代码的Web应用框架，由Python写成。采用了MVT的软件设计模式，即模型（Model），视图（View）和模板（Template）。它在开发初期用于管理劳伦斯出版集团旗下的一些以新闻为主的网站。Django于2005年7月在BSD许可证下发布，它的名字来源于比利时的吉普赛爵士吉他手Django Reinhardt。",
    "OpenGL（英語：，譯名：開放圖形庫或者“開放式圖形庫”）是用於渲染2D、3D矢量圖形的跨語言、跨平台的應用程序編程接口（API）。這個接口由近350個不同的函數调用組成，用來從簡單的圖形位元繪製複雜的三維景象。而另一种程式介面系统是仅用于Microsoft Windows上的Direct3D。OpenGL常用於CAD、虛擬實境、科學視覺化程式和電子遊戲開發。",
    "DirectX（，縮寫：）是由微软公司建立的一系列專為多媒體以及遊戲開發的應用程式介面。旗下包含Direct3D、Direct2D、DirectCompute等等多個不同用途的子部份，因為這一系列API皆以Direct字樣開頭，所以DirectX（只要把X字母替換為任何一個特定API的名字）就成為這一巨大的API系列的統稱。目前最新版本為DirectX 12，隨附於Windows 10作業系統之上。",
    "Unity是由Unity Technologies研发的跨平台2D/3D遊戲引擎，可用於開發Windows、MacOS及Linux平台的單機遊戲，PlayStation、Xbox、Wii、任天堂3DS和Switch 等游戏主机平台的视频游戏，以及iOS、Android等移动设备的遊戲。除可以用于研发电子游戏之外，Unity还广泛用作建筑可视化、实时三维动画等类型互动内容的综合型创作工具。Unity最初于2005年在苹果公司的全球开发者大会上对外公布并开放使用，当时只是一款面向Mac OS X平台的游戏引擎。",
    "Three.js由Ricardo Cabello在2010四月于GitHub首次发布。Three.js允许使用JavaScript创建网页中的GPU加速的3D动画元素，而不是使用特定的浏览器插件。[3][4]这归功于WebGL的出现。",
    "JavaScript函式庫是指用於Javascript語言開發的函式庫，多應用在網頁DOM、AJAX、CSS的領域，可以幫助網頁開發者用更快速地撰寫網頁，例如有些JavaScript函式庫提供精簡化的DOM操作函數或解決跨瀏覽器問題等。",
    "jQuery是一套跨瀏覽器的JavaScript函式庫，简化HTML與JavaScript之間的操作。[1]由約翰·雷西格（）在2006年1月的BarCamp NYC上釋出第一個版本。目前由Dave Methvin领导的团队进行开发。全球前10,000个访问最高的网站中，有65%使用了jQuery，是目前最受歡迎的JavaScript函式庫[2][3]。",
    "SQL（i/ˈɛs kjuː ˈɛl/[4]或i/ˈsiːkwəl/[5]，Structured Query Language:结构化查询语言[6][7][8][9]）是一种特定目的程式语言，用于管理关系数据库管理系统（RDBMS），或在关系流数据管理系统（RDSMS）中进行流处理。",
    "国际热核聚变实验反应堆（英語：，缩写：）是国际核聚变研究和巨型工程，将成为世界上最大的磁约束等离子体物理学实验，这是目前正在建设世界上最大的实验性托卡马克核聚变反应堆，邻近于法国南部的卡达拉舍设施[1]。ITER工程的目标是从等离子体物理实验研究，到大规模电力生产的核聚变发电厂的期待已久的转变。“ITER”在拉丁文意为“道路”，因此这个实验的缩写“ITER”也意味着和平利用核聚变能源之路。",
    "等離子體是宇宙重子物質最常見的形態，其中大部分存在於稀薄的星系際空間（特別是星系團內介質）和恆星之中。[3]地球大氣離地表300公里的電離層也是處於等離子態，電離層是地球大氣較外層的氣體吸收了太陽輻射能量，發生光致游離而形成。",
    "春季是一年四季之第一季。按照公历，北半球的春季为3月、4月和5月；南半球的春季为9月、10月和11月。此外，在台灣等地区，春季的开始是立春（2月3日至5日之间），春季的结束是立夏（5月5日至7日之间）。在一些地區，春季被認為從春分开始，到夏至结束。",
    "地磁场呈现出两极强，赤道弱的分布，形成了一个天然磁镜。外层空间的带电粒子进入地磁场后，将在地磁场的约束下绕地球磁感线做螺旋运动，并在两极间反射，形成一个电磁辐射带。1958年物理学家范·阿伦通过分析人造卫星收集的数据，发现了电磁辐射带的存在，于是该电磁辐射带又被称为范·阿伦辐射带。有时范·阿伦辐射带中的带电粒子因空间磁场的变化而在两极附近进入地球大气层，引起极光。",
    "磁镜是由两个电流方向相同的线圈以中轴重合的方式排列形成的一种磁场构形，磁场在每个线圈的中心处最强，在线圈中间最弱。带电粒子在磁镜场中运动时，粒子的磁矩是一定的，在磁场强的地方，粒子垂直于磁场方向的速度分量变大，由于磁场不对粒子做功，粒子的总动能不变，因此平行于磁场方向的速度分量会相应变小。动能小的粒子会完全失去平行方向的速度，这样就会被磁场反射，朝着相反的方向运动，当运动到另外一侧时，又会被再次反射，这样粒子就会在两个线圈之间来回运动，如同光在两面镜子之间反射，因此得名磁镜。",
    "地磁場是源自於地球內部，並延伸到太空的磁場。磁場在地表上的強度在25－65微特斯拉（即0.25至0.65高斯）之間。[3]粗略地說，地磁場是一個與地球自轉軸呈11°夾角的磁偶極子，相當於在地球中心放置了一個傾斜了的磁棒。目前的地磁北極位於北半球的格陵蘭附近，實際上它是地磁場的南極，而地磁南極則是地磁場的北極。地核向外散發熱量時，引起外核中熔融鐵的對流運動，進而產生電流，地磁場即是此電流所致。這種形成天體磁場的原理，稱為發電機理論。",
    "地磁場能夠使大部分太陽風偏轉方向。沒有了地磁場，太陽風中的帶電粒子就會剝去阻擋紫外線的臭氧層，生物體也就會受到紫外線的侵害。[4]其中一個大氣剝離原理是，氣體粒子被困在一個磁場泡之中，磁場泡再被太陽風「吹走」。[5]從火星大氣二氧化碳因太陽風流失的速度推算，可推斷火星大氣層所剩無幾，是由它磁場的喪失直接導致的。",
    "2010年国际半导体技术发展路线图的更新增长已经在2013年年底放缓[4]；又比如说英特尔在22纳米跟14纳米的CPU製程上已经放慢了技术更新的脚步，之后的时间里，晶体管数量密度预计只会每三年增加一倍。",
    "Python（英國發音：/ˈpaɪθən/ 美國發音：/ˈpaɪθɑːn/）是一种广泛使用的解释型、高级编程、通用型编程语言，由吉多·范罗苏姆创造，第一版发布于1991年。",
    "可缩放矢量图形（英語:SVG）是一种基于可扩展标记语言（XML），用于描述二维矢量图形的图形格式。SVG由W3C制定，是一个开放标准。",
    "金陵四十八景是指南京有代表性的四十八个景点。“金陵四十八景”的说法最早起于明代，清初高岑曾绘《金陵四十八景图》。金陵四十八景目前仅存半余，近些年又有新金陵四十八景的评选。",
    "A*搜索算法（A* search algorithm）是一種在圖形平面上，有多個節點的路徑，求出最低通過成本的演算法。常用於遊戲中的NPC的移動計算，或网络游戏的BOT的移動計算上。该算法综合了最良優先搜索和Dijkstra算法的优点：在进行启发式搜索提高算法效率的同时，可以保证找到一条最优路径（基于评估函数）。",
    "數學上，切比雪夫距离（Chebyshev distance）或是L∞度量[1]是向量空間中的一種度量，二個點之間的距離定義為其各座標數值差的最大值[2]。以(x1,y1)和(x2,y2)二點為例，其切比雪夫距离為max(|x2-x1|,|y2-y1|)。切比雪夫距离得名自俄羅斯數學家切比雪夫。",
    "戴克斯特拉算法（英語：），又译迪杰斯特拉算法，亦可不音譯而稱爲Dijkstra算法[6]，是由荷兰计算机科学家艾茲赫尔·戴克斯特拉在1956年发现的算法，并于3年后在期刊上发表[7][8][9]。戴克斯特拉算法使用类似廣度优先搜索的方法解决赋权图[9]的单源最短路径问题",
    "图的遍历问题分为四类：1.遍历完所有的边而不能有重复，即所謂“欧拉路径问题”（又名一笔画问题）；2.遍历完所有的顶点而没有重复，即所谓“哈密頓路径问题”。3.遍历完所有的边而可以有重复，即所谓“中国邮递员问题”；4.遍历完所有的顶点而可以重复，即所谓“旅行推销员问题”。对于第一和第三类问题已经得到了完满的解决，而第二和第四类问题则只得到了部分解决。第一类问题就是研究所谓的欧拉图的性质，而第二类问题则是研究所谓的哈密顿图的性质。",
    "邮递员问题（也称邮路问题，Route Inspection Problem，或中国邮路问题,China Route Inspection Problem，或中国邮递员问题Chinese Postman Problem）是一个图论问题。此問題為在一個連通的無向圖中找到一最短的封閉路徑，且此路徑需通過所有邊至少一次。",
    "旅行商问题（最短路径问题）（英語：, TSP）是这样一个问题：给定一系列城市和每对城市之间的距离，求解访问每一座城市一次并回到起始城市的最短回路。它是组合优化中的一个NP困难问题，在运筹学和理论计算机科学中非常重要。",
    "贝尔曼-福特算法（英語：），求解单源最短路径问题的一种算法，由理查德·貝尔曼（Richard Bellman） 和 萊斯特·福特 创立的。有时候这种算法也被称为 Moore-Bellman-Ford 算法，因为 Edward F. Moore 也为这个算法的发展做出了贡献。它的原理是对图进行∣V∣−1次松弛操作，得到所有可能的最短路径。其优于迪科斯彻算法的方面是边的权值可以为负数、实现简单，缺点是时间复杂度过高，高达O ( | V | | E | ) .但算法可以进行若干种优化，提高了效率。",
    "双向搜索算法是一种图的遍历算法，用于在有向图中搜索从一个顶点到另一个顶点的最短路径。算法同时运行两个搜索：一个从初始状态正向搜索，另一个从目标状态反向搜索，当两者在中间汇合时搜索停止。在很多情况下该算法更快，假设搜索一棵分支因子b的树，初始节点到目标节点的距离为d，该算法的正向和反向搜索复杂度都是O(bd/2) (大O符号)，两者相加后远远小于普通的单项搜索算法（复杂度为O(bd)）",
    "普里姆算法（Prim），图论中的一种算法，可在加权连通图里搜索最小生成树。意即由此算法搜索到的边子集所构成的树中，不但包括了连通图里的所有顶点，且其所有边的权值之和亦为最小。",
    "最短路径快速算法（英語：），国际上一般认为是队列优化的Bellman-Ford 算法，是一个用于求解有向带权图单源最短路径的算法。这一算法被认为在随机的稀疏图上表现出色，并且适用于带有负边权的图。[1] 其基本思路与 Bellman-Ford 算法相同，即每个节点都被用作用于松弛其相邻节点的备选节点。但相较于 Bellman-Ford 算法，SPFA算法的改进之处在于它并不盲目地尝试所有节点，而是维护一个备选的节点队列，并且仅有节点被松弛后才会放入队列中。整个流程不断重复直至没有节点可以被松弛。",
    "在概率论和统计学中，馬可夫決策過程（英語：，縮寫為MDPs）提供了一個數學架構模型，用於面對部份隨機，部份可由決策者控制的狀態下，如何進行決策，以俄罗斯数学家安德雷·马尔可夫的名字命名，是马尔科夫链的一种扩展。",
    "冥王星相对较小，仅有月球质量的六分之一、月球体积的三分之一。冥王星的轨道离心率及倾角皆较高，近日点为30天文单位（44亿公里），远日点为49天文单位（74亿公里）。冥王星因此周期性进入海王星轨道内侧。海王星与冥王星因相互的轨道共振而不会碰撞。在冥王星距太阳的平均距离上阳光需要5.5小时到达冥王星。",
    "海王星是太陽系八大行星中距离太阳最遠的,海王星的質量大約是地球的17倍，而性質極為類似的天王星密度較低，質量大約是地球的14倍。海王星以羅馬神話中的尼普顿（Neptunus）命名，因為尼普顿是海神王，所以中文譯為海王星。天文學的符號（♆，Unicode編碼U+2646），是希臘神話的海神波塞頓使用的三叉戟.作爲一個冰巨行星，海王星的大氣層以氫和氦為主，還有微量的甲烷。在大氣層中的甲烷，只是使行星呈現藍色的一部分原因。因為海王星的藍色比有同樣份量的天王星更為鮮豔，因此應該還有其他成分對海王星明顯的顏色有所貢獻。[7] 海王星有太陽系最強烈的風，測量到的風速高達每小時2,100公里。",
    "天王星是從太陽系由内向外的第七顆行星。与在古代就为人们所知的五顆行星（水星、金星、火星、木星、土星）相比，天王星的亮度也是肉眼可見的。天王星大氣的主要成分是氫和氦，還包含較高比例的由水、氨、甲烷等結成的「冰」，與可以探测到的碳氫化合物。天王星是太陽系內大气层最冷的行星，最低溫度只有49K（−224℃）。其外部的大气层具有複杂的雲層結構，水在最低的雲層內，而甲烷組成最高處的雲層。天王星的環系統在行星中非常獨特，因為它的自轉軸斜向一邊，幾乎就躺在公轉太陽的軌道平面上，因而南極和北極也躺在其他行星的赤道位置上。[13]從地球看，天王星的環像是環繞著標靶的圓環，它的衛星則像環繞著鐘的指針",
    "水星是太陽系的八大行星中最小和最靠近太陽的行星，但有著八大行星中最大的離心率 [註 1]，軌道週期是87.969 地球日。由于大氣層极为稀薄，无法有效保存热量，水星表面昼夜温差极大，为太阳系行星之最。白天时赤道地區温度可达432°C，夜间可降至-172°C。極區气温則終年維持在-172°C以下。水星表面充滿了大大小小的坑穴，外觀看起來與月球和其他衛星相似.",
    "金星（英語、拉丁語：Venus，天文符號：♀），它沒有天然的衛星。它的西文名稱源自羅馬神話的愛與美的女神，维纳斯（Venus），古希腊人称为阿佛洛狄忒，也是希腊神话中爱与美的女神。金星的天文符号用维纳斯的梳妆镜来表示。 它在夜空中的亮度僅次於月球，是第二亮的天然天體，視星等可以達到 -4.7等，足以照射出影子[6]。金星是一顆類地行星，因為它的大小、質量、體積與到太陽的距離，均與地球相似，所以經常被稱為地球的姊妹星。然而，它在其它方面則明顯的與地球不同。它有著四顆類地行星中最濃厚的大氣層，其中超過96%都是二氧化碳，金星表面的大氣壓力是地球的92倍。其表面的平均溫度高達735 K（462 °C；863 °F），是太陽系中最熱的行星，比最靠近太陽的水星還要熱。金星沒有將碳吸收進入岩石的碳循環，似乎也沒有任何有機生物來吸收生物量的碳。金星被一層高反射、不透明的硫酸雲覆蓋著，阻擋了來自太空中，可能抵達表面的可見光。它在過去可能擁有海洋，並且外觀與地球極為相似[7][8]，但是隨著失控的溫室效應導致溫度上升而全部蒸發掉了[9]。水最有可能因為缺乏行星磁場而受到光致蛻變分解成氫和氧，而自由氫一直被太陽風掃進星際空間 [10]。金星表面是乾燥的荒漠景觀，點綴著定期被火山刷新的岩石。",
    "火星（拉丁語：；天文符號：♂），火星的直徑約為地球的一半，自轉軸傾角、自轉週期則與地球相當，但繞太陽公轉周期是地球的兩倍[3]。韓佔火星距離地球最近在1億公里以內（最遠達4億公里，探測器需飛行約7個月抵達韓佔火星）。火星大氣以二氧化碳為主，既稀薄又寒冷。[4][5]是因為韓佔火星在視覺上呈現為橘紅色是因為地表廣泛普遍的分佈著氧化鐵的造成的，它使火星呈現出一种红色的外觀火星地表沙丘、礫石遍布且沒有穩定的液態水。火星有兩個天然衛星：火衛一和火衛二，形狀不規則，可能是捕獲的小行星。",

    "木星是距離太陽第五近的行星，也是太陽系中體積最大的行星，目前已知有79顆衛星。木星是顆巨行星，質量是太陽的千分之一，但卻是太陽系其他行星質量總和的2.5倍。太陽系的行星中，木星和土星是氣體巨星（天王星和海王星是冰巨星）。木星的主要成分是氫，但只佔十分之一分子數量的氦，卻佔了總質量的四分之一；它可能有岩石的核心和重元素[16]，但是像其他的巨行星一樣，木星沒有可以明確界定的固體表面。由於快速地自轉，木星的外觀呈現扁球體（赤道附近有輕微但明顯可見的凸起）。外面的大氣層依緯度成不同的區與帶，在彼此的交界處有湍流和風暴作用著。最顯著的例子就是大紅斑，已知是在17世紀第一次被望遠鏡見到，持續至今未曾停歇過的巨大風暴。環繞著木星的還有微弱的行星環和強大的磁層，包括4顆1610年發現的伽利略衛星，至2019年12月已經發現79顆衛星。木衛三是其中最大的一顆，其直徑大於行星中的水星.",
    "土星体积則僅次於木星。並與木星同属氣體（類木）巨星。土星的天文学符號是代表农神萨图尔努斯的鐮刀（Unicode: ♄）。土星主要由氫組成，還有少量的氦與微痕元素[11]，內部的核心包括岩石和冰，外圍由數層金屬氫和氣體包覆著。土星的風速高達1,800公里/時，風速明顯比木星快。土星的行星磁場強度介於地球和更強的木星之間。土星有一個顯著的環系統，主要的成分是冰的微粒和較少數的岩石殘骸以及塵土。已經確認的土星的衛星有82顆，是八大行星中最多。其中，土卫六是土星系統中最大和太陽系中第二大的衛星（半徑2575KM，太陽系最大的衞星是木星的木衛三，半徑2634KM），比行星中的水星還要大；並且土卫六是唯一擁有明顯大氣層的衛星[12]。還有，土星距離地球13億千米；地球一天等於23小時56分4.1秒，土星一天等於10小時42分0秒，是地球一天的大約九分之四。",
    "柯伊伯帶（英語：），又稱作倫納德-柯伊伯带，另譯柯伯帶、，是位於太陽系的海王星軌道（距離太陽約30天文单位）外側，在黃道面附近的天體密集圓盤狀區域[1]。柯伊伯带的假說最先由美国天文學家弗雷德里克·倫納德提出，十几年後杰拉德·柯伊伯證實了该观点。柯伊伯帶类似于小行星带，但範圍大得多，它比小行星帶宽20倍且重20至200倍[2][3]。如同主小行星帶，它主要包含小天体或太阳系形成的遗迹。虽然大多数小行星主要是岩石和金属构成的，但大部分柯伊伯带天体在很大程度上由冷冻的挥发成分（称为“冰”），如甲烷、氨和水组成。柯伊伯带至少有三顆矮行星：冥王星、妊神星和鸟神星。一些太阳系中的衛星，如海王星的海卫一和土星的土卫九，也被认为起源于该区域[4][5]",
    "React（有时叫React.js或ReactJS），是一个为数据提供渲染为HTML视图的开源JavaScript 库。React视图通常采用包含以自定义HTML标记规定的其他组件的组件渲染。React为程序员提供了一种子组件不能直接影响外层组件（data flows down）的模型，数据改变时对HTML文档的有效更新，和现代单页应用中组件之间干净的分离。",
    "Vue.js（/vjuː/，或简称为Vue）是一个用于创建用户界面的开源JavaScript框架，也是一个创建单页应用的Web应用框架[4]。 2016年一项针对JavaScript的调查表明，Vue有着89%的开发者满意度。[5]在GitHub上，该项目平均每天能收获95颗星，[5][6]为Github有史以来星标数第3多的项目。[7]",
    "React Native是一個臉書研發的開放源碼的應用程式架构。[1]React Native基於React.js，目的是讓開發者可以利用JavaScript和React.js的宣告式編程模式開發出在多平台上運作的程式。[5]React Native也可以使用React.js相容的Node.js套件，比如Redux。[6]",
    "在天文學中，光度（luminosity）是物體每單位時間內輻射出的總能量，即辐射通量，在國際單位制是瓦特（Watt），在厘米克秒制中是“爾格/秒”，天文学常以太陽光度來表示。也就是以太陽的輻射通量為一個單位來表示。太陽的光度是3.846×1026瓦特。光度以可指辐射通量的谱分布（spectral luminosity），单位为瓦特/赫兹（W/Hz）或瓦特/纳米（W/nm）。[2]:111",
    "纽约的交通系统还包括全美洲最长的悬索桥、同时也是世界最长悬索桥之一的韦拉札诺海峡大桥[378][379]，世界第一条机械通风的行车隧道荷兰隧道[380]，超过12,000辆黄色出租车[381]，连接罗斯福岛和曼哈顿岛的罗斯福岛空中缆车，以及将曼哈顿与城内城外诸多地点连接起来的渡轮系统。",
    "自由女神像（英語：）又名自由照耀世界（英語：，法語：），是位于美国纽约港自由島的巨型古典主义塑像，由弗里德利·奥古斯特·巴特勒迪设计，居斯塔夫·埃菲尔建造，1886年10月28日落成，是法国人民送給美國人民的禮物。塑像人物是身穿长袍的女子，代表罗马神话中的自主神，她右手高举火炬，左手的册子上用罗马数字写有美国独立宣言签署日期：“”（1776年7月4日），脚下还有断裂的锁链。这座塑像是自由和美国的象征，也是对外来移民的欢迎信号.",
    "彩虹大橋全長798米，橋跨570米。橋體構造分為上下2層，上層由首都高速11號台場線使用，下層的中央為百合鷗號路軌，兩側為一般道路（臨港道路海岸青海線），包括雙向四線車道及人行道。如需攜帶自行車過橋，必須裝入攜車袋、或放置在管理單位出租的專用臺車上[1]。兩座支撐大橋的橋塔使用白色設計，令橋梁整體與附近的景色和諧共融。在懸索橋面的纜上置有紅、白、綠3色燈泡，採用日間收集得來的太陽能作能源，在晚上點綴彩虹橋。彩虹大橋的景色令台場成為東京新興的觀光景點，而彩虹大橋本身亦成為數部日本電視劇的場景之一。",
    "桥，按形式和构造主要分为梁式桥、桁架桥、拱式桥、斜張桥、悬索桥、鋼架桥、组合桥。",
    "位于中国湖北省的三峡水电站，是世界上最大的水电站，总装机容量为22.50 GW；位于巴西和巴拉圭的伊泰普水电站是世界第二大水电站，装机容量为14.00 GW。不过，伊泰普水电站所处的巴拉那河水量丰沛且季节分布相对均衡，几乎可以全年满负荷发电[1]；而三峡水电站则每年都会经历约6个月的枯水期，从而限制了其发电量。",
    "长江，古稱揚子江，是亚洲第一长河和世界第三长河，也是世界上完全在一国境内的最长河流，全长6300公里，干流发源于青藏高原东部唐古拉山脉各拉丹冬峰，穿越中国西南（青海、西藏、云南、四川、重庆）、中部（湖北、湖南、江西）、东部（安徽、江苏），在上海市汇入东海。长江流域覆盖中国大陆五分之一陆地面积，养育中国大陆三分之一的人口。长江经济带也是中国最大的经济带。千年來多次江淮水災，如1998年的九八抗洪、2020年5月下旬至今的中国南方水灾。",
    "海南岛属海洋性热带季风气候，地处热带北缘，占中国热带土地面积的40%，光照充足，年日照时数大于2,000小时，活动积温达8,400至9,200摄氏度；夏热冬暖，最热月均温在25至29摄氏度，最冷月均温大于16摄氏度。極端情況下，才於明朝年間降雪[4]。降水方面，受夏季季风影响，岛上降水从东向西减少；受地形影响，降水廣泛集中於東部，西南部降水少，因此位於島內西南部有個著名的莺歌海盐场。",
    "核子動力潛艇，簡稱核子潛艇、核潛艇，是以核反應爐為動力來源的潛艇。由於這種潛艇的生產與操作成本，加上相關設備的體積與重量，採用這種動力來源的潛艇幾乎都是軍事用途，僅有少數核子潛艇是用於科學研究用途。",
    "五十型 Mark L 血邊盔甲 Bleeding Edge。於《復仇者聯盟3：無限之戰》和《復仇者聯盟4：終局之戰》登場，東尼首件“奈米科技”製作的裝甲，歷代裝甲中著裝速度最快，外裝於胸口中間的弧形反應爐為基礎，延伸骨架，而外殼則像碎片般組合成一體化的裝甲，動漫展釋出的海報證實此裝甲以正史漫畫「Model-Prime Armor」為範本改良[2]，留有前代裝甲的數個小燈，且擁有視戰鬥需求變形的能力，在電影中曾變形出四個可延伸為翅膀的飛行穩定器與雙腳組合而成的重型飛行噴射器，發射各種導彈，以及全身部位的多重變化型裝備(雷射手刀、一般手刀、大小盾牌、雷射加農砲、雙臂雙腳的吸附装置、可作修復破洞的奈米噴霧器、重型拳套、多重激光束流拳套、奈米自我治療、甚至是有一定自主製造設備如手掌束縛器等的能力)，可於太空中活動，最後在與薩諾斯交戰時，此裝甲被薩諾斯徒手輕鬆撕碎，奈米分子並在不斷變形中被消耗殆盡而全毀，最後變出來的手刀更被其拆走，把東尼本人刺成重傷，但東尼最後使用此完全損毀的戰甲為自己進行了緊急治療。《復仇者聯盟4：終局之戰》中，逃出泰坦星的東尼以為自己會在太空中坐以待斃而利用該裝甲殘餘的奈米物質變出一個不完整的頭盔向小辣椒錄下遺言，在被驚奇隊長救回地球後此裝甲被回收。",
    "叶绿体膜上有两套光合作用系统（光系统）：光合作用系统一和光合作用系统二（光合作用系统一比光合作用系统二要原始，但电子传递先在光合作用系统二开始，一、二的命名则是按其发现顺序）。在光照条件下，两系统分别吸收700nm和680nm波长的光子作为能量，将从水分子在光解过程中得到的电子不断传递，该过程还有细胞色素b6/f的参与。电子最后被传递给辅酶NADP，通过铁氧还蛋白-NADP还原酶将NADP还原为NADPH。而水光解所得的氢离子则顺浓度差通过类囊体膜上的蛋白质复合体而从类囊体内向外移动到基质，势能降低。其间的势能用于合成ATP，以供碳反应所用。此时势能已降低的氢离子则被氢载体NADP带走，一分子NADP可携带两个氢离子。这个NADPH于氢离子则在碳反应中充当还原剂的作用。",
    "紫色地球假說（Purple Earth hypothesis）是一個天文生物學上的假說。該假說的內容是地球上的早期生命形式是基於视黄醛，而非葉綠素的形式。今日基於视黄醛的微生物例如可直接以太陽光為能量來源的微生物嗜鹽菌[1]。",
    "光合作用的第一步是光能被叶绿素(Chlorophyll)吸收并将叶绿素离子化。产生的化学能被暂时储存在三磷酸腺苷(ATP)中，并最终将二氧化碳和水转化为氧氣和碳水化合物。叶绿素a和叶绿素b的吸收光谱较为接近，两者在蓝紫光（430~480nm）和红光区（640~660nm）都有一吸收高峰，叶绿素ab对绿光的吸收很少，所以呈绿色",
    "时针式喷灌机是一种移动式喷灌机，喷灌头安装在有轮子支撑的电镀钢管或铝管上，围绕一个中心旋转，从中心枢轴输送水，整个喷灌机喷灌面积形成一个圆。这种喷灌机械在美国使用的很普遍。",
    "溫室，又稱玻璃溫室或暖房，是一座專用作種植植物的建築物。它的建造物料是玻璃或塑料，溫室會因太陽發出的電磁輻射而加熱，使溫室內的植物、泥土、空氣等變暖，因為可以提早種植也比較不受氣候影響，在亞熱帶和溫帶國家很流行，在乾燥地區還有防止水份過度蒸發的效果。玻璃被用作為溫室的建造物料是因為它是不同光學頻譜的其中一種可選性的傳輸媒介，而它的另一個作用是可以集中抓住能量，使溫室內的植物、空氣變暖。這些熱空氣會下沉於地面和防止上升和流動，因此如果在溫室屋頂上只打開一個小窗口，溫室溫度就會顯著地下降，這個原理就仿如一個基本的自動排氣冷卻系統。溫室的興建就是可以抓住電磁輻射和防止對流現象。因此，用于温室的玻璃作为气流屏障，其效果是捕获温室内的能量。靠近地面被加热的空气, 就被防止无限地上升和流失。虽然会发生由于通过玻璃和其他建筑材料热传导的热损失，温室内的净能量（及因此温度）仍是增加的",
    "為了缩短由垃圾回收造成的停顿，V8使用stop-the-world, generational, accurate的垃圾回收器[5]。在执行回收之时会暫時中断程序的执行，而且只处理物件堆疊。還會收集內存內所有物件的指標，可以避免内存溢位的情况。V8組譯器是基於Strongtalk組譯器[6]。",
    "植物之所以称为食物链的生产者，是因为它们能够透过光合作用利用无机物生产有机物并且贮存能量，其能量轉換效率約為6%[2]。通过食用，食物链的消费者可以吸收到植物所贮存的能量，效率为10%左右。對大多數生物來説，這個過程是賴以生存的關鍵。而地球上的碳氧循环，光合作用是其中最重要的一环。",
    "由于重子的静止质量比电子大三个數量级以上，即使在TeV级的质子同步加速器中，因同步辐射造成的能量损失依然是不重要的。而对MeV级的电子同步加速器，同步辐射已十分显著。同步辐射使粒子在横向和纵向的振荡阻尼，并与量子起伏达到平衡态。这也是为什么电子同步加速器中束流易于稳定和束流发射度较小且不依赖于入射束性能的原因。",
    "仿星器（Stellarator）因模擬恆星內部持續不斷的核聚變反應而得名，是以磁場約束核聚變等離子體，穩定運行提供動力的實驗裝置。它是最早期的受控核聚变装置中，最初美國物理學家萊曼·史匹哲在1950年發明，並且在第二年建造在后来的普林斯頓等離子體物理實驗室。这个名字指的是利用恒星对象太阳动力源的可能性。",
    "馬鈴薯（学名：），属茄科茄属多年生草本植物，块茎可供食用，是全球第四大重要的粮食作物，仅次于稻米、玉米和小麦。原產於南美洲秘魯與波利維亞境內的安地斯山脈。[1]馬鈴薯的人工栽培最早可追溯到大约公元前8000年到公元前5000年的秘鲁南部地区。[2][3]大航海時代馬鈴薯被裝船帶回歐亞大陸的菜單當中，現在是歐美地區許多國家的主食，為世界第四大主食作物",
    "金門大橋（英語：）是美國三藩市的地標。它跨越聯接舊金山灣和太平洋的金門海峽，南端連接舊金山的北端，北端接通加州的馬林縣。金門大橋的橋墩跨距長1280.2米，建成时曾是世界上跨距最大的悬索桥，寬度27.5米，雙向共6條行車線，橋身呈國際橘（international orange），金門大橋擁有世界第四高的橋塔，高達227.4米，全橋總長度是2737.4米。",
    "什刹海（汉语拼音：Shíchàhǎi）是北京北部的三个湖，分别是前海、后海、西海，旧时俗称河沿。什刹海因周围有十座寺庙而得名，包括广化寺、什刹海火神庙、护国寺、保安寺、真武庙、白马关帝庙、佑圣寺、万宁寺、石湖寺、万严寺。后海附近的望海楼 什刹海旁是北京著名的酒吧区,银锭桥.除此以外什刹海附近还有广福观，大藏龙华寺等寺庙。",
    "^  老大的老大（義大利語：，義大利語：[ˈkaːpo dei ˈkaːpi]）或是所有黑幫派系老大的老大（義大利語：，義大利語：[ˈkaːpo di ˈtutti i ˈkaːpi]）或是教父（義大利語：）",
    "天狼星（Bd：α CMa）是夜空中最亮的恆星，其視星等為-1.46，幾乎為第二亮恆星老人星的兩倍。它的英文名稱為Sirius，讀法為/sɪɹiəs/，源自古希臘語的。[14]天狼星根據拜耳命名法的名稱為大犬座α星。我們肉眼以爲是一顆恆星的天狼星，實際上是一個聯星系統，其中包括一顆光譜型A1V的白主序星和另一顆光譜型DA2的暗白矮星伴星天狼星B（Bd：α CMa B）。天狼星如此之亮除了因爲其原本就很高的光度以外，還因爲它距離太陽很近。天狼星距離地球約2.6秒差距（約8.6光年），並是最近的恆星之一。天狼星A的質量為太陽的兩倍，而絕對星等為1.42等。它比太陽亮25倍[6]，但光度明顯比其它亮星較暗，如對比老人星或參宿七。此雙星系統有約二億至三億年歷史，[6]而初期是由兩顆藍色的亮星組成。更高質量的天狼星B耗盡了能源，成爲一顆紅巨星，然後又漸漸削去外層，約在一億二千萬年前坍塌成爲今天的白矮星狀態。",
    "风是大规模的气体流动现象。在地球上，风是由空气的大范围运动形成的。在外层空间，太阳风是气体或带电粒子从太阳到太空的流动，而行星风则是星球大气层的轻分子经释气作用飘散至太空。风通常可按空间尺度、速度、力度、肇因、产生区域及其影响来划分。在太阳系的海王星和木星上，曾观测到迄今为止于星球上产生的最为强烈的风。 在气象学中，经常用风的強度和风的方向来描述风。长时间的风可根据它们得平均强度被称呼不同的名字，比如微风、烈風、风暴、飓风、台风等。风发生的时间范围很大，有持续几十分钟的雷暴气流，有可持续几小时的因地表加热而产生的局地微风，也有因地球上不同气候区内吸收太阳能量不同而产生的全球性的风。大尺度大氣環流产生的两个主要原因是赤道和极地之间的所受不同的加热，以及行星的旋转（科里奥利效应）。在热带，热低压和高原可以驱动季风环流。在海岸地区，海陆风循环在局地的风中占主要。在有起伏地形的地区，山谷风在局地风中占主要。",
    "风向标（wind vane）是测定风来向的仪器。一般安装在四周空旷、离地约10米高的杆子上。在风压作用下，风标箭头指风的来向。一般會分作頭部、水平桿和尾翼三個部分。在公元前2世纪，风向标是在中国古代和希腊独立发明的。最早的书面提到风向标出现在淮南子，并在雅典风塔顶安装了风向标。",
    "Walkman，是日本索尼公司（Sony）在1979年所推出的一個隨身聽品牌，而中文的隨身聽名稱即是由“Walkman”轉變而來。1991年開始，Walkman開始推出MiniDisc系統，並繼續在全球處於第一名的地位。2000年開始，MP3音樂格式逐漸盛行，低價競爭者陸續推出採用快取記憶體可支援MP3的隨身碟，使MP3從個人電腦漸漸轉移到隨身聽市場，Walkman採用全新的商標，象徵網路世代的互聯，並推出線上音樂下載服務“PlanetMG”。2001年後，蘋果電腦採用以1.8吋硬碟的高容量iPod並且搭配“iTunes”線上音樂商店服務，在美國及全世界推出，在2年內立即在全球隨身聽市場造成轟動，2004年7月索尼再推出高達1GB容量的“Hi-MD”，但由于推出時間點過晚，而且Walkman堅守自家之ATRAC3檔案格式，使Walkman逐漸下滑市佔率，造成蘋果電腦的iPod數位隨身聽在全球熱賣取代了Walkman地位。",
    "发明iPod是在iTunes之后，2000年，当时人们因为Napster网站的关系，已经有了从网络下载音乐再刻录的习惯，苹果电脑執行長乔布斯（Steve Jobs）觉得刻录太麻烦，他开始构思透过iTunes软件和iPod硬件传输歌曲的一种流程个项目。当时市面上已经有了类似的播放器，但是大多数都很差，播放歌曲也少得可怜，待机时间短。乔布斯任命喬恩·魯賓斯坦（Jon Rubinstein）开发这个项目。鲁宾斯坦收购了东芝最新的1.8英寸5GB的小硬盘的专利，并且确定了电池和屏幕等重要原件。再雇来了另外一位iPod之父托尼·法戴爾（Tony Fadell）。此人在加入苹果之前已经做着一些MP3播放器的工作。",
    "以撒·艾西莫夫（，生名：伊萨克·尤多维奇·奥济莫夫，，1920年1月2日－1992年4月6日），出生於苏俄的美籍猶太人作家與生物化學教授，門薩學會會員，他創作力豐沛，產量驚人，作品以科幻小說和科普叢書最為人稱道。美國科幻小說黃金時代的代表人物之一。   艾西莫夫一生創作和編輯過的書籍超過500冊，據估計他至少寫過9000封的信函和明信片，著作類別除了哲學類以外，幾乎涵蓋整個「杜威十進位圖書分類法」[1]。艾西莫夫与羅伯特·海萊因、亞瑟·克拉克並列為科幻小說“三巨頭”。[2][3]艾西莫夫的作品中，以「基地系列」最為人稱道，其它的主要著作還有「銀河帝國三部曲」和「機器人系列」。艾西莫夫筆下產出不少短篇小說，其中《》（Nightfall）曾獲美國科幻作家協會票選為1964年前的最佳短篇小說。他也寫推理小說和奇幻小說，以及大量的非文學類作品，並曾用筆名保羅·法蘭西（Paul French）為青少年撰寫科幻小說「幸運之星系列」。 ",
    "地球模拟器（Earth Simulator）是2002年3月15日開始運作的矢量型超级计算机，1998年日本科學技術廳（2001年1月6日與文部省合併為文部科學省）投入600億日圓經費。地球模拟器”通过在计算机内设置“虚拟地球”，以预测及解析整个地球的大气循环预测、温室化预测、地壳变动、地震发生等大规模计算为目的而开发。 “地球模拟器”是由640台用来进行演算处理的“计算节点”（机体的长和宽均为1×1.4米，高为2米）和65台用于连接计算结点的网络设备构成。每个计算结点上配备有8个最大为8 GigaFLOPS（1 GigaFLOPS＝1秒钟进行10亿次的浮点运算）的NEC产处理器和16GB的共享内存。计算结点和网络设备由通信速度为12.3GB/秒的网络连接，使用的电缆总长度达2800公里。整套设备共占用空间达3200平方米。“地球模拟器”的开发始于1999年。开发费用总计达400亿日元。",
    "一次且仅一次（英語：，简称）又稱為（不要重复你自己，简称）或一个规则，实现一次（, ）是面向对象编程中的基本原则，程序员的行事准则。旨在软件开发中，减少重复的信息.  的原则是“系统中的每一部分，都必须有一个单一的、明确的、权威的代表”，指的是（由人编写而非机器生成的）代码和测试所构成的系统，必须能够表达所应表达的内容，但是不能含有任何重复代码。当原则被成功應用時，一个系统中任何单个元素的修改都不需要與其逻辑无关的其他元素發生改變。此外，與之逻辑上相关的其他元素的變化均爲可预见的、均匀的，並如此保持同步。",
    "在軟體工程中，設計模式（）是對軟體設計中普遍存在（反覆出現）的各種問題，所提出的解決方案。這個術語是由埃里希·伽瑪（Erich Gamma）等人在1990年代從建筑设计領域引入到計算機科學的。設計模式並不直接用來完成程式碼的編寫，而是描述在各種不同情況下，要怎麼解決問題的一種方案。面向对象設計模式通常以類別或物件來描述其中的關係和相互作用，但不涉及用來完成應用程式的特定類別或物件。設計模式能使不穩定依賴於相對穩定、具體依賴於相對抽象，避免會引起麻煩的緊耦合，以增強軟體設計面對並適應變化的能力。",
    "黃仁勳、克里斯·馬拉科夫斯基和卡蒂斯·普里姆於1993年4月美國加州創辦了NVIDIA（隨後成為德拉威州企業）。NVIDIA保持低調到1997－1998年，當時它發佈了RIVA個人電腦繪圖處理器產品線。並於1999年1月在那斯達克掛牌上市；同年5月，售出第一千萬個繪圖處理器。於2000年收購了一代王者3dfx的智慧財產權。3dfx是1990年代中期其中一間最大的圖形處理器廠商。NVIDIA與許多OEM廠商，和一些組織建立起密切關係，最知名的包括台積電。2002年2月，NVIDIA售出第一億個繪圖處理器。",
    "1881年，法国人开始建造巴拿马运河，但很快由于工程技术问题和劳工的高死亡率而停工。美国于1904年接手这一工程，并于1914年8月15日建成。作为人类有史以来最大的工程项目之一，巴拿马运河极大地缩短了船隻来往于大西洋和太平洋之间的时间，使船隻能够避开遥远而危险的合恩角附近的麦哲伦海峡和德雷克海峡。 在运河的建造过程中，哥伦比亚、法国和美国先后控制了运河周边的区域。美国之后一直控制着运河和其周边的巴拿马运河区，直到1977年签署《巴拿马运河条约》後，美国才着手将控制权移交给巴拿马。美国和巴拿马共同管理運河一段时期后，最終在1999年將运河完全移交给巴拿马政府，并由其所属的巴拿马运河管理局管理至今。每年通过巴拿马运河的船隻数量从1914年的约1,000艘，增长到了2008年的14,702艘，总装载重量约为3.337亿吨。直到2012年，至少815,000艘船隻曾通过巴拿马运河。[1]船隻通过运河需要花费六至八小时。",
    "[Phys. Rev. Lett. 126 ||  Exoplanets as Sub-GeV Dark Matter Detectors] 银河系暗物质晕从内到外密度是减少的，按照文章中的设想，通过大统计量的办法，测量银河系大型气态行星（比如木星、褐矮星）等的在银河系尺度的温度变化，这样的变化可能是暗物质分布引起的，较里面的星系的暗物质密度大转化为正能量加热星系概率会更高。",
    "在纽结理论中，三叶结（trefoil knot）31是一种最简单的非平凡纽结。可以用反手結连接两个末端而达成。它是唯一一种有3个交叉的纽结。它也可以描述为 (2,3)-环面纽结。由於三葉結的結構極為簡單，它是研究紐結理論很重要的基本案例，在拓撲學、幾何學、物理學、化學領域，有廣泛的用途。 三環其四 變動排一（偏差質)三叶结得名于植物三叶草。",
    "RSA加密演算法是一种非对称加密演算法，在公开密钥加密和电子商业中被广泛使用。RSA是由罗纳德·李维斯特（Ron Rivest）、阿迪·萨莫尔（Adi Shamir）和伦纳德·阿德曼（Leonard Adleman）在1977年一起提出的。当时他们三人都在麻省理工学院工作。RSA 就是他们三人姓氏开头字母拼在一起组成的。",
    "在计算机科学中，Knuth-Morris-Pratt字符串查找算法（简称为KMP算法）可在一个字符串S内查找一个W的出现位置。一个词在不匹配时本身就包含足够的信息来确定下一个匹配可能的开始位置，此算法利用这一特性以避免重新检查先前匹配的字符。",
    "遗传算法由密歇根大学的约翰·霍兰德和他的同事于二十世纪六十年代在对细胞自动机（英文：cellular automata）进行研究时率先提出。在二十世纪八十年代中期之前，对于遗传算法的研究还仅仅限于理论方面，直到在匹兹堡召开了第一届世界遗传算法大会。随着计算机计算能力的发展和实际应用需求的增多，遗传算法逐渐进入实际应用阶段。1989年，纽约时报作者约翰·马科夫写了一篇文章描述第一个商业用途的遗传算法--进化者（英文：Evolver）。之后，越来越多种类的遗传算法出现并被用于许多领域中，财富杂志500强企业中大多数都用它进行时间表安排、数据分析、未来趋势预测、预算、以及解决很多其他组合优化问题。",
    "模擬退火是一種通用概率演算法，常用來在一定時間內尋找在一個很大搜尋空間中的近似最優解。模擬退火是S. Kirkpatrick, C. D. Gelatt和M. P. Vecchi在1983年所發明。而V. Černý在1985年也獨立發明此演算法。",
    "蚁群算法（Ant Colony Optimization, ACO），又称蚂蚁算法，是一种用来在图中寻找优化路径的机率型算法。它由Marco Dorigo于1992年在他的博士论文“Ant system: optimization by a colony of cooperating agents”中提出，其灵感来源于蚂蚁在寻找食物过程中发现路径的行为。蚁群算法是一种模拟进化算法，初步的研究表明该算法具有许多优良的性质。针对PID控制器参数优化设计问题，将蚁群算法设计的结果与遗传算法设计的结果进行了比较，数值仿真结果表明，蚁群算法具有一种新的模拟进化优化方法的有效性和应用价值.蚁群优化算法已应用于许多组合优化问题，包括蛋白质折叠或路由车辆的二次分配问题，很多派生的方法已经应用于实变量动力学问题，随机问题，多目标并行的实现。它也被用旅行推銷員問題的拟最优解。在图表动态变化的情况下解决相似问题时，他们相比模拟退火算法和遗传算法方法有优势；蚁群算法可以连续运行并适应实时变化。这在网络路由和城市交通系统中是有利的。",
    "id Tech 3引擎是由id Software开发的用于多种游戏的游戏引擎。 它和虚幻引擎，Source引擎是在世界上使用最广泛的游戏引擎。",
    "2K Games是美國遊戲發行商Take-Two Interactive旗下的遊戲品牌，2005年設立，總部位於加利福尼亚州诺瓦托。Take-Two为了让自有品牌发行的游戏与Rockstar Games所做区别以及在体育竞技游戏市场上与美国艺电旗下的EA Sports体育部门一决高下，由Take-Two收购日本世嘉公司旗下的工作室Visual Concepts工作室以及其完全所有的子公司Kush Games引入旗下。此外它亦以2K Sports名義發行體育竞技遊戲，以及2K Play名義發行休閒益智遊戲。",
    "在视频游戏开发中，Lua被程序员广泛的用作脚本语言，主要由于它的可感知到的易于嵌入、快速执行，和短学习曲线[19]。在2003年，GameDev.net组织的一次投票，说明了Lua是游戏编程的最流行脚本语言[20]。在2012年1月12日，Lua被《游戏开发者》宣布为编程工具范畴的Front Line奖2011年度获奖者[21]。大量非游戏应用也出于可扩展性而使用Lua，比如TeX排版设置语言实现LuaTeX、键-值数据库Redis、文本编辑器Neovim和web服务器Nginx。通过Scribunto扩展，Lua可获得为MediaWiki软件中的服务器端脚本语言，Wikipedia和其他wiki都基于了它[22][23]。它的应用包括允许从Wikidata集成数据到文章中[24]，和助力于自动生物分类框系统。Lua可以用於嵌入式硬體，不僅可以嵌入其他編程語言，而且可以嵌入微處理器中，例如NodeMCU開源硬體項目將Lua嵌入到Wi-Fi SoC中[25]。",
    "函数式编程（英語：）或称函数程序设计、泛函编程，是一种编程范式，它将电脑运算视为函数运算，并且避免使用程式状态以及易变物件。其中，λ演算（lambda calculus）为该语言最重要的基础。而且，λ演算的函数可以接受函数当作输入（引数）和输出（传出值）。比起指令式編程，函數式編程更加強調程序执行的结果而非执行的过程，倡导利用若干简单的执行单元让计算结果不断渐进，逐层推导复杂的运算，而不是设计一个复杂的执行过程。在函数式编程中，函数是第一类对象，意思是说一个函数，既可以作为其它函数的参数（输入值），也可以从函数中返回（输入值），被修改或者被分配给一个变量。",
    "自从1946年世界上第一台电子计算机问世以来，计算机应用的一个重要里程碑是1962年美国麻省理工学院发明了世界上第一台图形显示器。自此之后，计算机可以通过图形显示器直接输入、输出图形，并且可以在显示屏上通过光标的移动而直接修改图形。而在这之前，工程师是通过一厚叠纸上密密麻麻的数字来间接表达工程图形的。计算几何是一门兴起于二十世纪七十年代末的计算机科学的一个分支，主要研究解决几何问题的算法。1962年被认为是美国和欧洲CAD开始发展的一年。首先的应用领域是汽车、飞机和造船工业。这3个行业，由于其产品的外形曲面特别复杂，要求特别苛刻，而成为CAD首先应用的领域。与此同时，也就发展出了一门新兴学科——计算几何，它在美国常常被称为CAGD（Computer Aided Geometric Design，计算机辅助几何设计），专门研究“几何图形信息（曲面和三维实体）的计算机表示、分析、修改和综合”。1972年在美国举行CAGD第一次国际会议，标志计算几何学科的形成。",
    "自动机是有限状态机（FSM）的数学模型。FSM是给定符号输入，依据（可表达为一个表格的）转移函数“跳转”过一系列状态的一种机器。在常见的FSM的“米利型有限状态机”（Mealy）变体中，这个转移函数告诉自动机给定当前状态和当前字符的时候下一个状态是什么。 逐个读取输入中的符号，直到被完全耗尽(把它当作有一个字写在其上的磁带，通过自动机的读磁头来读取它；磁头在磁带上前行移动，一次读一个符号)。一旦输入被耗尽，自动机被称为“停止”了",
    "计算机协会（英語：，简称ACM）是一个世界性的计算机从业员专业组织，创立于1947年，是世界上第一个科学性及教育性计算机学会，亦是現時全球最大的電腦相關學會[1]。ACM每年都出版大量電腦科学的专门期刊，并就每项专业设有兴趣小组。兴趣小组每年亦会在全世界（但主要在美国）举办世界性讲座及会谈，以供各会员分享他们的研究成果。近年ACM积极开拓网上学习的渠道，以供会员在工作之余或家中提升自己的专业技能。截止20世纪末，ACM在全球拥有75,000个以上的成员，包括遍及学术界、工业、研究和政府领域的学生和计算机专业人员。成员的最高荣誉是会士（Fellow）。ACM通过它的35个特别兴趣组（Special Interest Group，SIG）提供特殊的技术信息和服务。这些特别兴趣组集中于计算机学科的多种专业，如计算机系统结构专业组（computer architecture，SIGARCH）和计算机图形与互动技术专业组（computer graphics and interactive techniques，SIGGRAPH）。这些特别兴趣组中有不少是跨学科的，适合计算机行业以外的人员。例如有不少艺术家参与到图形互动小组中。",
    "WebGL(2011~)是一種JavaScript API，用於在不使用外掛程式的情況下在任何相容的網頁瀏覽器中呈現交互式2D和3D圖形[2]。WebGL完全整合到瀏覽器的所有網頁標準中，可將影像處理和效果的GPU加速使用方式當做網頁Canvas的一部分。WebGL元素可以加入其他HTML元素之中並與網頁或網頁背景的其他部分混合[3]。WebGL程序由JavaScript編寫的控制代碼和OpenGL Shading Language（GLSL）編寫的著色器代碼組成，該語言類似於C或C++，並在電腦的圖形處理器（GPU）上執行。WebGL由非營利Khronos Group設計和維護[4]",
    "xkcd是兰道尔·门罗（Randall Munroe）的网名，又是他所创作的漫画的名称。作者兰道尔·门罗（Randall Munroe）给作品的定义是一部“关于浪漫、讽刺、数学和语言的网络漫画”(A webcomic of romance,sarcasm, math, and language)，被网友誉为深度宅向网络漫画。",
    "Perl是高階、通用、直譯式、動態的程式语言家族。最初设计者拉里·沃尔為了讓在UNIX上進行報表處理的工作變得更方便，決定開發一個通用的腳本語言，而在1987年12月18日發表。目前，Perl语言家族包含两个分支Perl 5以及Perl 6。雖然Perl不是正式的首字母縮略詞[8]，但仍有各種各樣的逆向首字母缩略词，包括“實用的提取和報告語言”。Perl借用了C、sed、awk、shell脚本、Lisp以及很多其他程式語言的特性。其中最重要的特性是Perl内部集成了正则表达式的功能，以及巨大的第三方代码库CPAN。鉴于Perl在实际工程应用中广泛使用，苹果公司的MacOS，Linux，FreeBSD等现代化操作系统默认安装Perl。",
    "（非複用信息和計算機服務，英語：，），一种多用户、多进程的计算机操作系统，源自于从20世纪70年代开始在美国AT&T公司的贝尔实验室开发的。UNIX不仅仅是一个操作系统，更是一种生活方式。经过几十年的发展，UNIX在技术上日臻成熟的过程中，它独特的设计哲学和美学也深深地吸引了一大批技术人员，他们在维护、开发、使用UNIX的同时，UNIX也影响了他们的思考方式和看待世界的角度。UNIX重要的设计原则：简洁至上（KISS原则）提供机制而非策略",
    "类Unix系统（英語：；经常被称为UN*X或*nix）指各种Unix的衍生系统，比如FreeBSD、OpenBSD、SUN的Solaris，以及各种与传统Unix类似的系统，例如Minix、Linux、QNX等。它们虽然有的是自由软件，有的是私有软件，但都相当程度地继承了原始UNIX的特性，有许多相似处，并且都在一定程度上遵守POSIX规范。UNIX的商標權由國際開放標準組織所擁有，只有符合單一UNIX規範的UNIX系統才能使用UNIX這個名稱，否則只能稱為類UNIX（UNIX-like）",
    "在计算机领域，Common Gateway Interface (CGI) 是为了web 服务去执行类似于console application (也可以称作command-line interface programs) 的程序，这种程序是在server上实现 动态页面 提供了一种通用的协议，这样的程序称作 CGI 脚本。重点是这些脚本如何在server上执行。通常情况下，一次请求对应一个CGI 脚本的执行，生成一个 HTML.简而言之，一个 HTTP POST 请求，从客户端经由 标准输入 发送数据到一个CGI 程序。同时携带其他数据，例如 URL paths, HTTP header 数据，被转换为进程的环境变量。Perl是一个广泛被用來編寫CGI程式的语言，但CGI是獨立於任何語言的。Web服务器无须对语言有任何了解。事实上，CGI程序可以用任何脚本语言或者编程语言实现，只要該语言可以在系统上运行。除Perl外，像Unix shell script, Python, Ruby, PHP, Tcl, C/C++和Visual Basic都可以用来編写CGI程序。实现維基百科編輯的CGI程序的一个例子：首先用户代理程序向这个CGI程序请求某个名称的条目，如果该条目页面存在，CGI程序就会去获取那个条目页面的原始数据，然后把它转换成HTML并把结果输出给浏览器；如果该条目页面不存在，CGI程序则会提示用户新建一个页面。所有維基操作都是通过这个CGI程序来处理的。",
    "脚本语言（英語：）是为了缩短传统的「编写、编译、链接、运行」（edit-compile-link-run）过程而创建的计算机编程语言。早期的脚本语言经常被称为批处理语言或工作控制语言。一个脚本通常是解释运行而非编译。脚本語言通常都有簡單、易學、易用的特性，目的就是希望能讓程式設計師快速完成程式的編寫工作。而巨集語言則可視為脚本語言的分支，兩者也有實質上的相同之處。虽然许多脚本语言都超越了计算机简单任务自动化的领域，成熟到可以编写精巧的程序，但仍然还是被称为脚本。几乎所有计算机系统的各个层次都有一种脚本语言。包括操作系统层，如计算机游戏，网络应用程序，字处理文档，网络软件等。在许多方面，高级编程语言和脚本语言之间互相交叉，二者之间没有明确的界限。",
    "GNU编译器套裝（英語：，縮寫為GCC），指一套编程語言编译器，以GPL及LGPL許可證所發行的自由軟體，也是GNU計劃的关键部分，也是GNU工具链的主要組成部份之一。GCC（特别是其中的C语言编译器）也常被认为是跨平台编译器的事实标准。1985年由理查德·马修·斯托曼開始發展，現在由自由軟體基金會負責維護工作。原名為GNU C語言編譯器（），因為它原本只能處理C語言。GCC在发布后很快地得到擴展，變得可處理C++。之後也變得可處Fortra.Pascal、Objective-C、Java、Ada，Go與其他語言。許多操作系统，包括許多类Unix系統，如Linux及BSD家族都採用GCC作為标准编译器。GCC原本用C開發，後來因為LLVM、Clang的崛起，它更快地將開發語言轉換為C++。許多C的愛好者在對C++一知半解的情況下主觀認定C++的性能一定會輸給C，但是Ian Lance Taylor給出了不同的意見，並表明C++不但性能不輸給C，而且能設計出更好，更容易維護的程式[2][3]。","編譯器（）是一種電腦程式，它會將某種程式語言寫成的原始碼（原始語言）轉換成另一種程式語言（目標語言）。它主要的目的是將便于人编写、阅读、维护的高级计算机语言所寫作的原始碼程式，翻译为计算机能解读、运行的低阶机器语言的程序，也就是執行檔。编译器将原始程序（source program）作为输入，翻译产生使用目标语言（target language）的等价程序。源代码一般为高阶语言（High-level language），如Pascal、C、C++、C# 、Java等，而目标语言则是汇编语言或目标机器的目标代码（Object code），有时也称作机器代码（Machine code）。",
    "一个现代编译器的主要工作流程如下：源代码（source code）→ 预处理器（preprocessor）→ 编译器（compiler）→ 汇编程序（assembler）→ 目标代码（object code）→ 链接器（linker）→ 執行檔（executables），最後打包好的檔案就可以給電腦去判讀執行了。",
    "层叠样式表（英語：，缩写：；又称串樣式列表、级联样式表、串接样式表、）是一种用来为结构化文档（如HTML文档或XML应用）添加样式（字体、间距和颜色等）的计算机语言，由W3C定义和维护。目前最新版本是CSS2.1，为W3C的推荐标准。CSS3現在已被大部分現代瀏覽器支援，而下一版的CSS4仍在开发中。最初版本：1996年12月17日",
    "可扩展标记语言（英語：，简称：）是一种标记语言。标记指计算机所能理解的信息符号，通过此种标记，计算机之间可以处理包含各种信息的文章等。如何定义这些标记，既可以选择国际通用的标记语言，比如HTML，也可以使用像XML这样由相关人士自由决定的标记语言，这就是语言的可扩展性。XML是从标准通用标记语言（SGML）中简化修改出来的。它主要用到的有可扩展标记语言、可扩展样式语言（XSL）、XBRL和XPath等。",
    "置标语言（也称、、、、markup language）是一種将文本（）以及文本相关的其他信息结合起来，展现出关于文档结构和数据处理细节的计算机文字编码。与文本相关的其他信息（包括例如文本的结构和表示信息等）与原来的文本结合在一起，但是使用标记（markup）进行标识。当今广泛使用的置标语言是超文本置标语言（，）和可扩展置标语言（，）。置标语言广泛应用于网页和网络应用程序。标记最早用于出版业，是作者、编辑以及出版商之间用于描述出版作品的排版格式所使用的。",
    "TeX是一个由美国电脑教授高德纳（Donald E. Knuth）编写的功能强大的排版软件。它在学术界十分流行，特别是数学、物理学和计算机科学界。TeX被普遍认为是一个很好的排版工具，特别是在处理复杂的数学公式时。利用诸如是LaTeX等终端软件，TeX就能够排版出精美的文本。",
    "雍和宮位於北京市东城区雍和宫大街，是中国汉族地区最大的藏传佛教寺院之一。康熙三十三年（1694年），清康熙帝在内城东北原明代內官監官房舊址为皇四子胤禛修建了府邸。该府最初称“四爷府”或“禛贝勒府”，胤禛被封为和碩雍親王后改称雍王府。1711年，胤禛之子弘历出生于王府东书院“如意室”。1723年胤禛继位，为雍正帝（1723年－1735年在位）。雍正帝迁入紫禁城后，于雍正三年（1725年）将原雍王府潛邸升格为宫殿[1]，并改名为雍和宫。雍正十三年（1735年），曾在宫内停放雍正帝灵柩，为此将主要殿宇覆瓦升格为黄琉璃瓦。",
    "国子监街，旧称成贤街，是位于北京市东城区安定门内的一条街巷，因在这条街上坐落着元明清时代中国的最高学府国子监而得名。这条街上还坐落着中国第二大孔庙——北京孔庙。[1]国子监前的东、西两侧又各有一座两柱三楼冲天式过街牌楼，额题“国子监”。正对国子监大门的国子监街南侧有一座影壁。国子监南侧有两座祠庙，东侧的是灶君庙（位于国子监街40号），西侧的是火神庙（位于国子监街78号）。灶君庙现由小学使用，建筑已经被拆除。火神庙现存大门、大殿、正殿以及东西配殿，大殿内供奉火神、关帝、鲁班、财神等等。国子监街两侧有几座较为完整的小型四合院。国子监街南侧的现代建筑经过修饰，也变为传统风格，与周边风貌统一。[1]",
    "北京孔庙位于北京安定门内国子监街，是仅次于山东曲阜孔庙的中国第二大孔庙，始建于元大德六年（1302年），是元明清三代中央政府官方祭祀孔子的场所，除了三代皇帝，袁世凯在自封为中華帝國皇帝之后也曾前往北京孔庙祭孔。孔庙占地约2万平方米，有四进院落。分布于中轴线上的建筑从自南向北顺次为先师门、大成门、大成殿、崇圣祠。孔庙内收藏有自元以来各代科举进士题名碑、乾隆年间仿制的西周石鼓以及由江苏金坛贡生蒋衡手书的十三经碑林189块。",
    "縱貫線（北段）是指縱貫線從基隆至竹南間，由臺灣鐵路管理局經營的鐵路幹線。由於縱貫線在此段穿越台灣人口最為稠密的台北都會區，故此段為台鐵各營運路線之中客流量最高的路段。尤其在七堵—樹林間是列車車次最密集的區間，每日單向約150至160車次通過。",
    "李宗盛（1958年7月19日－），臺灣男歌手、词曲作家、音樂製作人。出生於台北北投，母親為巴賽族後裔[2]。 20世紀80年代至今創作、製作了大量經典歌曲和暢銷專輯，有「華語流行音樂教父」和「百萬製作人」之稱。作為樂壇最具影響力的音樂人之一，他發掘提攜了周華健、辛曉琪、張信哲、光良、品冠、梁靜茹、五月天、白安與楊宗緯等多位歌手，被譽為「自20世紀80年代以來，東亞及東南亞最重要的音樂製作人」[3] 。曾任滾石唱片製作總監、副總經理，現受聘擔任索尼音樂大中華區A&R首席顧問。",
    "縱貫線成立的背景，是台灣滾石唱片老闆段鍾潭在一次和羅大佑、李宗盛的聚餐中討論了組成樂團的提議，之後又分別找來了周華健和張震嶽加入，並在2008年8月1日召開記者會宣佈成軍，口號宣稱「要搞非常之建設，先搞非常之破壞！」。團名「縱貫線」的由來，是四名團員在聊天中想出來的，因為四人皆搭乘過台灣的縱貫線鐵路，算是大家在台灣唯一有交集的經驗。樂團於2008年12月發表首支單曲《亡命之徒》，曲風結合饒舌和搖滾，並預計於2009年初發行專輯。《亡命之徒》的音樂錄影帶原本計畫在2008年12月25日在台灣首次播出，但團員張震嶽和經紀人對於成品不甚滿意，因此停止播出計畫，並決定重新拍攝。[2]另新曲《鄉親父老》 (後更名為《縱貫線兄弟姐妹》)，《公路》，《天使的眼淚》及《親愛的》，已在3月7日的台灣小巨蛋縱貫線演唱會上發表。",
    "同步辐射光源是指产生同步辐射的物理装置。第一代同步辐射光源是寄生于高能物理实验专用的高能对撞机的兼用机，第二代同步辐射光源是基于同步辐射专用储存环的专用机，第三代同步辐射光源為性能更高且儲存環之直線段可加裝插件磁鐵組件之同步辐射专用储存环的专用机，现在正在研究的自由电子激光器則為新一代的高強度光源設施。",
    "为了产生自由电子激光，一束电子被加速至接近光速（相对论速度）。之后，电子束通过由周期性横向磁场（通过在光腔中设置与电子束行进方向成变化夹角的磁体产生）构成的自由电子振荡器。产生周期性磁场的磁体阵列又被称为“波荡器(undulator)”或“摇摆体(wiggler)”，这是因为它们会作用于电子束使之形成正弦形状的路径。在此路径上对电子进行加速会使之发射光子（同步辐射）。由于电子周期运动与已发射光场同相，得到的是相干叠加的光场，即自由电子激光。所发射的光波长可以通过改变电子束能量或波荡器的磁场强度进行调节。",
    "万圣书园是位于北京市海淀区的一家私营书店，以经营人文、学术类的书为主。[1]万圣书园是北京的文化地标之一。[2]1993年，毕业于北京大学的刘苏里和甘琦开办了北京第一家专营人文学术图书的私营书店“万圣书园”。[3]万圣书园于1993年10月31日开业，第一个店址位于西北三环中国人民大学附近。",
    "宫崎駿（日语：／ Miyazaki Hayao，1941年1月5日－）是日本動畫師、動畫導演、及漫畫家。畢業於杉並區立永福小學校、杉並區立大宮中學校、東京都立豐多摩高等學校及學習院大學政治經濟學院。大學畢業後踏入動畫製作工作，日後成為日本知名動畫廠吉卜力工作室的核心人物之一。其執導過11部長篇動畫電影，多次宣布退休，2013年9月時是第7次宣布退休[2]，2016年再度復出。現任吉卜力工作室董事、德間紀念動畫文化財團理事長、三鷹市立動畫美術館館長。目前在埼玉縣所澤市居住。",
    "磁流体力学（英文：、或），是研究等离子体和磁场相互作用的物理学分支，其基本思想是在运动的导电流体中，磁场能够感应出电流。磁流体力学将等离子体作为连续介质处理，要求其特征尺度远远大于粒子的平均自由程、特征时间远远大于粒子的平均碰撞时间，不需考虑单个粒子的运动。由于磁流体力学只关心流体元的平均效果，因此是一种近似描述的方法，能够解释等离子体中的大多数现象，广泛应用于等离子体物理学的研究。更精确的描述方法是考虑粒子速度分布函数的动理学理论。磁流体力学的基本方程是流体力学中的纳维-斯托克斯方程和电动力学中的麦克斯韦方程组。磁流体力学是由瑞典物理学家汉尼斯·阿尔文创立的，阿尔文因此获得1970年的诺贝尔物理学奖。",
    "《极限竞速: 地平线4》（英语：）是一款由游乐场游戏工作室开发并由微软发行在Xbox One和Windows 10上的开放世界竞速游戏。本作是《极限竞速》系列的外傳分支“地平线”系列的第四作。相對主系列的《極限競速7》，雖然本作較為傾向於娛樂取態的賽車遊戲，但亦附設相關系統讓玩家針對車輛改造性能與調較機件令到功能更進一步。本作的主要賽道場景設定，會以英國地方設計，有風情景色壯麗的各式郊野背景出現，在從中更有本作重點增添的四季變化，以及主系列的新系統動態天氣出現。",
    "恆星以不同的方法將不同的層次的熱量向上層並向外轉移，主要是以對流和輻射轉移，但是在白矮星熱傳導卻非常重要。在溫度梯度足夠時，對流是能量轉移的主導方式，氣体在一個特定的小包內，如果經由絕熱過程輕微的上升，它便會在恆星內持續的上升。在這種情況下，如果它比周圍的環境稍為溫暖一些，上升中的小包是有浮力的，並且會繼續上升；如果上升中的小包比周圍的氣體冷，它將會落回它原來的高度[1]。在溫度梯度較低和不透明度低的區域，能量將通過輻射來轉移，而輻射成為能量轉移的主導。",
    "知乎是一家创立于2011年1月26日的中國大陸社会化问答网站，产品形态与美国同类网站Quora类似。[5]“知乎”在文言文中意为“知道吗”。[6]2012年2月底，知乎使用“发现更大的世界”作为其宣传口号。截至2017年9月20日，知乎注册用户数超1亿 ，日活跃用户量达2600万，人均日访问时长1小时，月浏览量180亿。[7]截至2016年5月，知乎累计产生了1000万个提问、3400万个回答和3500万个赞同。[8]",
    "在计算机科学中，消息队列（英語：）是一种进程间通信或同一进程的不同线程间的通信方式，軟體的貯列用來處理一系列的輸入，通常是來自使用者。消息队列提供了异步的通信协议，每一個貯列中的紀錄包含詳細說明的資料，包含發生的時間，輸入裝置的種類，以及特定的輸入參數，也就是说：消息的发送者和接收者不需要同时与消息队列交互。消息会保存在队列中，直到接收者取回它。[1]消息队列本身是异步的，它允许接收者在消息发送很长时间后再取回消息，这和大多数通信协议是不同的。例如WWW中使用的HTTP协议（HTTP/2之前）是同步的，因为客户端在发出请求后必须等待服务器回应。然而，很多情况下我们需要异步的通信协议。比如，一个进程通知另一个进程发生了一个事件，但不需要等待回应。但消息队列的异步特点，也造成了一个缺点，就是接收者必须轮询消息队列，才能收到最近的消息。",
    "计算机图形学一个主要的目的就是要利用计算机产生令人赏心悦目的真实感图形。为此，必须建立图形所描述的场景的几何表示，再用某种光照模型，计算在假想的光源、纹理、材质属性下的光照明效果。所以计算机图形学与另一门学科计算机辅助几何设计有着密切的关系。事实上，图形学也把可以表示几何场景的曲线曲面造型技术和实体造型技术作为其主要的研究内容。同时，真实感图形计算的结果是以数字图象的方式提供的，计算机图形学也就和图像处理有着密切的关系。",
    "定時器訊號（英語：），計算機科學及相關領域用语。此訊號在同步電路當中，扮演計時器的角色，並組成電路的電子元件。只有当同步信号到达时，相关的触发器才按输入信号改变输出状态，因此使得相关的电子元件得以同步運作。",
    "计算机图形学的分支学科 可大致可分為以下幾類 1.幾何：研究面的表示和處理的方法 2.動畫：研究移動的表示和操作方法  3.影像擬真/渲染：研究模擬光線傳遞效果的演算法  4.影像：研究影像的獲取或是編輯  5.拓扑结构：研究的空间和表面的结构。",
    "渲染（英語：，或称为绘制）在電腦繪圖中，是指以软件由模型生成图像的过程。模型是用语言或者数据结构进行严格定义的三维物体或虚拟场景的描述，它包括几何、视点、纹理、照明和阴影等信息。图像是数字图像或者位图图像。彩現用于描述：计算视频编辑软件中的效果，以生成最终视频的输出过程。",
    "道格拉斯·克羅克福特（英語：）是美國程式設計師和企业家，知名于对網頁程式語言JavaScript推进和改良；且為輕量級資料交換格式「JSON」的創建者。[1]他还是众多JavaScript语言开发工具的创造者，例如JSLint和JSMin。近段时间，他在PayPal担任JavaScript语言高级顾问，当然他也是JavaScript、JSON以及web技术的布道者，在这些方面出版发行了很多知名的书籍及演讲。",
    "ECMAScript是一种由Ecma国际（前身为欧洲计算机制造商协会）在标准ECMA-262中定义的脚本语言规范。这种语言在万维网上应用广泛，它往往被称为JavaScript或JScript，但实际上后两者是ECMA-262标准的实现和扩展。",
    "AJAX即“”（非同步的JavaScript與XML技術），指的是一套综合了多項技術的瀏覽器端網頁開發技術。Ajax的概念由傑西·詹姆士·賈瑞特所提出.传统的Web应用允许用户端填写表单（form），当送出表单时就向網頁伺服器发送一个请求。伺服器接收并处理传来的表单，然后送回一个新的网页，但这个做法浪费了许多带宽，因为在前后两个页面中的大部分HTML码往往是相同的。由于每次应用的沟通都需要向伺服器发送请求，应用的回應时间依赖于伺服器的回應时间。这导致了用户界面的回應比本機应用慢得多。与此不同，AJAX应用可以仅向伺服器发送并取回必須的数据，并在客户端采用JavaScript处理来自伺服器的回應。因为在伺服器和浏览器之间交换的数据大量减少，伺服器回應更快了。同时，很多的处理工作可以在发出请求的客户端机器上完成，因此Web伺服器的负荷也减少了。类似于DHTML或LAMP，AJAX不是指一种单一的技术，而是有机地利用了一系列相关的技术。虽然其名称包含XML，但实际上数据格式可以由JSON代替，进一步减少数据量，形成所谓的AJAJ",
    "1998年3月31日，Netscape在源碼開放許可證的安排下，公開了網景通訊家的大部分原始碼。這個項目沿用了Mozilla的名稱，並且新成立了Mozilla開發社群，及其專門網站Mozilla.org[8]。不過由於通訊家的原始碼老舊難以維護，通訊家的原始碼差不多被全部拋棄，Mozilla社群開發出更穩定、更多功能的新一代互聯網應用套件。經過一段長時間的開發之後，應用套件終於在2002年6月5日誕生。Mozilla當時成為該應用套件的名字。Mozilla的程式碼成為了Netscape 6和Netscape 7的基礎。而由基金會推出的Mozilla Firefox、Mozilla Thunderbird也是基於Mozilla最底層的程式碼。為了幫助一般用戶分辨基金會旗下的多個軟件，基金會開始把應用套件稱呼為「Mozilla Application Suite」，簡稱「Mozilla Suite」。Mozilla基金會已不維護Mozilla Application Suite，以便集中開發人員的精神在FirefoxThunderbird上。現時Mozilla Application Suite已由非正式的SeaMonkey所取代[9]。",
    "Lisp（歷史上拼寫為LISP）是具有悠久歷史的計算機編程語言家族，有獨特和完全括號的前綴符號表示法。起源於西元1958年，是現今第二悠久而仍廣泛使用的高階編程語言。只有FORTRAN編程語言比它更早一年。Lisp編程語族已經演變出許多種方言。現代最著名的通用編程語種是Clojure、Common Lisp和Scheme。Lisp最初創建時受到阿隆佐·邱奇的lambda演算的影響，用來作為計算機程序實用的數學表達。因為是早期的高階編程語言之一，它很快成為人工智能研究中最受歡迎的編程語言。在計算機科學領域，Lisp開創了許多先驅概念，包括：树结构、自動記憶體管理、动态类型、条件表达式、高階函數、遞迴、自主（self-hosting）編譯器、讀取﹣求值﹣輸出循環（英語：）",
    "摩尔定律（英語：）是由英特尔（Intel）创始人之一戈登·摩尔提出的。其内容为：集成电路上可容纳的晶体管数目，约每隔兩年便会增加一倍；经常被引用的“18个月”，是由英特尔首席执行官大衛·豪斯（David House）提出：预计18个月会将芯片的性能提高一倍（即更多的晶体管使其更快），是一種以倍數增長的觀測。[1]    尽管摩尔定律的现象已经被观察到了数十年，摩尔定律仍应该被视为是对现象的观测或对未来的推测，而不是一个物理定律或自然界的规律，从另一角度看，未来的增长率在逻辑上无法保证会跟过去的数据一样，也就是逻辑上无法保证摩尔定律会持续下去。虽然预计摩尔定律将持续到至少2020年。[3]然而，2010年国际半导体技术发展路线图的更新增长已经在2013年年底放缓[4]；又比如说英特尔在22纳米跟14纳米的CPU製程上已经放慢了技术更新的脚步，之后的时间里，晶体管数量密度预计只会每三年增加一倍。",
    "Erlang（/ˈɜːrlæŋ/）是一種通用的，它由喬·阿姆斯特朗（Joe Armstrong）在瑞典電信設備製造商愛立信所轄的電腦科學研究室開發，目的是創造一種可以應付大規模并發活動的和執行環境。Erlang於1987年釋出正式版本，最早是愛立信擁有的私有軟體，經過十年的發展，於1998年發表開放源碼版本。LYME is Erlang-based Erlang是運作於虛擬機的，但是現在也包含有烏普薩拉大學高性能Erlang計劃（HiPE）[3]開發的原生程式碼編譯器，自R11B-4版本開始，Erlang也支持。在編程範型上，Erlang屬於多重典範程式語言，涵蓋函數式、及。循序執行的Erlang是一个及早求值, 單次賦值和的函數式程式語言。",
    "《新世纪福音战士》（日语：[注释 1]；英語：[注释 2]，通常被称为EVANGELION[11]、NGE[12][13][14][15]或者EVA[5][16][17][18]。在华语圈中被翻译为新世纪福音战士[注释 3][5][20]，中国大陆早期引进时译为新世纪天鹰战士[21][22]）是一部由庵野秀明执导，GAINAX和龙之子制作公司制作的日本动画电视连续剧，于1995年10月至1996年3月在东京电视台首播。原版的日语配音演员，包括为碇真嗣配音的配音演员及歌手绪方惠美，为绫波零配音的林原惠和为惣流·明日香·兰格雷配音的宫村优子等。剧中音乐由鷺巢詩郎制作，配乐专辑一经推出就登顶公信榜排行榜；动画主题曲在其发布后的十几年间有着持续的影响力。其他新世纪福音战士系列作品还包括分别于1997年和1998年上映的三部电影，以及被称作新剧场版的电影四部曲系列作，另外还有其他一些衍生动画、漫画和电子游戏系列。",
    "《星際牛仔》（，Cowboy Bebop，又譯《賞金獵人》）是由日升动画和萬代影視制作的原創電視動畫。它最初於東京電視臺從1998年4月到6月首播，但因電檢尺度問題並未完整播畢，後由WOWOW在同年10月至第二年4月播出了完整的26集，台灣則曾由超視播出中文配音版本。2001年推出一部劇場版作品《星際牛仔：天國之門》（））。相關漫畫版作品則由作畫，在1998年到2000年之間由角川書店發行。",
    "葉壹堂（英語：PageOne）是一家在新加坡成立的大型連鎖書店，主力銷售英文出版品。近年亦至致力開拓中文書籍市場。創辦人為新加坡華裔陳家強（Mark Tan），亦是葉壹堂總裁。葉壹堂目前在中國大陸設有3間分店，而在新加坡、臺灣與香港的分店均已先後結業。",
    "列夫·达维多维奇·朗道（俄語：，英語：，1908年1月22日－1968年4月1日），前蘇聯知名物理學家，凝聚态物理学的奠基人，苏联科学领军人之一[3]，同时擅长还原论和唯象理论，在理論物理裡多個領域都有重大貢獻。他标新立异，爱打破传统，并以扎实的数学基本功、精炼的著作风格和高傲的性格而为人熟知。他由於「關於凝聚態物質的開創性理論，特別是液氦」獲得1962年的諾貝爾物理學獎[4]。他反对苏共独裁，并曾因反革命罪入狱。1962年，仍活跃于研究前沿的朗道发生严重车祸，智力和记忆力均受损，身体状况大不如前，6年后去世。朗道去世多年后，阿列克谢·阿布里科索夫及维塔利·金兹堡凭借早年与朗道共同建立的超导体和超流体理论也于2003年获得诺贝尔物理学奖",
    "五道口意为京张铁路从起点丰台站开始的第五个主要道口而得名，与双清路相交；1958年京包线东移后五道口随即成为与成府路的道口，并在新五道口北侧形成新的双清路道口（新的双清路道口不被称为五道口）。第一道口为京张铁路与广安门外大街交叉，二道口为京张铁路与阜成门外大街交叉，三道口为京张铁路与西直门外大街交叉，四道口为京张铁路与学院南路交叉。多数从北京北站始发的普通客货列车经过五道口。列车通过需要围栏挡住过往车辆行人通行，随着该地区交通量不断增大，经常造成交通堵塞。2016年11月1日起，因应京张城际铁路清华园隧道的建设需要，京包线北京北-清河段轨道计划拆除，四道口、五道口、双清路道口等平交道口也将不复存在。[1]从此，五道口成为了单纯的地名。",
    "塔式起重機（英語：），又稱塔式吊車，簡稱塔吊，是指机身为塔架式结构的全回转动臂架式起重机，為大型土木工程建築地盤內常見的運輸工具，建築材料、建築機械搬運，上高落低、縱橫交錯方向也可以，物件移動的任務能夠迅刻完成。通常約有10層樓高，呈「寸」字形，一端用來吊運物件，中間為控制室，另一端則以巨型混凝土塊確保平衡。由於結構有點像秤，所以在香港也俗稱為天秤（「秤」音「稱」）。塔式起重機通常會被固定在建築物中心，以便將物件搬到不同位置和高度",
    "并行计算机有以下五种访存模型：均匀访存模型（UMA）、非均匀访存模型（NUMA）、全高速缓存访存模型（COMA）、一致性高速缓存非均匀存储访问模型（CC-NUMA）和非远程存储访问模型（NORMA）。不像串行计算机那样，主流使用冯·诺伊曼的计算模型，并行计算机没有一个统一的计算模型。不过，人们已经提出了几种有价值的参考模型：PRAM模型，BSP模型，LogP模型，C^3模型等。",
    "酷玩樂團（英語：）是成立於1996年，來自英國英格蘭倫敦的另類搖滾樂團。團員包括克里斯·馬汀（主唱、鍵盤、吉他）、強尼·邦藍（主奏吉他）、蓋·貝瑞曼（貝斯吉他）及威爾·查恩（鼓、合音、其他樂器）。樂團最早成形於馬汀與邦藍就讀於倫敦大學學院時期。馬汀與邦藍組成了Pectoralz樂團之後，貝瑞曼加入樂團作為貝斯手，他們更名為海星樂團。[1]查恩是最後一個加入樂團的成員,當查恩加入了樂團之後，他們把樂團的名字改為酷玩樂團。[2]他們的前經理人菲爾·哈維通常都被當作為樂團第五個（非官方）成員。[3]酷玩樂團的早期作品常被與電台司令、U2、傑夫·巴克利及崔維斯相提並論[4]。2000年，他們以單曲《黃色》漸獲關注，隨後發行首張專輯《降落傘》，初試啼聲便在國際間大放異彩，並以該專輯獲水星音樂獎提名。2002年，酷玩樂團以第二張專輯《玩過頭》，奪得NME雜誌年度最佳專輯獎等多項大獎。酷玩樂團接著在2005年發行《XY密碼》專輯，雖然反應不如上述作品熱烈，但仍普遍獲得正面評價。2008年，酷玩樂團與製作人布萊恩·伊諾，推出第四張專輯《玩酷人生》，廣受好評，勇奪葛萊美等多項大獎[5]。2011年，他們繼續與布萊恩·伊諾合作，發行了第五張專輯《彩繪人生》，和之前的幾張專輯一樣取得了熱烈的反響。在全球，酷玩樂團已擁有超過1億張的專輯銷售量[6]。在2014年5月16日，他們發行了第六張專輯《鬼故事》，成為遍及100多個國家iTunes Store的專輯榜榜首。[7]",
    "Windows操作系统应用程序接口（），有非正式的简称法为WinAPI，是微软对于Windows操作系统中可用的核心应用程序编程接口的称法。它被设计为各种语言的程序调用，也是应用软件与Windows系统最直接的交互方式。大多数驱动程序需要对Windows系统更底层次访问接口，由所用版本的Windows的Native API来提供接口。Windows有一个软件开发套件（SDK, software development kit）提供相应的文档和工具，以使程序员开发使用Windows API的软件和利用Windows技术。Windows API所提供的功能可以归为七类",
    "浮士德（Faust、Faustus）是歐洲著名作家歌德的作品名稱及人物。原型參考了德國鍊金術士，占星學家約翰·喬治·浮士德。作品中的浮士德是個學識淵博，精通魔術的人物，為了追求知識和權力，向魔鬼作出交易，出卖了自己的靈魂。英國十六世紀劇作家馬羅（Christopher Marlowe）名著《浮士德（Dr Faustus）》的主角，以靈魂許與魔王，換取二十四年風光與權力。 他割臂滴血，將以血寫契約，不料上天示警，血液馬上凝固，書寫不得；他臂上還出現「Homo, fuge（君宜速逃）」兩個拉丁文字，只是他已大欲薰心，與魔王定約。二十四年轉眼過去，他最後只能自怨：「浮士德，你要罵自己，還要罵魔王，罵魔王令你失去天堂之樂。」有許多文學、音樂、歌劇、電影或漫畫以這個故事為藍本加以改編，例如白遼士的《浮士德的天譴》、李斯特的《浮士德交響曲》、古諾的《浮士德》、英國劇作家克里斯多福·馬洛的《浮士德博士悲劇》以至手塚治虫的《浮士德》。",
    "Turn 10工作室（英语：）是一家隸屬于微软遊戲部門微软工作室的美國電子遊戲發行商。公司於2001年建立，它以开发竞速模拟类游戏系列《极限竞速》系列而知名。游乐场游戏工作室（英語：）是一家英国的游戏开发商。成立于2009年，最为人熟知的作品是《极限竞速》系列的分支：《极限竞速 地平线》系列。",
    "无线对讲机，或无线步话机（英語：），是一种便携的双向无线电收发器，最早是因为军事用途而开发。主要的特征包括：半双工（每次只能完成接受或传送其中的一项）通道和按下按钮才可以传输。典型的外表像是一部移动电话，但较普通的移动电话大，顶上有一根天线。手持的收发器成为警察、紧急服务、工商业等用户非常有价值的通信工具，这些服务使用专用的频率。在部分地區，在指定頻率與功率內的無線對講機不用申请执照，常见于儿童玩具中。在CB信道从需要执照改为不需执照的状态前，通常在北美零售商店里出售的玩具无线对讲机的传输被限制在100毫瓦的功率和27兆赫公用频段；其它的玩具无线对讲机则与无绳电话和婴儿监视器共享49兆赫频段。通常这些设备有精美的包装，但是不能掩盖其粗糙的造型，甚至连音量控制都没有。",
    "UTF-8（）是一種針對Unicode的可變長度字元編碼，也是一种前缀码。它可以用一至四个字节对Unicode字符集中的所有有效编码点进行编码，属于Unicode标准的一部分，最初由肯·汤普逊和罗布·派克提出。[1][3]由于较小值的编码点一般使用频率较高，直接使用Unicode编码效率低下，大量浪费内存空间。UTF-8就是为了解决向后兼容ASCII码而设计，Unicode中前128个字符（与ASCII码一一对应），使用与ASCII码相同的二进制值的单个字节进行编码，這使得原來處理ASCII字元的軟體無須或只須做少部份修改，即可繼續使用。因此，它逐漸成為電子郵件、網頁及其他儲存或傳送文字優先採用的編碼方式。",
    "前置碼（英語：），又譯前綴碼，是一種編碼系統。這種編碼系統通常是可變長度碼，在其中的每個碼字，都具備「前置性質」（prefix property），也就是說，在編碼中的每個碼字，都不能被其他碼字當成前置部位。舉例而言，編碼字 {9, 55} 具備了前置性質，但編碼字{9, 5, 59, 55}就不具備，因為其中的5，是59及55的前置字。這也被稱為無首碼的代碼（，PFC，無前綴碼）。",
    "三一重工股份有限公司(SANY Heavy Industry Co., Ltd)，简称三一重工，由三一集团于1994年创立，2003年7月3日在A股上市（股票代码：600031）。2011年7月，三一重工以215.84亿美元的市值被英国《金融时报》评选为全球市值500强；[2]2012年1月，三一重工收购德国混凝土品牌普茨迈斯特（Putzmeister）。[3]三一集团（全称“三一集团有限公司”）为总部设于中国湖南长沙经济技术开发区的跨国集团公司，集团在印度、美国、德国、巴西投资建设工程机械研发制造中心。三一集团始创于1989年，其前身是由梁稳根、唐修国、毛中吾和袁金华等四人于1989年6月筹资创立的湖南省涟源市焊接材料厂。1991年9月，湖南省涟源市焊接材料厂更名为湖南省三一集团有限公司。集团核心企业三一重工于2003年在A股上市。2012年三一重工收购德国混凝土机械品牌普茨迈斯特。",
    "全断面隧道掘进机（英語：，缩写TBM）也稱潛盾機或盾构机（香港舊譯「隧道盾」），是一种專門用来開鑿隧道的大型機具。該機具有一次開挖完成隧道的特色，從開挖、推進、撐開全由該機具完成，開挖速度是傳統鑽炸工法的5倍。然而該機具完全無法模組化，只能依照開挖隧道的直徑訂作，因此購買價格不菲。",
    "橘子洲位于湖南省长沙市城区的湘江中央，是一个狭长的沙洲[1]，又名桔子洲、桔洲、橘洲、水陆洲。南北全长约5公里；东西最宽处约320米，最窄约170米。洲上有居民居住，现因为整体规划已迁出许多[2]。橘子洲于2001年成为长沙岳麓山风景名胜区橘子洲景区。每周六20:30～20:50放焰火（高考、中考期间和冬季取消），焰火当天18:00起就会禁止进入橘子洲，并且长沙地铁2号线会跳过橘子洲站而不停站（有时候湘江中路站也不停站）。",
    "圆明园位于現今的中華人民共和国北京市海淀区，是一组清朝的大型皇家园林，由圆明园及其附园长春园和绮春园（后改称万春园）组成，通称为“圆明三园”，占地350公顷，约合5,200亩[1]。圆明园规模宏伟，融会了各式园林风格，运用了各种造园技巧，再现诗画意境，被大多数中国园林学家认为是中国园林艺术史上的顶峰作品；被当作是中国古典园林平地造园、堆山理水集大成的典范。清朝时一些在中国的外国传教士参观圆明园之后将其称作“万园之园”。 [1]",
    "《黑客帝国》是一部1999年的好萊塢科幻电影，由沃卓斯基姐妹执导，基努·李維、勞倫斯·菲什伯恩、凱莉·安摩絲和雨果·威明等人主演，並由香港电影界的袁和平擔任武術指導。此片以哲理與基督教元素作為故事架構和子彈時間的特殊鏡頭及電腦特效著名，在全球獲得很高的票房，也在2003年，推出續集《駭客任務：重裝上陣》及第三集《駭客任務完結篇：最後戰役》，在2019年，因為該片的20周年慶而推出了它的4K修復版本，將經典重返大螢幕[3]。第四集《駭客任務4》預計於2021年上映。",
    "Haskell（发音为/ˈhæskəl/）[4]是一种标准化的，通用的纯函數式編程語言，有惰性求值和强静态类型[5]。它的命名源自美国逻辑学家哈斯凱爾·加里，他在数理逻辑方面上的工作使得函数式编程语言有了广泛的基础。在Haskell中，“函数是第一類物件”[6]。作为一门函數程式語言，主要控制结构是函数。Haskell语言是1990年在编程语言Miranda的基础上标准化的，并且以λ演算为基础发展而来。这也是为什么Haskell语言以希腊字母「λ」（Lambda）作为自己的标志。Haskell具有“证明即程序、命题为类型”的特征[7][8][9][10]。",
    "WEB 是一种计算机编程语言系统。它由高德纳设计，是第一种实现他称作“文学编程”的语言：旨在通过在描写性的文字中嵌入源代码，让开发者如同创建文学作品一样编写软件；而非像其他大多数编程语言中一样。相反，所采用的结构更注重人阅读要求，而非编译器的要求。使用WEB编写程序的最具有重要意义的有TeX和Metafont。现代的TeX发行版使用另外一个名为Web2C的程序将WEB源代码转换成C。WEB包含了2个主要程序：TANGLE，从源文本生成可编译的Pascal代码，以及WEAVE，使用TeX生成格式漂亮，可打印的文档。",
    "",
    "Metafont是一種用於定義矢量字體的編程語言。這也是Metafont直譯器的名稱，其生成的點陣字體，可嵌入到PostScript中。Metafont由高德納發明與也是他發明的TeX排版軟體相輔相成。 Metafont的特點之一是所有的字体都是用几何方程定义的，例如，可以用線段及貝茲曲線的相交處來定義點。",
    "机器语言（）是一種指令集的體。这种指令集称为機器碼（），是電腦的CPU可直接解讀的資料。機器碼有時也被稱為原生碼（），這個名詞比較強調某種程式語言或函式庫與執行平台相關的部份。",
    "布隆过滤器（英語：）是1970年由布隆提出的。它实际上是一个很长的二进制向量和一系列随机映射函数。布隆过滤器可以用于检索一个元素是否在一个集合中。它的优点是空间效率和查询时间都远远超过一般的算法，缺点是有一定的误识别率和删除困难。布隆过滤器的原理是，当一个元素被加入集合时，通过K个散列函数将这个元素映射成一个位数组中的K个点，把它们置为1。检索时，我们只要看看这些点是不是都是1就（大约）知道集合中有没有它了：如果这些点有任何一个0，则被检元素一定不在；如果都是1，则被检元素很可能在。这就是布隆过滤器的基本思想。",
    "《编译原理》（英語：）是一部由阿尔佛雷德·艾侯、拉维·塞提和杰弗瑞·乌尔曼合著的计算机科学教材，探讨了编译器设计方面的若干重要课题，被视为编译原理领域的经典教材之一。该书的第一版出版于1986年，第二版出版于2006年；因两版封面均绘有屠龙勇士和恶龙搏斗的画面而被几代计算机科学工作者昵称为《龙书》（英語：）。[1] [2][3][4]",
    "伊丽莎白二世生于伦敦，为约克公爵及公爵夫人（日后的乔治六世及伊丽莎白王后）长女，在家中接受私人教育。1936年伯父爱德华八世退位，父亲佐治六世[3]即位，伊丽莎白亦由此成为王位推定继承人。第二次世界大战期间她开始履行公共职责，并于本土辅助部队服役。1947年伊丽莎白與希臘的菲利浦王子成婚，两人育有三子一女：查尔斯王子、安妮公主、安德鲁王子和爱德华王子。伊丽莎白二世亦是英国历史上最为長壽的君主和现今世上最年长的君主。她在2015年9月9日超越其高祖母维多利亚女王（在位63年餘），成为英国史上在位时间最长的君主，同时也成为世界历史上在位时间最长的女性君主及女性国家元首；2016年10月，在泰國君主拉瑪九世駕崩后成為現時統治國家時間最長的國家元首；2019年4月，已經退休的盧森堡大公若望駕崩後，她成為目前世界上最为年長的君主。",
    "袁隆平（1930年9月7日－），男，祖籍江西德安，生于北京，现居湖南长沙。中国杂交水稻育种专家，中国工程院院士。现任国家杂交水稻工程技术研究中心主任暨湖南杂交水稻研究中心主任、湖南农业大学教授、中国农业大学客座教授、联合国粮农组织首席顾问、湖南省科协副主席。1988年1月至2016年1月，长期担任湖南省政协副主席职务[2]。2006年4月当选美国科学院外籍院士。根据他育种的杂交水稻品种及研究，水稻单位产量由亩产300公斤上升到900公斤以上。他也被广泛誉为“杂交水稻之父”[3][4]。曾获马来西亚前首相马哈迪·莫哈末所颁发的2011年“马哈迪科学奖”[5]。",
    "中国科学院高能物理研究所（以下简称“高能所”）成功建造并运行了北京正负电子对撞机。2012年7月4日，希格斯玻色子被探测到。9月，高能所提出建造CEPC-SppC。2015年2月至3月，在高能所进行CEPC《初步概念设计报告》国际评审会。2017年11月7日，40多家企业联合组织成立“CEPC产业促进会”。2018年11月14日，CEPC《概念设计报告》两卷正式发布，报告包括《加速器卷》和《探测器和物理卷》。[1] 11月28日，国家重点研发计划大科学装置专项“高能环形正负电子对撞机关键技术研发和验证”项目在高能所召开启动会。",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "topic FOR *STAR*： 桥 电力系统 新能源  海洋 城市规划 建筑 风"
]